#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   КлючВарианта - Строка - Ключ варианта
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - из:
//    *Менеджер - Строка -
//    *Представление - Строка -
//    *МножественныйВыбор - Булево - 
//    *Важность - Строка -
//    *КлючВарианта - Строка -
Функция ДобавитьКомандуОтчета(КомандыОтчетов, КлючВарианта = "") Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ТрудоемкостьЗаказаНаПроизводство) 
			И ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.ТрудоемкостьЗаказаНаПроизводство.ПолноеИмя();
		
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Важность = "Обычное";
		Если ЗначениеЗаполнено(КлючВарианта) Тогда
			КомандаОтчет.КлючВарианта = КлючВарианта;
		КонецЕсли;
		
		Если КлючВарианта = "ТрудоемкостьПоЗаказу" Тогда
			
			КомандаОтчет.Представление = НСтр("ru = 'Трудоемкость заказа';
												|en = 'Order labor input'");
			
		ИначеЕсли КлючВарианта = "ТрудоемкостьПоПартии" Тогда
			
			КомандаОтчет.Представление = НСтр("ru = 'Трудоемкость по партии';
												|en = 'Labor input by lot'");
			
		ИначеЕсли КлючВарианта = "ТрудоемкостьПоЭтапу" Тогда
			
			КомандаОтчет.Представление = НСтр("ru = 'Трудоемкость по этапу';
												|en = 'Labor input by stage'");
		
		КонецЕсли;
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#КонецОбласти
		
#КонецЕсли