#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение Тогда
		ИнтеграцияСРаботаВРоссии.ПроверитьРегламентныеЗадания(Истина);
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		МетаданныеЗадания = Метаданные.РегламентныеЗадания.ПолучениеДокументовРаботаВРоссии;
		ОбщегоНазначенияБЗК.ОтключитьПредопределенноеЗадание(МетаданныеЗадания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли