#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 21, 0);
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Функция ВыгрузитьУведомлениеОбИсчисленныхСуммахНалогов(ДокументСсылка, УникальныйИдентификатор = Неопределено) Экспорт
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	УведомлениеОбъект = ДокументОбъект.Уведомление.ПолучитьОбъект();
	Возврат УведомлениеОбъект.ВыгрузитьДокумент(УникальныйИдентификатор)
	
КонецФункции

#КонецОбласти

Функция СтатусДокумента(ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитУведомление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Уведомление");
	
	Возврат ИнтерфейсыВзаимодействияБРО.СостояниеДокумента(РеквизитУведомление);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеДокумента(ДокументСсылка) Экспорт
	
	ОписаниеДокумента = Новый Структура("Наименование, Сумма");
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		РеквизитыДокумента    = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
			"Номер, Дата, СуммаДокумента, Уведомление");
		
		НаименованиеДокумента = ДокументСсылка.Метаданные().Синоним;
		НомерДокумента        = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.Номер, Истина, Истина);
		ДатаДокумента         = Формат(РеквизитыДокумента.Дата,"ДЛФ=D");
		Статус                = ИнтерфейсыВзаимодействияБРО.ПредставлениеСостоянияДокумента(РеквизитыДокумента.Уведомление);
		
		ШаблонПредставления = НСтр("ru = '%1 %2 от %3 на сумму %4 (%5)';
									|en = '%1 %2 dated %3 in the amount of %4 (%5)'");
		
		ОписаниеДокумента.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления,
			НаименованиеДокумента, НомерДокумента, ДатаДокумента, Формат(РеквизитыДокумента.СуммаДокумента, "ЧДЦ=2; ЧН=0,00"), Статус);
		ОписаниеДокумента.Сумма = РеквизитыДокумента.СуммаДокумента;
	КонецЕсли;
	
	Возврат ОписаниеДокумента;
	
КонецФункции

Функция ДатаНачалаСторнированияДублирующихУведомлений() Экспорт
	
	Возврат Дата(2023, 10, 1);
	
КонецФункции

Функция ПолучитьДанныеДляУведомления(ПараметрыЗаполнения) Экспорт
	
	ТаблицаНалогов = ПустаяСсылка().Налоги.ВыгрузитьКолонки();
	
	Организация = Неопределено;
	ДатаУведомления = '00010101';
	
	Если НЕ (ПараметрыЗаполнения.Свойство("Организация", Организация) И ЗначениеЗаполнено(Организация)
		И ПараметрыЗаполнения.Свойство("ДатаУведомления", ДатаУведомления) И ЗначениеЗаполнено(ДатаУведомления)) Тогда
		Возврат ТаблицаНалогов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаУведомления", НачалоДня(ДатаУведомления));
	РегистрацияВНалоговомОргане = Справочники.РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане(Организация, ДатаУведомления);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("КодПоОКТМО", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрацияВНалоговомОргане, "КодПоОКТМО"));
	ОтборНДФЛЗаПервуюПоловинуПериода = ПараметрыЗаполнения.Свойство("НДФЛЗаПервуюПоловинуПериода") И ПараметрыЗаполнения.НДФЛЗаПервуюПоловинуПериода;
	Запрос.УстановитьПараметр("НДФЛЗаПервуюПоловинуПериода", ОтборНДФЛЗаПервуюПоловинуПериода);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расшифровка.ТипНалога КАК ТипНалога,
	|	Расшифровка.КодБК КАК КодБК,
	|	ЕСТЬNULL(Регистрации.Ссылка, &РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане,
	|	ЕСТЬNULL(Регистрации.КодПоОКТМО, &КодПоОКТМО) КАК КодПоОКТМО,
	|	Расшифровка.НачалоПериода КАК НачалоПериода,
	|	Расшифровка.КонецПериода КАК КонецПериода,
	|	Расшифровка.СрокУплаты КАК СрокУплаты,
	|	СУММА(Расшифровка.Сумма) КАК Сумма
	|ИЗ
	|	Документ.НачислениеЕНП КАК ДанныеДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЕНП.РасшифровкаНалогов КАК Расшифровка
	|		ПО ДанныеДокумента.Ссылка = Расшифровка.Ссылка
	|		И Расшифровка.ФормироватьУведомление
	|		И ДанныеДокумента.Проведен
	|		И ((&НДФЛЗаПервуюПоловинуПериода И ДанныеДокумента.ПредварительноеУведомлениеПоНДФЛ)
	|			ИЛИ НЕ &НДФЛЗаПервуюПоловинуПериода)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК Регистрации
	|	ПО Регистрации.Ссылка = (ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Расшифровка.Субконто1) = ТИП(Справочник.РегистрацииВНалоговомОргане)
	|			ТОГДА Расшифровка.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(Расшифровка.Субконто2) = ТИП(Справочник.РегистрацииВНалоговомОргане)
	|			ТОГДА Расшифровка.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(Расшифровка.Субконто3) = ТИП(Справочник.РегистрацииВНалоговомОргане)
	|			ТОГДА Расшифровка.Субконто3
	|		ИНАЧЕ &РегистрацияВНалоговомОргане
	|	КОНЕЦ)
	|
	|ГДЕ
	|	ДанныеДокумента.Организация = &Организация
	|	И Расшифровка.СрокУплаты >= &ДатаУведомления
	|
	|СГРУППИРОВАТЬ ПО
	|	Расшифровка.ТипНалога,
	|	Расшифровка.КодБК,
	|	Расшифровка.НачалоПериода,
	|	Расшифровка.КонецПериода,
	|	Расшифровка.СрокУплаты,
	|	Регистрации.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНалогов.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат ТаблицаНалогов;
	
КонецФункции

Функция КБКПоТипамНалогов(Знач Период) Экспорт
	
	ГодПлатежа = Год(Период);
	
	Макеты = Метаданные.Документы.УведомлениеОбИсчисленныхСуммахНалогов.Макеты;
	Если Макеты.Найти("КБК" + Формат(ГодПлатежа, "ЧГ=")) <> Неопределено Тогда
		Макет = ПолучитьМакет("КБК" + Формат(ГодПлатежа, "ЧГ="));
	Иначе
		Макет = ПолучитьМакет("КБК");
	КонецЕсли;
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ Ссылка КАК Ссылка
	|ИЗ Перечисление.ТипыНалогов";
	Результат = Запрос.Выполнить();
	
	ПодвидыДоходов = ПодвидыДоходовСтандартные(ГодПлатежа);
	ПодвидыДоходовИсключений = ПодвидыДоходовИсключений(ГодПлатежа);
	
	ТипыНалогов = Результат.Выбрать();
	Пока ТипыНалогов.Следующий() Цикл
		
		ОбластьКБК = Макет.Области.Найти(ОбщегоНазначения.ИмяЗначенияПеречисления(ТипыНалогов.Ссылка));
		Если ОбластьКБК = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокСтатей = Новый СписокЗначений;
		Для НомерСтроки = ОбластьКБК.Верх По ОбластьКБК.Низ Цикл
			
			КодБК    = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
			Описание = СокрЛП(Макет.Область(НомерСтроки, 2).Текст);
			Если ПустаяСтрока(КодБК) Тогда Продолжить; КонецЕсли;
			
			СтатьяБюджета = СтатьяДоходовБюджета(КодБК);
			
			Если ПодвидыДоходовИсключений.Свойство("ВД" + СтатьяБюджета.ВидДохода) Тогда
				ПодвидыДохода = ПодвидыДоходовИсключений["ВД" + СтатьяБюджета.ВидДохода];
			ИначеЕсли ПодвидыДоходов.Свойство("АД" + СтатьяБюджета.Администратор) Тогда
				ПодвидыДохода = ПодвидыДоходов["АД" + СтатьяБюджета.Администратор];
			Иначе
				ПодвидыДохода = ПодвидыДоходов["АД" + ПлатежиВБюджетКлиентСервер.ПустойКодГлавногоАдминистратора()];
			КонецЕсли;
			
			Для Каждого ПодвидДохода Из ПодвидыДохода Цикл
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтатьяБюджета.ПодвидыДохода, ПодвидДохода);
			КонецЦикла;
			
			СписокСтатей.Добавить(СтатьяБюджета, Описание);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СписокСтатей) Тогда
			Соответствие.Вставить(ТипыНалогов.Ссылка, СписокСтатей);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция СтатьяДоходовБюджета(Знач КодБК) Экспорт
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КодБК) Тогда
		Возврат Неопределено;
	ИначеЕсли Не (СтрДлина(КодБК) = 17 ИЛИ СтрДлина(КодБК) = 20) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрДлина(КодБК) = 17 Тогда
		КодБК = ПлатежиВБюджетКлиентСервер.ПустойКодГлавногоАдминистратора() + КодБК;
	КонецЕсли;
	
	Администратор = ПлатежиВБюджетКлиентСервер.КодГлавногоАдминистратора(КодБК);
	ВидДохода     = ПлатежиВБюджетКлиентСервер.КодВидаДоходов(КодБК);
	ПодвидДохода  = ПлатежиВБюджетКлиентСервер.ПустойКодПодвидаДоходов();
	КОСГУ         = ПлатежиВБюджетКлиентСервер.КодОперацииСектораУправления(КодБК);
	
	Описание = Новый Структура;
	Описание.Вставить("КодБК", Администратор + ВидДохода + ПодвидДохода + КОСГУ);
	Описание.Вставить("Администратор", Администратор);
	Описание.Вставить("ВидДохода",     ВидДохода);
	Описание.Вставить("ПодвидыДохода", Новый Массив);
	Описание.Вставить("КОСГУ", КОСГУ);
	
	Возврат Описание;
	
КонецФункции

Функция ПодвидыДоходовСтандартные(ГодПлатежа)
	
	ПодвидыДохода = Новый Структура;
	
	ВидыПлатежей = Перечисления.ВидыПлатежейВГосБюджет;
	
	НалогПениПроцентыИШтрафы = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - сумма налога (взноса)';
			|en = '1000 - сумма налога (взноса)'"));
	Если ГодПлатежа < Год(ПлатежиВБюджетКлиентСервер.НачалоДействияПриказа126н()) Тогда
		ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "2000", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2000 - пени и проценты по налогу (взносу)';
				|en = '2000 - пени и проценты по налогу (взносу)'"));
	Иначе
		ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "2100", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2100 - пени по налогу (взносу)';
				|en = '2100 - пени по налогу (взносу)'"));
		ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "2200", ВидыПлатежей.Проценты,
			НСтр("ru = '2200 - проценты по налогу (взносу)';
				|en = '2200 - проценты по налогу (взносу)'"));
	КонецЕсли;
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - суммы штрафов по налогу (взносу)';
			|en = '3000 - суммы штрафов по налогу (взносу)'"));
	ПодвидыДохода.Вставить("АД" + ПлатежиВБюджетКлиентСервер.КодАдминистрированияНалоговымиОрганами(),
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НалогПениПроцентыИШтрафы));
	
	НалогПениПроцентыИШтрафы = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "0000", ВидыПлатежей.Налог,
		НСтр("ru = '0000 - сумма авансового платежа';
			|en = '0000 - сумма авансового платежа'"));
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - сумма платежа';
			|en = '1000 - сумма платежа'"));
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "2000", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2000 - пени и проценты по соответствующему платежу';
			|en = '2000 - пени и проценты по соответствующему платежу'"));
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - суммы денежных взысканий (штрафов) по соответствующему платежу';
			|en = '3000 - суммы денежных взысканий (штрафов) по соответствующему платежу'"));
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "5000", ВидыПлатежей.Проценты,
		НСтр("ru = '5000 - уплата процентов, начисленных на суммы излишне взысканных (уплаченных) платежей, а также при нарушении сроков их возврата';
			|en = '5000 - уплата процентов, начисленных на суммы излишне взысканных (уплаченных) платежей, а также при нарушении сроков их возврата'"));
	ПодвидыДохода.Вставить("АД" + ПлатежиВБюджетКлиентСервер.КодАдминистрированияФТС(),
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НалогПениПроцентыИШтрафы));
	
	НалогПениПроцентыИШтрафы = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - сумма взноса';
			|en = '1000 - сумма взноса'"));
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "2000", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2000 - пени и проценты по взносу';
			|en = '2000 - пени и проценты по взносу'"));
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - суммы штрафов по взносу';
			|en = '3000 - суммы штрафов по взносу'"));
	ДобавитьПодвидДоходаВСписок(НалогПениПроцентыИШтрафы, "6000", ВидыПлатежей.Штраф,
		НСтр("ru = '6000 - суммы и штрафы в федеральные государственные органы, внебюджетные фонды, Банк России';
			|en = '6000 - суммы и штрафы в федеральные государственные органы, внебюджетные фонды, Банк России'"));
	ПодвидыДохода.Вставить("АД" + ПлатежиВБюджетКлиентСервер.ПустойКодГлавногоАдминистратора(),
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НалогПениПроцентыИШтрафы));
	
	Возврат Новый ФиксированнаяСтруктура(ПодвидыДохода);
	
КонецФункции

Функция ПодвидыДоходовИсключений(ГодПлатежа)
	
	ВидИПодвидДоходаИсключения = Новый Структура;
	
	ВидыПлатежей = Перечисления.ВидыПлатежейВГосБюджет;
	
	// Страховые взносы на обязательное медицинское страхование работающего населения,
	// зачисляемые в бюджет Федерального фонда обязательного медицинского страхования
	СтраховыеВзносы           = Новый Соответствие;
	ПениПоСтраховыеВзносы     = Новый Соответствие;
	ПроцентыПоСтраховыеВзносы = Новый Соответствие;
	ШтрафыПоСтраховыеВзносы   = Новый Соответствие;
	Если ГодПлатежа < Год(ПлатежиВБюджетКлиентСервер.НачалоДействияПриказа2017_90н()) Тогда
		ДобавитьПодвидДоходаВСписок(СтраховыеВзносы, "1011", ВидыПлатежей.Налог,
			НСтр("ru = '1011 - страховые взносы до 2017 г. на обязательное медицинское страхование (ОМС)';
				|en = '1011 - страховые взносы до 2017 г. на обязательное медицинское страхование (ОМС)'"));
		ДобавитьПодвидДоходаВСписок(ПениПоСтраховыеВзносы, "2011", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2011 - пени и проценты по страховым взносам до 2017 г. на обязательное медицинское страхование (ОМС)';
				|en = '2011 - пени и проценты по страховым взносам до 2017 г. на обязательное медицинское страхование (ОМС)'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыПоСтраховыеВзносы, "3011", ВидыПлатежей.Штраф,
			НСтр("ru = '3011 - штрафы по страховым взносам до 2017 г. на обязательное медицинское страхование (ОМС)';
				|en = '3011 - штрафы по страховым взносам до 2017 г. на обязательное медицинское страхование (ОМС)'"));
	Иначе
		ДобавитьПодвидДоходаВСписок(СтраховыеВзносы, "1013", ВидыПлатежей.Налог,
			НСтр("ru = '1013 - страховые взносы с 2017 г. на обязательное медицинское страхование (ОМС)';
				|en = '1013 - страховые взносы с 2017 г. на обязательное медицинское страхование (ОМС)'"));
		ДобавитьПодвидДоходаВСписок(ПениПоСтраховыеВзносы, "2013", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2013 - пени по страховым взносам с 2017 г. на обязательное медицинское страхование (ОМС)';
				|en = '2013 - пени по страховым взносам с 2017 г. на обязательное медицинское страхование (ОМС)'"));
		ДобавитьПодвидДоходаВСписок(ПроцентыПоСтраховыеВзносы, "2213", ВидыПлатежей.Проценты,
			НСтр("ru = '2213 - проценты по страховым взносам с 2017 г. на обязательное медицинское страхование (ОМС)';
				|en = '2213 - проценты по страховым взносам с 2017 г. на обязательное медицинское страхование (ОМС)'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыПоСтраховыеВзносы, "3013", ВидыПлатежей.Штраф,
			НСтр("ru = '3013 - штрафы по страховым взносам с 2017 г. на обязательное медицинское страхование (ОМС)';
				|en = '3013 - штрафы по страховым взносам с 2017 г. на обязательное медицинское страхование (ОМС)'"));
	КонецЕсли;
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыеВзносы);
	ПодвидыДохода.Добавить(ПениПоСтраховыеВзносы);
	Если ГодПлатежа >= Год(ПлатежиВБюджетКлиентСервер.НачалоДействияПриказа90н()) Тогда
		ПодвидыДохода.Добавить(ПроцентыПоСтраховыеВзносы);
	КонецЕсли;
	ПодвидыДохода.Добавить(ШтрафыПоСтраховыеВзносы);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020210108", ПодвидыДохода); // за работников, не действует с 2023
	
	// Дополнительные страховые взносы на накопительную часть трудовой пенсии, зачисляемые в Пенсионный фонд Российской Федерации
	ДопВзносыСамостоятельно = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ДопВзносыСамостоятельно, "1100", ВидыПлатежей.Налог,
		НСтр("ru = '1100 - дополнительные страховые взносы на накопительную часть трудовой пенсии (для лиц уплачивающих самостоятельно)';
			|en = '1100 - дополнительные страховые взносы на накопительную часть трудовой пенсии (для лиц уплачивающих самостоятельно)'"));
	ДопВзносыРаботодатель   = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ДопВзносыРаботодатель, "1200", ВидыПлатежей.Налог,
		НСтр("ru = '1200 - дополнительные страховые взносы на накопительную часть трудовой пенсии (софинансирование работодателем)';
			|en = '1200 - дополнительные страховые взносы на накопительную часть трудовой пенсии (софинансирование работодателем)'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ДопВзносыСамостоятельно);
	ПодвидыДохода.Добавить(ДопВзносыРаботодатель);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020204106", ПодвидыДохода); // не действует с 2023
	
	// Дополнительные страховые взносы на накопительную пенсию и взносы работодателя в пользу застрахованных лиц,
	// уплачивающих дополнительные страховые взносы на накопительную пенсию, зачисляемые в Социальный Фонд России
	ДопВзносыСамостоятельно = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ДопВзносыСамостоятельно, "1100", ВидыПлатежей.Налог,
		НСтр("ru = '1100 - дополнительные страховые взносы на накопительную пенсию (для лиц уплачивающих самостоятельно)';
			|en = '1100 - дополнительные страховые взносы на накопительную пенсию (для лиц уплачивающих самостоятельно)'"));
	ДопВзносыРаботодатель   = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ДопВзносыРаботодатель, "1200", ВидыПлатежей.Налог,
		НСтр("ru = '1200 - дополнительные страховые взносы на накопительную пенсию (софинансирование работодателем)';
			|en = '1200 - дополнительные страховые взносы на накопительную пенсию (софинансирование работодателем)'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ДопВзносыСамостоятельно);
	ПодвидыДохода.Добавить(ДопВзносыРаботодатель);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020700006", ПодвидыДохода);
	
	// Фиксированные взносы в ФСС
	ФиксированныеВзносыФСС = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ФиксированныеВзносыФСС, "6000", ВидыПлатежей.Налог,
		НСтр("ru = '6000 - фиксированные взносы в Фонд социального страхования';
			|en = '6000 - фиксированные взносы в Фонд социального страхования'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ФиксированныеВзносыФСС);
	ВидИПодвидДоходаИсключения.Вставить("ВД1170602007", ПодвидыДохода); // не действует с 2023
	
	ФиксированныеВзносыСФК = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ФиксированныеВзносыСФК, "6000", ВидыПлатежей.Налог,
		НСтр("ru = '6000 - фиксированные взносы в Фонд социального и пенсионного страхования';
			|en = '6000 - фиксированные взносы в Фонд социального и пенсионного страхования'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ФиксированныеВзносыСФК);
	ВидИПодвидДоходаИсключения.Вставить("ВД1170601206", ПодвидыДохода);
	
	СтраховыеВзносыДо2012 = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(СтраховыеВзносыДо2012, "1012", ВидыПлатежей.Налог,
		НСтр("ru = '1012 - страховые взносы на обязательное медицинское страхование (ОМС) за себя до 2012 года';
			|en = '1012 - страховые взносы на обязательное медицинское страхование (ОМС) за себя до 2012 года'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыеВзносы);
	Если ГодПлатежа < Год(ПлатежиВБюджетКлиентСервер.НачалоДействияПриказа2017_90н()) Тогда
		ПодвидыДохода.Добавить(СтраховыеВзносыДо2012);
	КонецЕсли;
	ПодвидыДохода.Добавить(ПениПоСтраховыеВзносы);
	ПодвидыДохода.Добавить(ШтрафыПоСтраховыеВзносы);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020210308", ПодвидыДохода); // за себя, не действует с 2023
	
	// Страховые взносы на ОПС на выплату страховой пенсии.
	ВзносыНаОПССтраховая           = Новый Соответствие;
	ПениНаВзносыНаОПССтраховая     = Новый Соответствие;
	ПроцентыНаВзносыНаОПССтраховая = Новый Соответствие;
	ШтрафыНаВзносыНаОПССтраховая   = Новый Соответствие;
	Если ГодПлатежа < Год(ПлатежиВБюджетКлиентСервер.НачалоДействияПриказа2017_90н()) Тогда
		ДобавитьПодвидДоходаВСписок(ВзносыНаОПССтраховая, "1000", ВидыПлатежей.Налог,
			НСтр("ru = '1000 - страховые взносы до 2017 г. на ОПС на выплату страховой пенсии';
				|en = '1000 - страховые взносы до 2017 г. на ОПС на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ПениНаВзносыНаОПССтраховая, "2100",  ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2100 - пени по страховым взносам до 2017 г. на ОПС на выплату страховой пенсии';
				|en = '2100 - пени по страховым взносам до 2017 г. на ОПС на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ПроцентыНаВзносыНаОПССтраховая, "2200", ВидыПлатежей.Проценты,
			НСтр("ru = '2200 - проценты по страховым взносам до 2017 г. на ОПС на выплату страховой пенсии';
				|en = '2200 - проценты по страховым взносам до 2017 г. на ОПС на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыНаВзносыНаОПССтраховая, "3000", ВидыПлатежей.Штраф,
			НСтр("ru = '3000 - штрафы по страховым взносам до 2017 г. на ОПС на выплату страховой пенсии';
				|en = '3000 - штрафы по страховым взносам до 2017 г. на ОПС на выплату страховой пенсии'"));
	Иначе
		ДобавитьПодвидДоходаВСписок(ВзносыНаОПССтраховая, "1010", ВидыПлатежей.Налог,
			НСтр("ru = '1010 - страховые взносы с 2017 г. на ОПС на выплату страховой пенсии';
				|en = '1010 - страховые взносы с 2017 г. на ОПС на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ПениНаВзносыНаОПССтраховая, "2110", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2110 - пени по страховым взносам с 2017 г. на ОПС на выплату страховой пенсии';
				|en = '2110 - пени по страховым взносам с 2017 г. на ОПС на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ПроцентыНаВзносыНаОПССтраховая, "2210", ВидыПлатежей.Проценты,
			НСтр("ru = '2210 - проценты по страховым взносам с 2017 г. на ОПС на выплату страховой пенсии';
				|en = '2210 - проценты по страховым взносам с 2017 г. на ОПС на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыНаВзносыНаОПССтраховая, "3010", ВидыПлатежей.Штраф,
			НСтр("ru = '3010 - штрафы по страховым взносам с 2017 г. на ОПС на выплату страховой пенсии';
				|en = '3010 - штрафы по страховым взносам с 2017 г. на ОПС на выплату страховой пенсии'"));
	КонецЕсли;
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ВзносыНаОПССтраховая);
	ПодвидыДохода.Добавить(ПениНаВзносыНаОПССтраховая);
	ПодвидыДохода.Добавить(ПроцентыНаВзносыНаОПССтраховая);
	ПодвидыДохода.Добавить(ШтрафыНаВзносыНаОПССтраховая);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020201006", ПодвидыДохода); // не действует с 2023
	
	СтраховыеВзносыЕдиныйТариф         = Новый Соответствие;
	ШтрафыНаСтраховыеВзносыЕдиныйТариф = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(СтраховыеВзносыЕдиныйТариф, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - Страховые взносы по единому тарифу';
			|en = '1000 - Страховые взносы по единому тарифу'"));
	ДобавитьПодвидДоходаВСписок(СтраховыеВзносыЕдиныйТариф, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - штрафы по страховым взносам по единому тарифу';
			|en = '3000 - штрафы по страховым взносам по единому тарифу'"));
	
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыеВзносыЕдиныйТариф);
	ПодвидыДохода.Добавить(ШтрафыНаСтраховыеВзносыЕдиныйТариф);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020100001", ПодвидыДохода);
	
	СтраховыеВзносыИностранцев         = Новый Соответствие;
	ШтрафыНаСтраховыеВзносыИностранцев = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(СтраховыеВзносыИностранцев, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - Страховые взносы иностранных работников';
			|en = '1000 - Страховые взносы иностранных работников'"));
	ДобавитьПодвидДоходаВСписок(ШтрафыНаСтраховыеВзносыИностранцев, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - штрафы по страховым взносам иностранных работников';
			|en = '3000 - штрафы по страховым взносам иностранных работников'"));
	
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыеВзносыИностранцев);
	ПодвидыДохода.Добавить(ШтрафыНаСтраховыеВзносыИностранцев);
	ВидИПодвидДоходаИсключения.Вставить("ВД1021501006", ПодвидыДохода);
	ВидИПодвидДоходаИсключения.Вставить("ВД1021502006", ПодвидыДохода);
	ВидИПодвидДоходаИсключения.Вставить("ВД1021503008", ПодвидыДохода);
	
	// Страховые взносы на ОПС в фиксированном размере на выплату страховой пенсии - они разбиваются на:
	//  - исчисленные с суммы дохода плательщика, не превышающие предельной величины дохода;
	//  - исчисленные с суммы дохода плательщика, полученной сверх предельной величины дохода.
	ВзносыНаОПСвФиксированномРазмереДо         = Новый Соответствие;
	ВзносыНаОПСвФиксированномРазмереСверх      = Новый Соответствие;
	ПениНаВзносыНаОПСвФиксированномРазмере     = Новый Соответствие;
	ПроцентыНаВзносыНаОПСвФиксированномРазмере = Новый Соответствие;
	ШтрафыНаВзносыНаОПСвФиксированномРазмере   = Новый Соответствие;
	Если ГодПлатежа < Год(ПлатежиВБюджетКлиентСервер.НачалоДействияПриказа2017_90н()) Тогда
		ДобавитьПодвидДоходаВСписок(ВзносыНаОПСвФиксированномРазмереДо, "1100", ВидыПлатежей.Налог,
			НСтр("ru = '1100 - страховые взносы на ОПС в фиксированном размере до 2017 г., исчисленные с суммы дохода, не превышающие предела';
				|en = '1100 - страховые взносы на ОПС в фиксированном размере до 2017 г., исчисленные с суммы дохода, не превышающие предела'"));
		ДобавитьПодвидДоходаВСписок(ВзносыНаОПСвФиксированномРазмереСверх, "1200", ВидыПлатежей.Налог,
			НСтр("ru = '1200 - страховые взносы на ОПС в фиксированном размере до 2017 г., исчисленные с суммы дохода, полученной сверх предела';
				|en = '1200 - страховые взносы на ОПС в фиксированном размере до 2017 г., исчисленные с суммы дохода, полученной сверх предела'"));
		ДобавитьПодвидДоходаВСписок(ПениНаВзносыНаОПСвФиксированномРазмере, "2100", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2100 - пени по страховым взносам на ОПС в фиксированном размере до 2017 г. на выплату страховой пенсии';
				|en = '2100 - пени по страховым взносам на ОПС в фиксированном размере до 2017 г. на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ПроцентыНаВзносыНаОПСвФиксированномРазмере, "2200", ВидыПлатежей.Проценты,
			НСтр("ru = '2200 - проценты по страховым взносам на ОПС в фиксированном размере до 2017 г. на выплату страховой пенсии';
				|en = '2200 - проценты по страховым взносам на ОПС в фиксированном размере до 2017 г. на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыНаВзносыНаОПСвФиксированномРазмере, "3000", ВидыПлатежей.Штраф,
			НСтр("ru = '3000 - штрафы по страховым взносам на ОПС в фиксированном размере до 2017 г. на выплату страховой пенсии';
				|en = '3000 - штрафы по страховым взносам на ОПС в фиксированном размере до 2017 г. на выплату страховой пенсии'"));
	Иначе
		ДобавитьПодвидДоходаВСписок(ВзносыНаОПСвФиксированномРазмереДо, "1110", ВидыПлатежей.Налог,
			НСтр("ru = '1110 - страховые взносы на ОПС в фиксированном размере с 2017 г.';
				|en = '1110 - страховые взносы на ОПС в фиксированном размере с 2017 г.'"));
		ДобавитьПодвидДоходаВСписок(ПениНаВзносыНаОПСвФиксированномРазмере, "2110", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2110 - пени по страховым взносам на ОПС в фиксированном размере с 2017 г. на выплату страховой пенсии';
				|en = '2110 - пени по страховым взносам на ОПС в фиксированном размере с 2017 г. на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ПроцентыНаВзносыНаОПСвФиксированномРазмере, "2210", ВидыПлатежей.Проценты,
			НСтр("ru = '2210 - проценты по страховым взносам на ОПС в фиксированном размере с 2017 г. на выплату страховой пенсии';
				|en = '2210 - проценты по страховым взносам на ОПС в фиксированном размере с 2017 г. на выплату страховой пенсии'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыНаВзносыНаОПСвФиксированномРазмере, "3010", ВидыПлатежей.Штраф,
			НСтр("ru = '3010 - штрафы по страховым взносам на ОПС в фиксированном размере с 2017 г. на выплату страховой пенсии';
				|en = '3010 - штрафы по страховым взносам на ОПС в фиксированном размере с 2017 г. на выплату страховой пенсии'"));
	КонецЕсли;
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ВзносыНаОПСвФиксированномРазмереДо);
	ПодвидыДохода.Добавить(ВзносыНаОПСвФиксированномРазмереСверх);
	ПодвидыДохода.Добавить(ПениНаВзносыНаОПСвФиксированномРазмере);
	ПодвидыДохода.Добавить(ПроцентыНаВзносыНаОПСвФиксированномРазмере);
	ПодвидыДохода.Добавить(ШтрафыНаВзносыНаОПСвФиксированномРазмере);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020214006", ПодвидыДохода); // не действует с 2023
	
	СтраховыеВзносыЕдиныйТарифИП         = Новый Соответствие;
	ШтрафыНаСтраховыеВзносыЕдиныйТарифИП = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(СтраховыеВзносыЕдиныйТарифИП, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - страховые взносы единый тариф ИП';
			|en = '1000 - страховые взносы единый тариф ИП'"));
	ДобавитьПодвидДоходаВСписок(ШтрафыНаСтраховыеВзносыЕдиныйТарифИП, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - штраф по страховым взносам единый тариф ИП';
			|en = '3000 - штраф по страховым взносам единый тариф ИП'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыеВзносыЕдиныйТарифИП);
	ПодвидыДохода.Добавить(ШтрафыНаСтраховыеВзносыЕдиныйТарифИП);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020200001", ПодвидыДохода);
	
	ФиксированныеВзносыВПФР         = Новый Соответствие;
	ШтрафыНаФиксированныеВзносыВПФР = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ФиксированныеВзносыВПФР, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - фиксированные взносы свыше предела';
			|en = '1000 - фиксированные взносы свыше предела'"));
	ДобавитьПодвидДоходаВСписок(ШтрафыНаФиксированныеВзносыВПФР, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - штраф по фиксированным взносам свыше предела';
			|en = '3000 - штраф по фиксированным взносам свыше предела'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ФиксированныеВзносыВПФР);
	ПодвидыДохода.Добавить(ШтрафыНаФиксированныеВзносыВПФР);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020300001", ПодвидыДохода);
	
	ВзносыНаОПСДо2023              = Новый Соответствие;
	ФиксированныеВзносыНаОПСДо2023 = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ВзносыНаОПСДо2023, "1001", ВидыПлатежей.Налог,
		НСтр("ru = '1001 - взносы на ОПС до 2023 г.';
			|en = '1001 - взносы на ОПС до 2023 г.'"));
	ДобавитьПодвидДоходаВСписок(ФиксированныеВзносыНаОПСДо2023, "1005", ВидыПлатежей.Налог,
		НСтр("ru = '1005 - фиксированные взносы на ОПС до 2023 г.';
			|en = '1005 - фиксированные взносы на ОПС до 2023 г.'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ВзносыНаОПСДо2023);
	ПодвидыДохода.Добавить(ФиксированныеВзносыНаОПСДо2023);
	ВидИПодвидДоходаИсключения.Вставить("ВД1021401006", ПодвидыДохода);
	
	ВзносыНаОМСДо2023              = Новый Соответствие;
	ФиксированныеВзносыНаОМСДо2023 = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ВзносыНаОМСДо2023, "1001", ВидыПлатежей.Налог,
		НСтр("ru = '1001 - взносы на ОМС до 2023 г.';
			|en = '1001 - взносы на ОМС до 2023 г.'"));
	ДобавитьПодвидДоходаВСписок(ФиксированныеВзносыНаОМСДо2023, "1002", ВидыПлатежей.Налог,
		НСтр("ru = '1002 - фиксированные взносы на ОМС до 2023 г.';
			|en = '1002 - фиксированные взносы на ОМС до 2023 г.'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ВзносыНаОМСДо2023);
	ПодвидыДохода.Добавить(ФиксированныеВзносыНаОМСДо2023);
	ВидИПодвидДоходаИсключения.Вставить("ВД1021403008", ПодвидыДохода);
	
	СтраховыеВзносыВФССДо2017 = Новый Соответствие;
	СтраховыеВзносыВФССДо2023 = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(СтраховыеВзносыВФССДо2017, "1101", ВидыПлатежей.Налог,
		НСтр("ru = '1101 - страховые взносы до 2017 г. на обязательное социальное страхование';
			|en = '1101 - страховые взносы до 2017 г. на обязательное социальное страхование'"));
	ДобавитьПодвидДоходаВСписок(СтраховыеВзносыВФССДо2023, "1001", ВидыПлатежей.Налог,
		НСтр("ru = '1001 - страховые взносы с 2017 по 2022 г. на обязательное социальное страхование';
			|en = '1001 - страховые взносы с 2017 по 2022 г. на обязательное социальное страхование'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыеВзносыВФССДо2023);
	ПодвидыДохода.Добавить(СтраховыеВзносыВФССДо2017);
	ВидИПодвидДоходаИсключения.Вставить("ВД1021402006", ПодвидыДохода);
	
	ПроцентыПоПлатежу   = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПроцентыПоПлатежу, "2000", ВидыПлатежей.Проценты,
		НСтр("ru = '2000 - проценты по соответствующему платежу, установленные НК РФ';
			|en = '2000 - проценты по соответствующему платежу, установленные НК РФ'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ПроцентыПоПлатежу);
	ВидИПодвидДоходаИсключения.Вставить("ВД1162000001", ПодвидыДохода);
	
	// КБК-исключения, которые представлюят собой не налог/взнос, а спец.код БК для уплаты штрафа/пени.
	// У них исходный (заданный в Приказе Минфина) код подвида дохода не меняется и остается "0000",
	// т.к. изменение кода подвида дохода обычно используется для разделения вида платежа по налогу(взносу):
	// уплата налога(взноса) / пени / штрафа и т.д.
	ШтрафыПениПоПлатежу = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ШтрафыПениПоПлатежу, "0000", ВидыПлатежей.Штраф,
		НСтр("ru = '0000 - штрафы (пени) по соответствующему платежу';
			|en = '0000 - штрафы (пени) по соответствующему платежу'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ШтрафыПениПоПлатежу);
	
	// Штрафы по страховым взносам на обязательное социальное страхование на случай временной нетрудоспособности
	// и в связи с материнством за расчетные периоды, истекшие до 1 января 2023 года
	ВидИПодвидДоходаИсключения.Вставить("ВД1162102006", ПодвидыДохода);
	
	// Административные штрафы, установленные главой 15 Кодекса Российской Федерации об административных правонарушениях,
	// за административные правонарушения в области финансов, налогов и сборов, страхования, рынка ценных бумаг
	// (за исключением штрафов, указанных в пункте 6 статьи 46 Бюджетного кодекса Российской Федерации),
	// выявленные должностными лицами Фонда пенсионного и социального страхования Российской Федерации
	ВидИПодвидДоходаИсключения.Вставить("ВД1160123006", ПодвидыДохода);
	
	// Иные штрафы, неустойки, пени, уплаченные в соответствии с законом или договором в случае неисполнения
	// или ненадлежащего исполнения обязательств перед Фондом пенсионного и социального страхования Российской Федерации
	ВидИПодвидДоходаИсключения.Вставить("ВД1160709006", ПодвидыДохода);
	
	// Суммы пеней, установленных Налоговым кодексом Российской Федерации, распределяемые в соответствии
	// с подпунктом 1 пункта 11 статьи 46 Бюджетного кодекса Российской Федерации, в части
	// обязательного социального страхования на случай временной нетрудоспособности и в связи с материнством
	ВидИПодвидДоходаИсключения.Вставить("ВД1161902001", ПодвидыДохода);
	
	ДобровольныеФиксированныеВзносы         = Новый Соответствие;
	ШтрафыНаДобровольныеФиксированныеВзносы = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ДобровольныеФиксированныеВзносы, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - добровольные фиксированные взносы на пенсионное страхование';
			|en = '1000 - добровольные фиксированные взносы на пенсионное страхование'"));
	ДобавитьПодвидДоходаВСписок(ШтрафыНаДобровольныеФиксированныеВзносы, "4000", ВидыПлатежей.Налог,
		НСтр("ru = '4000 - прочие поступления по добровольным фиксированным взносам на пенсионное страхование';
			|en = '4000 - прочие поступления по добровольным фиксированным взносам на пенсионное страхование'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ДобровольныеФиксированныеВзносы);
	ПодвидыДохода.Добавить(ШтрафыНаДобровольныеФиксированныеВзносы);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020500006", ПодвидыДохода);
	
	СтраховыеВзносыВФСС           = Новый Соответствие;
	ПениНаСтраховыеВзносыВФСС     = Новый Соответствие;
	ПроцентыНаСтраховыеВзносыВФСС = Новый Соответствие;
	ШтрафыНаСтраховыеВзносыВФСС   = Новый Соответствие;
	Если ГодПлатежа < Год(ПлатежиВБюджетКлиентСервер.НачалоДействияПриказа2017_90н()) Тогда
		// Страховые взносы в ФСС
		ДобавитьПодвидДоходаВСписок(СтраховыеВзносыВФСС, "1000", ВидыПлатежей.Налог,
			НСтр("ru = '1000 - страховые взносы до 2017 г. в ФСС';
				|en = '1000 - страховые взносы до 2017 г. в ФСС'"));
		ДобавитьПодвидДоходаВСписок(ПениНаСтраховыеВзносыВФСС, "2100", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2100 - пени по страховым взносам до 2017 г. в ФСС';
				|en = '2100 - пени по страховым взносам до 2017 г. в ФСС'"));
		ДобавитьПодвидДоходаВСписок(ПроцентыНаСтраховыеВзносыВФСС, "2200", ВидыПлатежей.Проценты,
			НСтр("ru = '2200 - проценты по страховым взносам до 2017 г. на обязательное социальное страхование';
				|en = '2200 - проценты по страховым взносам до 2017 г. на обязательное социальное страхование'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыНаСтраховыеВзносыВФСС, "3000", ВидыПлатежей.Штраф,
			НСтр("ru = '3000 - штрафы по страховым взносам до 2017 г. в ФСС';
				|en = '3000 - штрафы по страховым взносам до 2017 г. в ФСС'"));
	Иначе
		// Страховые взносы
		ДобавитьПодвидДоходаВСписок(СтраховыеВзносыВФСС, "1010", ВидыПлатежей.Налог,
			НСтр("ru = '1010 - страховые взносы с 2017 г. на обязательное социальное страхование';
				|en = '1010 - страховые взносы с 2017 г. на обязательное социальное страхование'"));
		ДобавитьПодвидДоходаВСписок(ПениНаСтраховыеВзносыВФСС, "2110", ВидыПлатежей.ПустаяСсылка(),
			НСтр("ru = '2110 - пени по страховым взносам с 2017 г. на обязательное социальное страхование';
				|en = '2110 - пени по страховым взносам с 2017 г. на обязательное социальное страхование'"));
		ДобавитьПодвидДоходаВСписок(ПроцентыНаСтраховыеВзносыВФСС, "2210", ВидыПлатежей.Проценты,
			НСтр("ru = '2210 - проценты по страховым взносам с 2017 г. на обязательное социальное страхование';
				|en = '2210 - проценты по страховым взносам с 2017 г. на обязательное социальное страхование'"));
		ДобавитьПодвидДоходаВСписок(ШтрафыНаСтраховыеВзносыВФСС, "3010", ВидыПлатежей.Штраф,
			НСтр("ru = '3010 - штрафы по страховым взносам с 2017 г. на обязательное социальное страхование';
				|en = '3010 - штрафы по страховым взносам с 2017 г. на обязательное социальное страхование'"));
	КонецЕсли;
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыеВзносыВФСС);
	ПодвидыДохода.Добавить(ПениНаСтраховыеВзносыВФСС);
	ПодвидыДохода.Добавить(ПроцентыНаСтраховыеВзносыВФСС);
	ПодвидыДохода.Добавить(ШтрафыНаСтраховыеВзносыВФСС);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020209007", ПодвидыДохода);
	
	// Страховые взносы в ФСС от несчастных случаев
	ВзносыНаСтраховыеВзносыВФССНС           = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ВзносыНаСтраховыеВзносыВФССНС, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - страховые взносы в ФСС от несчастных случаев';
			|en = '1000 - страховые взносы в ФСС от несчастных случаев'"));
	ПениНаВзносыНаСтраховыеВзносыВФССНС     = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПениНаВзносыНаСтраховыеВзносыВФССНС, "2100", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2100 - пени по страховым взносам в ФСС от несчастных случаев';
			|en = '2100 - пени по страховым взносам в ФСС от несчастных случаев'"));
	ПроцентыНаВзносыНаСтраховыеВзносыВФССНС     = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПроцентыНаВзносыНаСтраховыеВзносыВФССНС, "2200", ВидыПлатежей.Проценты,
		НСтр("ru = '2200 - проценты по страховым взносам в ФСС от несчастных случаев';
			|en = '2200 - проценты по страховым взносам в ФСС от несчастных случаев'"));
	ШтрафыНаВзносыНаСтраховыеВзносыВФССНС   = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ШтрафыНаВзносыНаСтраховыеВзносыВФССНС, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - штрафы по страховым взносам в ФСС от несчастных случаев';
			|en = '3000 - штрафы по страховым взносам в ФСС от несчастных случаев'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ВзносыНаСтраховыеВзносыВФССНС);
	ПодвидыДохода.Добавить(ПениНаВзносыНаСтраховыеВзносыВФССНС);
	ПодвидыДохода.Добавить(ПроцентыНаВзносыНаСтраховыеВзносыВФССНС);
	ПодвидыДохода.Добавить(ШтрафыНаВзносыНаСтраховыеВзносыВФССНС);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020205007", ПодвидыДохода); // не действует с 2023
	
	ДополнительныеВзносЛетныеЭкипажи       = Новый Соответствие;
	ПениДополнительныеВзносЛетныеЭкипажи   = Новый Соответствие;
	ШтрафыДополнительныеВзносЛетныеЭкипажи = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ДополнительныеВзносЛетныеЭкипажи, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - взносы на выплату доплат к пенсии членам летных экипажей';
			|en = '1000 - взносы на выплату доплат к пенсии членам летных экипажей'"));
	ДобавитьПодвидДоходаВСписок(ПениДополнительныеВзносЛетныеЭкипажи, "2100", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2100 - пени по взносам на выплату доплат к пенсии членам летных экипажей';
			|en = '2100 - пени по взносам на выплату доплат к пенсии членам летных экипажей'"));
	ДобавитьПодвидДоходаВСписок(ШтрафыДополнительныеВзносЛетныеЭкипажи, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - шатрафы по взносам на выплату доплат к пенсии членам летных экипажей';
			|en = '3000 - шатрафы по взносам на выплату доплат к пенсии членам летных экипажей'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ДополнительныеВзносЛетныеЭкипажи);
	ПодвидыДохода.Добавить(ПениДополнительныеВзносЛетныеЭкипажи);
	ПодвидыДохода.Добавить(ШтрафыДополнительныеВзносЛетныеЭкипажи);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020800006", ПодвидыДохода);
	
	ДополнительныеВзносШахтеры       = Новый Соответствие;
	ПениДополнительныеВзносШахтеры   = Новый Соответствие;
	ШтрафыДополнительныеВзносШахтеры = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ДополнительныеВзносШахтеры, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - взносы на выплату доплат к пенсии шахтерам';
			|en = '1000 - взносы на выплату доплат к пенсии шахтерам'"));
	ДобавитьПодвидДоходаВСписок(ПениДополнительныеВзносШахтеры, "2100", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2100 - пени по взносам на выплату доплат к пенсии шахтерам';
			|en = '2100 - пени по взносам на выплату доплат к пенсии шахтерам'"));
	ДобавитьПодвидДоходаВСписок(ШтрафыДополнительныеВзносШахтеры, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - шатрафы по взносам на выплату доплат к пенсии шахтерам';
			|en = '3000 - шатрафы по взносам на выплату доплат к пенсии шахтерам'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ДополнительныеВзносШахтеры);
	ПодвидыДохода.Добавить(ПениДополнительныеВзносШахтеры);
	ПодвидыДохода.Добавить(ШтрафыДополнительныеВзносШахтеры);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020900006", ПодвидыДохода);
	
	// Страховые взносы в СФР от несчастных случаев
	ВзносыНаСтраховыеВзносыВСФРНС           = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ВзносыНаСтраховыеВзносыВСФРНС, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - страховые взносы от несчастных случаев';
			|en = '1000 - страховые взносы от несчастных случаев'"));
	ПениНаВзносыНаСтраховыеВзносыВСФРНС     = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПениНаВзносыНаСтраховыеВзносыВСФРНС, "2100", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2100 - пени по страховым взносам от несчастных случаев';
			|en = '2100 - пени по страховым взносам от несчастных случаев'"));
	ПроцентыНаВзносыНаСтраховыеВзносыВСФРНС     = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПроцентыНаВзносыНаСтраховыеВзносыВСФРНС, "2200", ВидыПлатежей.Проценты,
		НСтр("ru = '2200 - проценты по страховым взносам от несчастных случаев';
			|en = '2200 - проценты по страховым взносам от несчастных случаев'"));
	ШтрафыНаВзносыНаСтраховыеВзносыВСФРНС   = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ШтрафыНаВзносыНаСтраховыеВзносыВСФРНС, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - штрафы по страховым взносам от несчастных случаев';
			|en = '3000 - штрафы по страховым взносам от несчастных случаев'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ВзносыНаСтраховыеВзносыВСФРНС);
	ПодвидыДохода.Добавить(ПениНаВзносыНаСтраховыеВзносыВСФРНС);
	ПодвидыДохода.Добавить(ПроцентыНаВзносыНаСтраховыеВзносыВСФРНС);
	ПодвидыДохода.Добавить(ШтрафыНаВзносыНаСтраховыеВзносыВСФРНС);
	ВидИПодвидДоходаИсключения.Вставить("ВД1021200006", ПодвидыДохода);
	
	// Страховые взносы по доп.тарифу за вредные условия труда
	СтраховыйВзносыВредныеУсловия = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(СтраховыйВзносыВредныеУсловия, "1010", ВидыПлатежей.ВзносыБезСпецоценки,
		НСтр("ru = '1010 - Страховые взносы по доп.тарифу за вредные условия труда (не зависит от специальной оценки)';
			|en = '1010 - Страховые взносы по доп.тарифу за вредные условия труда (не зависит от специальной оценки)'"));
	ПениСтраховыеВзносыВредныеУсловия = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПениСтраховыеВзносыВредныеУсловия, "2110", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2110 - Пени по страховым взносам по доп.тарифу за вредные условия труда (не зависит от специальной оценки)';
			|en = '2110 - Пени по страховым взносам по доп.тарифу за вредные условия труда (не зависит от специальной оценки)'"));
	ПроцентыСтраховыеВзносыВредныеУсловия = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПроцентыСтраховыеВзносыВредныеУсловия, "2210", ВидыПлатежей.Проценты,
		НСтр("ru = '2210 - Проценты по страховым взносам по доп.тарифу за вредные условия труда (не зависит от специальной оценки)';
			|en = '2210 - Проценты по страховым взносам по доп.тарифу за вредные условия труда (не зависит от специальной оценки)'"));
	ШтрафыСтраховыеВзносыВредныеУсловия = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ШтрафыСтраховыеВзносыВредныеУсловия, "3010", ВидыПлатежей.Штраф,
		НСтр("ru = '3010 - Штрафы по страховым взносам по доп.тарифу за вредные условия труда (не зависит от специальной оценки)';
			|en = '3010 - Штрафы по страховым взносам по доп.тарифу за вредные условия труда (не зависит от специальной оценки)'"));
	СтраховыйВзносыВредныеУсловияСпецОценка = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(СтраховыйВзносыВредныеУсловияСпецОценка, "1020", ВидыПлатежей.Налог,
		НСтр("ru = '1020 - Страховые взносы по доп.тарифу за вредные условия труда (зависит от специальной оценки)';
			|en = '1020 - Страховые взносы по доп.тарифу за вредные условия труда (зависит от специальной оценки)'"));
	ПениСтраховыеВзносыВредныеУсловияСпецОценка = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПениСтраховыеВзносыВредныеУсловияСпецОценка, "2100", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2100 - Пени по страховым взносам по доп.тарифу за вредные условия труда (зависит от специальной оценки)';
			|en = '2100 - Пени по страховым взносам по доп.тарифу за вредные условия труда (зависит от специальной оценки)'"));
	ПроцентыСтраховыеВзносыВредныеУсловияСпецОценка = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ПроцентыСтраховыеВзносыВредныеУсловияСпецОценка, "2200", ВидыПлатежей.Проценты,
		НСтр("ru = '2200 - Проценты по страховым взносам по доп.тарифу за вредные условия труда (зависит от специальной оценки)';
			|en = '2200 - Проценты по страховым взносам по доп.тарифу за вредные условия труда (зависит от специальной оценки)'"));
	ШтрафыСтраховыеВзносыВредныеУсловияСпецОценка = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ШтрафыСтраховыеВзносыВредныеУсловияСпецОценка, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - Штрафы по страховым взносам по доп.тарифу за вредные условия труда (зависит от специальной оценки)';
			|en = '3000 - Штрафы по страховым взносам по доп.тарифу за вредные условия труда (зависит от специальной оценки)'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(СтраховыйВзносыВредныеУсловияСпецОценка);
	ПодвидыДохода.Добавить(СтраховыйВзносыВредныеУсловия);
	ПодвидыДохода.Добавить(ПениСтраховыеВзносыВредныеУсловияСпецОценка);
	ПодвидыДохода.Добавить(ПениСтраховыеВзносыВредныеУсловия);
	ПодвидыДохода.Добавить(ПроцентыСтраховыеВзносыВредныеУсловияСпецОценка);
	ПодвидыДохода.Добавить(ПроцентыСтраховыеВзносыВредныеУсловия);
	ПодвидыДохода.Добавить(ШтрафыСтраховыеВзносыВредныеУсловияСпецОценка);
	ПодвидыДохода.Добавить(ШтрафыСтраховыеВзносыВредныеУсловия);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020213106", ПодвидыДохода); // не действует с 2023
	ВидИПодвидДоходаИсключения.Вставить("ВД1020213206", ПодвидыДохода); // не действует с 2023
	ВидИПодвидДоходаИсключения.Вставить("ВД1020401001", ПодвидыДохода);
	ВидИПодвидДоходаИсключения.Вставить("ВД1020402001", ПодвидыДохода);
	
	// Авансовые платежи в счет будущих таможенных и иных платежей
	АвансовыеТаможенныеПлатежи = Новый Соответствие;
	Если ГодПлатежа >= 2022 Тогда
		// Согласно письму ФТС https://customs.gov.ru/document/text/310178 с 01.01.2022
		// изменяется КБК для уплаты авансовых платежей в счет будущих таможенных и иных платежей.
		// В коде подвида дохода должен указываться "1000": 153 1 10 09000 01 1000 110
		ДобавитьПодвидДоходаВСписок(АвансовыеТаможенныеПлатежи, "1000", ВидыПлатежей.Налог,
			НСтр("ru = '1000 - авансовые платежи в счет будущих таможенных и иных платежей';
				|en = '1000 - авансовые платежи в счет будущих таможенных и иных платежей'"));
	Иначе
		// До этого письма ФТС, для этого платежа требовалось указывалось "0000": 153 1 10 09000 01 0000 110,
		// см. http://www.consultant.ru/law/hotdocs/60425.html/
		ДобавитьПодвидДоходаВСписок(АвансовыеТаможенныеПлатежи, "0000", ВидыПлатежей.Налог,
			НСтр("ru = '0000 - авансовые платежи в счет будущих таможенных и иных платежей';
				|en = '0000 - авансовые платежи в счет будущих таможенных и иных платежей'"));
	КонецЕсли;
	
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(АвансовыеТаможенныеПлатежи);
	ВидИПодвидДоходаИсключения.Вставить("ВД1100900001", ПодвидыДохода);
	
	УтилизационныйСборТаможенныеПлатежи = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборТаможенныеПлатежи, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - утилизационный сбор за ввозимые (кроме Республики Беларусь) колесные транспортные средства (шасси)';
			|en = '1000 - утилизационный сбор за ввозимые (кроме Республики Беларусь) колесные транспортные средства (шасси)'"));
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборТаможенныеПлатежи, "1010", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '1010 - пени за просрочку уплаты утилизационного сбора за ввозимые (кроме Республики Беларусь) колесные транспортные средства (шасси)';
			|en = '1010 - пени за просрочку уплаты утилизационного сбора за ввозимые (кроме Республики Беларусь) колесные транспортные средства (шасси)'"));
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборТаможенныеПлатежи, "3000", ВидыПлатежей.Налог,
		НСтр("ru = '3000 - утилизационный сбор за ввозимые из Республики Беларусь колесные транспортные средства (шасси)';
			|en = '3000 - утилизационный сбор за ввозимые из Республики Беларусь колесные транспортные средства (шасси)'"));
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборТаможенныеПлатежи, "3010", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '3010 - пени за просрочку уплаты утилизационного сбора за ввозимые из Республики Беларусь самоходные машины и прицепы к ним';
			|en = '3010 - пени за просрочку уплаты утилизационного сбора за ввозимые из Республики Беларусь самоходные машины и прицепы к ним'"));
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборТаможенныеПлатежи, "5000", ВидыПлатежей.Налог,
		НСтр("ru = '5000 - утилизационный сбор за ввозимые (кроме Республики Беларусь) самоходные машины и прицепы к ним';
			|en = '5000 - утилизационный сбор за ввозимые (кроме Республики Беларусь) самоходные машины и прицепы к ним'"));
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборТаможенныеПлатежи, "7000", ВидыПлатежей.Налог,
		НСтр("ru = '7000 - утилизационный сбор за ввозимые из Республики Беларусь самоходные машины и прицепы к ним';
			|en = '7000 - утилизационный сбор за ввозимые из Республики Беларусь самоходные машины и прицепы к ним'"));
	
	УтилизационныйСборНалоговыеПлатежи = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборНалоговыеПлатежи, "2000", ВидыПлатежей.Налог,
		НСтр("ru = '2000 - утилизационный сбор за колесные транспортные средства (шасси)';
			|en = '2000 - утилизационный сбор за колесные транспортные средства (шасси)'"));
	ДобавитьПодвидДоходаВСписок(УтилизационныйСборНалоговыеПлатежи, "6000", ВидыПлатежей.Налог,
		НСтр("ru = '6000 - утилизационный сбор за самоходные машины и прицепы к ним';
			|en = '6000 - утилизационный сбор за самоходные машины и прицепы к ним'"));
	
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(УтилизационныйСборНалоговыеПлатежи);
	ПодвидыДохода.Добавить(УтилизационныйСборТаможенныеПлатежи);
	ВидИПодвидДоходаИсключения.Вставить("ВД1120800001", ПодвидыДохода);
	
	ШтрафЗаНарушениеНалоговогоЗаконодательстваДо2020 = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательстваДо2020, "6000", ВидыПлатежей.Штраф,
		НСтр("ru = '6000 - Денежные взыскания (штрафы)';
			|en = '6000 - Денежные взыскания (штрафы)'"));
	ПодвидыДоходаДо2020 = Новый Массив;
	ПодвидыДоходаДо2020.Добавить(ШтрафЗаНарушениеНалоговогоЗаконодательстваДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1160301001", ПодвидыДоходаДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1160303001", ПодвидыДоходаДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1160304001", ПодвидыДоходаДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1160600001", ПодвидыДоходаДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1163100001", ПодвидыДоходаДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1163600001", ПодвидыДоходаДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1164300001", ПодвидыДоходаДо2020);
	ВидИПодвидДоходаИсключения.Вставить("ВД1167001001", ПодвидыДоходаДо2020);
	
	ШтрафЗаНарушениеНалоговогоЗаконодательства = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0001", ВидыПлатежей.Штраф,
		НСтр("ru = '0001 - нарушение порядка постановки на учет в налоговом органе (ст. 116 НК РФ)';
			|en = '0001 - нарушение порядка постановки на учет в налоговом органе (ст. 116 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0002", ВидыПлатежей.Штраф,
		НСтр("ru = '0002 - непредставление налоговой декларации, расчета по страховым взносам (ст. 119 НК РФ)';
			|en = '0002 - непредставление налоговой декларации, расчета по страховым взносам (ст. 119 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0003", ВидыПлатежей.Штраф,
		НСтр("ru = '0003 - нарушение установленного способа представления налоговой декларации (ст. 119.1 НК РФ)';
			|en = '0003 - нарушение установленного способа представления налоговой декларации (ст. 119.1 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0004", ВидыПлатежей.Штраф,
		НСтр("ru = '0004 - представление финансового результата, содержащего недостоверные сведения (ст. 119.2 НК РФ)';
			|en = '0004 - представление финансового результата, содержащего недостоверные сведения (ст. 119.2 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0005", ВидыПлатежей.Штраф,
		НСтр("ru = '0005 - нарушение правил учета налогообложения и исчисления страховых взносов (ст. 120 НК РФ)';
			|en = '0005 - нарушение правил учета налогообложения и исчисления страховых взносов (ст. 120 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0006", ВидыПлатежей.Штраф,
		НСтр("ru = '0006 - несоблюдение порядка пользования залоговым и арестованным имуществом (ст. 125 НК РФ)';
			|en = '0006 - несоблюдение порядка пользования залоговым и арестованным имуществом (ст. 125 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0007", ВидыПлатежей.Штраф,
		НСтр("ru = '0007 - непредставление сведений, необходимых для осуществления налогового контроля (ст. 126 НК РФ)';
			|en = '0007 - непредставление сведений, необходимых для осуществления налогового контроля (ст. 126 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0008", ВидыПлатежей.Штраф,
		НСтр("ru = '0008 - представление недостоверных сведений налоговым агентом (ст. 126.1 НК РФ)';
			|en = '0008 - представление недостоверных сведений налоговым агентом (ст. 126.1 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0009", ВидыПлатежей.Штраф,
		НСтр("ru = '0009 - отказ от дачи показаний, дачу заведомо ложных показаний (ст. 128 НК РФ)';
			|en = '0009 - отказ от дачи показаний, дачу заведомо ложных показаний (ст. 128 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0010", ВидыПлатежей.Штраф,
		НСтр("ru = '0010 - отказ эксперта от налоговой проверки, дачу заведомо ложного заключения (ст. 129 НК РФ)';
			|en = '0010 - отказ эксперта от налоговой проверки, дачу заведомо ложного заключения (ст. 129 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0011", ВидыПлатежей.Штраф,
		НСтр("ru = '0011 - неправомерное несообщение сведений налоговому органу (ст. 129.1 НК РФ)';
			|en = '0011 - неправомерное несообщение сведений налоговому органу (ст. 129.1 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0013", ВидыПлатежей.Штраф,
		НСтр("ru = '0013 - непредставление уведомления о контролируемых сделках, недостоверных сведений (ст. 129.4 НК РФ)';
			|en = '0013 - непредставление уведомления о контролируемых сделках, недостоверных сведений (ст. 129.4 НК РФ)'"));
	ДобавитьПодвидДоходаВСписок(ШтрафЗаНарушениеНалоговогоЗаконодательства, "0014", ВидыПлатежей.Штраф,
		НСтр("ru = '0014 - непредставление уведомления о КИК, недостоверных сведений (ст. 129.6 НК РФ)';
			|en = '0014 - непредставление уведомления о КИК, недостоверных сведений (ст. 129.6 НК РФ)'"));
	
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ШтрафЗаНарушениеНалоговогоЗаконодательства);
	ВидИПодвидДоходаИсключения.Вставить("ВД1160516001", ПодвидыДохода);
	
	// Единый нлоговый платеж
	ЕдиныйНалоговыйПлатеж = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(ЕдиныйНалоговыйПлатеж, "0000", ВидыПлатежей.Налог,
		НСтр("ru = '0000 - единый налоговый платеж';
			|en = '0000 - единый налоговый платеж'"));
	
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(ЕдиныйНалоговыйПлатеж);
	ВидИПодвидДоходаИсключения.Вставить("ВД0106120101", ПодвидыДохода);
	
	// Единый нлоговый платеж
	АвансовыйПлатежТаможняЕАЭС = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(АвансовыйПлатежТаможняЕАЭС, "0000", ВидыПлатежей.Налог,
		НСтр("ru = '0000 - авансовые платежи в счет будущих таможенных платежей';
			|en = '0000 - авансовые платежи в счет будущих таможенных платежей'"));
	
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(АвансовыйПлатежТаможняЕАЭС);
	ВидИПодвидДоходаИсключения.Вставить("ВД0106130101", ПодвидыДохода);
	
	НДФЛНалоги               = Новый Соответствие;
	НДФЛНалогиРаспределяемые = Новый Соответствие;
	НДФЛПени                 = Новый Соответствие;
	НДФЛПроценты             = Новый Соответствие;
	НДФЛШтрафы               = Новый Соответствие;
	НДФЛШтрафыРаспределяемые = Новый Соответствие;
	ДобавитьПодвидДоходаВСписок(НДФЛНалоги, "1000", ВидыПлатежей.Налог,
		НСтр("ru = '1000 - сумма налога (взноса)';
			|en = '1000 - сумма налога (взноса)'"));
	ДобавитьПодвидДоходаВСписок(НДФЛНалогиРаспределяемые, "1010", ВидыПлатежей.Налог,
		НСтр("ru = '1010 - сумма налога, подлежащего распределению между бюджетами субъектов РФ';
			|en = '1010 - сумма налога, подлежащего распределению между бюджетами субъектов РФ'"));
	ДобавитьПодвидДоходаВСписок(НДФЛПени, "2100", ВидыПлатежей.ПустаяСсылка(),
		НСтр("ru = '2100 - пени по налогу (взносу)';
			|en = '2100 - пени по налогу (взносу)'"));
	ДобавитьПодвидДоходаВСписок(НДФЛПроценты, "2200", ВидыПлатежей.Проценты,
		НСтр("ru = '2200 - проценты по налогу (взносу)';
			|en = '2200 - проценты по налогу (взносу)'"));
	ДобавитьПодвидДоходаВСписок(НДФЛШтрафы, "3000", ВидыПлатежей.Штраф,
		НСтр("ru = '3000 - штрафы по налогу (взносу)';
			|en = '3000 - штрафы по налогу (взносу)'"));
	ДобавитьПодвидДоходаВСписок(НДФЛШтрафыРаспределяемые, "3010", ВидыПлатежей.Штраф,
		НСтр("ru = '3010 - штрафы по налогу, подлежащего распределению между бюджетами субъектов РФ';
			|en = '3010 - штрафы по налогу, подлежащего распределению между бюджетами субъектов РФ'"));
	ПодвидыДохода = Новый Массив;
	ПодвидыДохода.Добавить(НДФЛНалоги);
	ПодвидыДохода.Добавить(НДФЛНалогиРаспределяемые);
	ПодвидыДохода.Добавить(НДФЛПени);
	ПодвидыДохода.Добавить(НДФЛПроценты);
	ПодвидыДохода.Добавить(НДФЛШтрафы);
	ПодвидыДохода.Добавить(НДФЛШтрафыРаспределяемые);
	ВидИПодвидДоходаИсключения.Вставить("ВД1010201001", ПодвидыДохода);
	ВидИПодвидДоходаИсключения.Вставить("ВД1010208001", ПодвидыДохода);
	
	Возврат Новый ФиксированнаяСтруктура(ВидИПодвидДоходаИсключения);
	
КонецФункции

Процедура ДобавитьПодвидДоходаВСписок(Список, КодПодвидаДохода, ВидПлатежа, Описание)
	ПодвидДохода = Новый Структура("ВидПлатежа, Описание", ВидПлатежа, Описание);
	Список.Вставить(КодПодвидаДохода, ПодвидДохода);
КонецПроцедуры

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.УведомлениеОСпецрежимахНалогообложения";
	КомандаПечати.Обработчик     = "РегламентированнаяОтчетностьУПКлиент.ВыполнитьКомандуПечатиУведомленияОбИсчисленныхСуммахНалогов";
	КомандаПечати.Идентификатор  = "Уведомление";
	КомандаПечати.Представление  = НСтр("ru = 'Уведомление об исчисленных суммах налога';
										|en = 'Calculated tax amount notification'");
	КомандаПечати.Порядок        = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.УведомлениеОСпецрежимахНалогообложения";
	КомандаПечати.Обработчик     = "РегламентированнаяОтчетностьУПКлиент.ВыполнитьКомандуПечатиУведомленияОбИсчисленныхСуммахНалоговPDF417";
	КомандаПечати.Идентификатор  = "Уведомление";
	КомандаПечати.Представление  = НСтр("ru = 'Уведомление об исчисленных суммах налога (PDF417)';
										|en = 'Calculated tax amount notification (PDF417)'");
	КомандаПечати.СписокФорм     = "ФормаДокумента";
	КомандаПечати.Порядок        = 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли