
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВидСубконто = Параметры.ВидСубконто;
	АдресСхемыКомпоновкиДанных = Параметры.АдресСхемыКомпоновкиДанных;
	ТекущееВыражение = Параметры.ТекущееВыражение;
	
	ТипЗначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидСубконто, "ТипЗначения");
	
	МаксимальныйУровеньРазверткиСтрок = 2;
	ФинансоваяОтчетностьСервер.ЗаполнитьДоступныеПоляПоСхемеКомпоновкиДанных(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДеревоВыбораПередРазворачиванием(Элемент, Строка, Отказ)
	
	ТекущиеДанные = ДеревоВыбора.НайтиПоИдентификатору(Строка);
	Если ТекущиеДанные.РазворачиватьДоРеквизитов
		И НЕ ТекущиеДанные.ПодчиненныеСтрокиРазворачивались Тогда
		// Если есть подчиненные реквизиты и для них не были получены реквизиты следующего уровня.
		РазвернутьПодчиненныеСтрокиДереваОперандов(Строка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазвернутьПодчиненныеСтрокиДереваОперандов(ИдентификаторТекущейСтрокиДереваОперандов)
	
	РаботаСФормулами.РазвернутьСтрокуОперандаДереваФормы(ДеревоВыбора,
		ИдентификаторТекущейСтрокиДереваОперандов,
		МаксимальныйУровеньРазверткиСтрок);
	
	// Обработка ограничений по типу значения или идентификатору доп.реквизита на форме.
	ТекущиеДанные = ДеревоВыбора.НайтиПоИдентификатору(ИдентификаторТекущейСтрокиДереваОперандов);
	Для Каждого ДобавленнаяСтрока Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		Если ДобавленнаяСтрока.РазрешаетсяВыборОперанда Тогда
			ДобавленнаяСтрока.РазрешаетсяВыборОперанда = ФинансоваяОтчетностьСервер.ПодходящееПолеВыбора(ДобавленнаяСтрока,
				ТипЗначения, ДополнительноеСвойствоИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыбор(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработатьВыбор(Элементы.ДеревоВыбора.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор(ВыбраннаяСтрока)
	
	СтрокаДерева = ДеревоВыбора.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Не СтрокаДерева.РазрешаетсяВыборОперанда Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СтрокаДерева.ПолныйИдентификаторСтроки);
	
КонецПроцедуры


#КонецОбласти