#Область СлужебныеПроцедурыИФункции

Функция ГиперссылкаИсправленияДокумента(ИсправляемыйДокумент, ИсправительныйДокумент = Неопределено) Экспорт
	
	Возврат ИсправлениеДокументов.ГиперссылкаИсправленияДокумента(ИсправляемыйДокумент, ИсправительныйДокумент);
	
КонецФункции

// Возвращает исправляемый документ (первый документ цепочки) по исправлению
//
//	Параметры:
//		Исправление - ДокументСсылка - Исправление
//	
//	Возвращаемое значение:
//		ДокументСсылка -
//
Функция ИсправляемыйДокумент(Знач Исправление) Экспорт
	
	Возврат ИсправлениеДокументов.ИсправляемыйДокумент(Исправление);
	
КонецФункции

#КонецОбласти