#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи в регистр заданий.
//
// Параметры:
//  ОбъектРасчета	 - ДокументСсылка.ЭтапПроизводства2_2	 - документ, для которого необходимо добавить задание.
//  АвтоЗапуск		 - Булево								 - автоматический запуск задание.
//
Процедура ДобавитьЗадание(ОбъектРасчета, Автозапуск = Истина) Экспорт
	
	Задание = Новый Структура;
	Задание.Вставить("ОбъектРасчета", ОбъектРасчета);
	
	ТаблицаЗаданий = ОтложенныеЗадания.ДобавитьЗаданияВОчередь(
										"ЗаданияКРасчетуОчередиПроизводственныхОпераций",
										Задание);
	
	Если Автозапуск Тогда
		
		ОтложенныеЗадания.Запустить(ТаблицаЗаданий);
		
	КонецЕсли;
	
КонецПроцедуры

// Запускает задание расчета очереди производственных операций
//
Процедура ЗапуститьЗадание() Экспорт
	
	ОтложенныеЗадания.Запустить("ЗаданияКРасчетуОчередиПроизводственныхОпераций");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли