#Область ПрограммныйИнтерфейс

// Дополняе структуру действий над строкой табличной части при изменении элемента формы.
// 
// Параметры:
//  Форма - Форма - Форма, в которой происходит обработка табличной части.
//  Элемент - ПолеФормы - Измененный элемент формы.
//  СтруктураДействий - см. ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧВЦикле.Действия.
//
Процедура ДополнитьСтруктуруДействийПриИзмененииЭлемента(Форма, Элемент, СтруктураДействий) Экспорт
	
	//++ Локализация
	Если Форма.ИмяФормы = "Документ.ОтчетОРозничныхПродажах.Форма.ФормаДокумента" Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакПодакцизныйТовар", Новый Структура("Номенклатура", "ПодакцизныйТовар"));
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
		Или Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" Тогда
		
		Если Элемент = "Номенклатура" Тогда
			
			Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено
				Или Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
				СтруктураДействий.Вставить("ЗаполнитьПризнакМаркируемаяПродукция", Новый Структура("Номенклатура", "МаркируемаяПродукция"));
				СтруктураДействий.Вставить("ЗаполнитьВидПродукцииИС", Новый Структура("Номенклатура", "ВидПродукцииИС"));
				СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус",
					Новый Структура("Склад, ПараметрыУказанияСерий", Форма.Объект.Склад, Форма.ПараметрыУказанияСерий));
			КонецЕсли;
			
			Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
				СтруктураДействий.Вставить("ЗаполнитьНоменклатуруЕГАИС", ПараметрыЗаполненияНоменклатурыЕГАИСДляЧека(Форма));
			КонецЕсли;
			
		ИначеЕсли Элемент = "НоменклатураПризнаки" Тогда
			
			Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
				СтруктураДействий.Вставить("ЗаполнитьПризнакМаркируемаяПродукция", Новый Структура("Номенклатура", "МаркируемаяПродукция"));
				СтруктураДействий.Вставить("ЗаполнитьВидПродукцииИС", Новый Структура("Номенклатура", "ВидПродукцииИС"));
			КонецЕсли;
			Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
				СтруктураДействий.Вставить("ЗаполнитьПризнакМаркируемаяПродукция", Новый Структура("Номенклатура", "МаркируемаяПродукция"));
				СтруктураДействий.Вставить("ЗаполнитьВидПродукцииИС", Новый Структура("Номенклатура", "ВидПродукцииИС"));
			КонецЕсли;
			
			Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
				И Форма.ПараметрыИнтеграцииГосИС["ВедетсяУчетВидовПродукцииСЧастичнымВыбытиемИС"] = Истина Тогда
				СтруктураДействий.Вставить(
					"ЗаполнитьЕстьВскрытыеПотребительскиеУпаковкиИС",
					Новый Структура("Номенклатура", "ЕстьВскрытыеПотребительскиеУпаковкиИС"));
			КонецЕсли;
			
		ИначеЕсли Элемент = "Характеристика"
			Или Элемент = "Серия" Тогда
			
			Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
				СтруктураДействий.Вставить("ЗаполнитьНоменклатуруЕГАИС", ПараметрыЗаполненияНоменклатурыЕГАИСДляЧека(Форма));
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.ОтборРазмещениеТоваров.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			СтруктураДействий.Вставить("ЗаполнитьВидПродукцииИС", Новый Структура("Номенклатура", "ВидПродукцииИС"));
			СтруктураДействий.Вставить("ЗаполнитьПризнакМаркируемаяПродукция", Новый Структура("Номенклатура", "МаркируемаяПродукция"));
			СтруктураДействий.Вставить("СнятьПризнакМаркируемаяПродукцияАлкоголь", Новый Структура);
			СтруктураДействий.Вставить("ЗаполнитьПризнакАвтоматическийОСУИС", Новый Структура);
		КонецЕсли;
		
	ИначеЕсли (Форма.ИмяФормы = "Документ.ВозвратТоваровОтПокупателя.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено 
			И Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП").ВидыПродукции.Количество() > 0 
			И Форма.ПараметрыИнтеграцииГосИС.Получить(
				Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП").ВидыПродукции[0]).ИспользоватьКолонкуСтатусаПроверкиПодбора Тогда
			СтруктураДействий.Вставить("ЗаполнитьВидПродукцииИС", Новый Структура("Номенклатура", "ВидПродукцииИС"));
			СтруктураДействий.Вставить("ЗаполнитьПризнакМаркируемаяПродукция", Новый Структура("Номенклатура", "МаркируемаяПродукция"));
			СтруктураДействий.Вставить("СнятьПризнакМаркируемаяПродукцияАлкоголь", Новый Структура);
		КонецЕсли;
			
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Локализация

//++ Локализация

// Пересчитывает количество товара ВЕТИС в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - см. ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧВЦикле.ТекущаяСтрока
//	СтруктураДействий - см. ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧВЦикле.Действия
//	КэшированныеЗначения - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения
//	ТекстОшибки - Строка - Текст ошибок, при их наличии.
//
Процедура ПересчитатьКоличествоЕдиницВЕТИСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ТекстОшибки) Экспорт
	
	Перем ПараметрыПересчетаКоличестваВЕТИС;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницВЕТИС", ПараметрыПересчетаКоличестваВЕТИС) Тогда
		
		ПараметрыПересчета = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.НормализоватьПараметрыПересчетаЕдиниц(ТекущаяСтрока, ПараметрыПересчетаКоличестваВЕТИС);
		
		КоличествоВЕТИС = ИнтеграцияВЕТИСУТКлиентСервер.ПересчитатьКоличествоЕдиницВЕТИС(
											ТекущаяСтрока["Количество"+ПараметрыПересчетаКоличестваВЕТИС.Суффикс],
											ПараметрыПересчета.Номенклатура,
											ПараметрыПересчета.Упаковка,
											ПараметрыПересчета.НужноОкруглять,
											КэшированныеЗначения,
											ТекстОшибки);
		
		Если КоличествоВЕТИС <> Неопределено Тогда
			ИмяКоличестваВЕТИС = "Количество" + ПараметрыПересчетаКоличестваВЕТИС.Суффикс + "ВЕТИС";
			
			ТекущаяСтрока[ИмяКоличестваВЕТИС] = КоличествоВЕТИС;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает количество товара (в единицах хранения) в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - см. ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧВЦикле.ТекущаяСтрока
//	СтруктураДействий - см. ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧВЦикле.Действия
//	КэшированныеЗначения - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения
//	ТекстОшибки - Строка - Текст ошибок, при их наличии.
//
Процедура ПересчитатьКоличествоЕдиницПоВЕТИСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ТекстОшибки) Экспорт
	
	Перем ПараметрыПересчетаКоличества;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницПоВЕТИС", ПараметрыПересчетаКоличества) Тогда
		
		ПараметрыПересчета = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.НормализоватьПараметрыПересчетаЕдиниц(ТекущаяСтрока, ПараметрыПересчетаКоличества);
		ИмяКоличестваВЕТИС = "Количество" + ПараметрыПересчетаКоличества.Суффикс + "ВЕТИС";
		
		Количество = ИнтеграцияВЕТИСУТКлиентСервер.ПересчитатьКоличествоЕдиниц(
											ТекущаяСтрока[ИмяКоличестваВЕТИС],
											ПараметрыПересчета.Номенклатура,
											ПараметрыПересчета.Упаковка,
											ПараметрыПересчета.НужноОкруглять,
											КэшированныеЗначения,
											ТекстОшибки);
											
		Если Количество <> Неопределено Тогда
			ТекущаяСтрока["Количество" + ПараметрыПересчетаКоличества.Суффикс] = Количество;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает количество товара (в единицах хранения ФГИС Зерно) в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока			- Структура - Структура со свойствами строки документа.
//	СтруктураДействий		- Структура - Структура с действиями, которые нужно произвести.
//	КэшированныеЗначения	- Структура - Сохраненные значения параметров, используемых при обработке строки таблицы.
//
Процедура ПересчитатьКоличествоЕдиницПоЗЕРНОВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем ПараметрыПересчетаКоличества;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницПоЗЕРНО", ПараметрыПересчетаКоличества) Тогда
		ПараметрыПересчета = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.НормализоватьПараметрыПересчетаЕдиниц(ТекущаяСтрока, ПараметрыПересчетаКоличества);
		Если ТекущаяСтрока.Количество > 0 Тогда
			Если ЗначениеЗаполнено(ПараметрыПересчета.Номенклатура) Тогда
				Коэффициент = КоэффициентУпаковкиЗерно(ПараметрыПересчета, КэшированныеЗначения);
				Если Не ЗначениеЗаполнено(Коэффициент) Тогда
					Коэффициент = 1;
				КонецЕсли;
				ТекущаяСтрока.КоличествоЗЕРНО = ТекущаяСтрока.Количество / Коэффициент;
			Иначе
				ТекущаяСтрока.Количество = 0;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ПараметрыПересчета.Номенклатура)
			И ТекущаяСтрока.КоличествоЗЕРНО > 0 Тогда
			Коэффициент = КоэффициентУпаковкиЗерно(ПараметрыПересчета, КэшированныеЗначения);
			ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоЗЕРНО * Коэффициент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает тип измеряемой величины и рассчитывает зависимые поля.
//
// Параметры:
//	ТекущаяСтрока			- Структура - Структура со свойствами строки документа.
//	СтруктураДействий		- Структура - Структура с действиями, которые нужно произвести.
//	КэшированныеЗначения	- Структура - Сохраненные значения параметров, используемых при обработке строки таблицы.
//
Процедура ПересчитатьТипИзмеряемойВеличиныСАТУРН(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	ПараметрыВыполнения = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьТипИзмеряемойВеличиныСАТУРН", ПараметрыВыполнения) Тогда
		
		ПараметрыЗаполнения = ПараметрыВыполнения.ПараметрыЗаполнения;
		
		ДанныеУпаковки = ДанныеУпаковкиСАТУРНИзКэшированныхЗначений(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Упаковка, КэшированныеЗначения);
		
		// ТипИзмеряемойВеличины
		// 0 - Неизвестен
		// 1 - Объем
		// 2 - Вес
		// 3 - Вес или Объем
		ТипИзмеряемойВеличины = ТипИзмеряемойВеличиныСАТУРНПоДаннымУпаковки(ДанныеУпаковки);
		ТекущийТипИзмеряемойВеличины = ТекущийТипИзмеряемойВеличиныСАТУРНПоДаннымСтроки(ТекущаяСтрока, ТипИзмеряемойВеличины);
		
		Если ТипИзмеряемойВеличины <> 0 Тогда
			
			Если ПараметрыЗаполнения = Неопределено Тогда
				ПараметрыЗаполнения = ИнтеграцияСАТУРНКлиентСервер.ПараметрыЗаполненияТабличнойЧасти();
			КонецЕсли;
			
			Если ПараметрыЗаполнения.ПересчитатьКоличествоВУпаковкеСАТУРН Тогда
				Если ТекущийТипИзмеряемойВеличины = 1 Тогда
					ТекущаяСтрока.КоличествоВУпаковкеСАТУРН = ДанныеУпаковки.Объем;
				ИначеЕсли ТекущийТипИзмеряемойВеличины = 2 Тогда
					ТекущаяСтрока.КоличествоВУпаковкеСАТУРН = ДанныеУпаковки.Вес;
				КонецЕсли;
			КонецЕсли;
			
			Суффиксы = СтрРазделить(ПараметрыЗаполнения.КоличествоСуффикс, ",");
			Если Суффиксы.Количество() = 0 Тогда
				Суффиксы.Добавить("");
			КонецЕсли;
			
			Для Каждого Суффикс Из Суффиксы Цикл
				ИмяПоляКоличествоУпаковок = СтрШаблон("%1%2","КоличествоУпаковок", Суффикс);
				ИмяПоляКоличествоСАТУРН   = СтрШаблон("%1%2%3", "Количество", Суффикс,"САТУРН");
			Если ПараметрыЗаполнения.ПересчитатьКоличествоУпаковокПоОстаткуСАТУРН Тогда
				Если ТекущаяСтрока.КоличествоВУпаковкеСАТУРН = 0 Тогда
					ТекущаяСтрока[ИмяПоляКоличествоУпаковок] = 0;
				Иначе
					ТекущаяСтрока[ИмяПоляКоличествоУпаковок] = ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] / ТекущаяСтрока.КоличествоВУпаковкеСАТУРН;
				КонецЕсли;
			ИначеЕсли ПараметрыЗаполнения.ПересчитатьКоличествоУпаковокПоСАТУРН Тогда
				Если ТекущийТипИзмеряемойВеличины = 1 Тогда
					Если ДанныеУпаковки.Объем = 0 Тогда
						ТекущаяСтрока[ИмяПоляКоличествоУпаковок] = 0;
					Иначе
						ТекущаяСтрока[ИмяПоляКоличествоУпаковок] = ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] * ТекущаяСтрока.КоличествоВУпаковкеСАТУРН / ДанныеУпаковки.Объем;
					КонецЕсли;
				ИначеЕсли ТекущийТипИзмеряемойВеличины = 2 Тогда
					Если ДанныеУпаковки.Вес = 0 Тогда
						ТекущаяСтрока[ИмяПоляКоличествоУпаковок] = 0;
					Иначе
						ТекущаяСтрока[ИмяПоляКоличествоУпаковок] = ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] * ТекущаяСтрока.КоличествоВУпаковкеСАТУРН / ДанныеУпаковки.Вес;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыЗаполнения.ПересчитатьКоличествоСАТУРН
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "КоличествоСАТУРН") Тогда
				ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] = ТекущаяСтрока[ИмяПоляКоличествоУпаковок];
			КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет действия при изменении подобранного количества (поле КоличествоУпаковок) в строке таблицы формы.
//
// Параметры:
//	ТекущаяСтрока			- Структура - Структура со свойствами строки документа.
//	СтруктураДействий		- Структура - Структура с действиями, которые нужно произвести.
//	КэшированныеЗначения	- Структура - Сохраненные значения параметров, используемых при обработке строки таблицы.
//
Процедура ПересчитатьКоличествоДляСАТУРН(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	ПараметрыЗаполнения = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоДляСАТУРН", ПараметрыЗаполнения) Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "КоличествоУпаковок") 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Упаковка") Тогда
			
			ДанныеУпаковки = ДанныеУпаковкиСАТУРНИзКэшированныхЗначений(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Упаковка, КэшированныеЗначения);
		
			Коэффициент = ДанныеУпаковки.Коэффициент;
			Если Не ЗначениеЗаполнено(Коэффициент) Тогда
				Коэффициент = 1;
			КонецЕсли;
			
			Если ПараметрыЗаполнения = Неопределено Тогда
				Суффиксы = Новый Массив;
				Суффиксы.Добавить("");
			Иначе
				Суффиксы = СтрРазделить(ПараметрыЗаполнения.КоличествоСуффикс, ",");
				Если ЗначениеЗаполнено(ПараметрыЗаполнения.КоличествоСуффикс) Тогда
					// ТипИзмеряемойВеличины
					// 0 - Неизвестен
					// 1 - Объем
					// 2 - Вес
					// 3 - Вес или Объем
					ТипИзмеряемойВеличины = ТипИзмеряемойВеличиныСАТУРНПоДаннымУпаковки(ДанныеУпаковки);
					ТекущийТипИзмеряемойВеличины = ТекущийТипИзмеряемойВеличиныСАТУРНПоДаннымСтроки(ТекущаяСтрока, ТипИзмеряемойВеличины);
				Иначе
					Суффиксы.Добавить("");
					ТипИзмеряемойВеличины = Неопределено;
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого Суффикс Из Суффиксы Цикл
				
				ИмяПоляКоличествоУпаковок = СтрШаблон("%1%2","КоличествоУпаковок", Суффикс);
				ИмяПоляКоличествоСАТУРН   = СтрШаблон("%1%2%3", "Количество", Суффикс,"САТУРН");
				
				ТекущаяСтрока["Количество" + Суффикс] = ТекущаяСтрока[ИмяПоляКоличествоУпаковок] * Коэффициент;
				
				Если ПараметрыЗаполнения <> Неопределено И ПараметрыЗаполнения.ПересчитатьКоличествоСАТУРН
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, ИмяПоляКоличествоСАТУРН) Тогда
					Если ЗначениеЗаполнено(Суффикс) И ТипИзмеряемойВеличины <> 0 Тогда
						Если ТекущаяСтрока.КоличествоВУпаковкеСАТУРН = 0 Тогда
							ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] = 0;
						ИначеЕсли ТекущийТипИзмеряемойВеличины = 1 Тогда
							ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] = ТекущаяСтрока[ИмяПоляКоличествоУпаковок] * ДанныеУпаковки.Объем / ТекущаяСтрока.КоличествоВУпаковкеСАТУРН;
						ИначеЕсли ТекущийТипИзмеряемойВеличины = 2 Тогда
							ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] =  ТекущаяСтрока[ИмяПоляКоличествоУпаковок] * ДанныеУпаковки.Вес/ ТекущаяСтрока.КоличествоВУпаковкеСАТУРН;
						КонецЕсли;
					Иначе
						ТекущаяСтрока[ИмяПоляКоличествоСАТУРН] = ТекущаяСтрока[ИмяПоляКоличествоУпаковок];
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

// Параметры заполнения номенклатуры ЕГАИСДля чека.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктураСКоллекцией - Объект чека на форме:
//  * Серии - ДанныеФормыКоллекция - табличная части Серии
// 
// Возвращаемое значение:
//  Структура - Параметры заполнения номенклатуры ЕГАИСДля чека:
// * ИмяКолонки - Строка - имя колонки содержащей алкогольную продукцию
// * Серии - ДанныеФормыКоллекция - табличная части Серии
Функция ПараметрыЗаполненияНоменклатурыЕГАИСДляЧека(Форма) Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяКолонки", "НоменклатураЕГАИС");
	ПараметрыЗаполнения.Вставить("Серии", Форма.Объект.Серии);
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция КоэффициентУпаковкиЗерно(ПараметрыПересчета, КэшированныеЗначения)
	
	Коэффициент = КэшированныеЗначения.КоэффициентыУпаковок[ПараметрыПересчета.Номенклатура];
	Если Коэффициент = Неопределено Тогда
		Коэффициент = ИнтеграцияИСВызовСервераУТ.КоэффициентУпаковки(ПараметрыПересчета.Упаковка, ПараметрыПересчета.Номенклатура);
		КэшированныеЗначения.КоэффициентыУпаковок.Вставить(ПараметрыПересчета.Номенклатура, Коэффициент);
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции

// Данные упаковки САТУРН из кэшированных значений
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
//  Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения - Упаковка
//  КэшированныеЗначения - Неопределено, Структура - Кэшированные значения
// 
// Возвращаемое значение:
//  Структура    - данные упаковки:
//  * Коэффициент - Число - коэффициент упаковки,
//  * Вес - Число - вес упаковки,
//  * Объем - Число - объем упаковки,
//  * ТипИзмеряемойВеличиныВес - Булево - допустим вес,
//  * ТипИзмеряемойВеличиныОбъем - Булево - допустим объем;
//  Неопределено - данных нет в кэше.
Функция ДанныеУпаковкиСАТУРНИзКэшированныхЗначений(Номенклатура, Упаковка, КэшированныеЗначения) Экспорт
	
	ДанныеУпаковки = Неопределено;
	
	Если КэшированныеЗначения <> Неопределено Тогда
		
		Если Не КэшированныеЗначения.Свойство("КоэффициентВесОбъемУпаковки") Тогда
			КэшированныеЗначения.Вставить("КоэффициентВесОбъемУпаковки", Новый Соответствие);
		КонецЕсли;
		
		ДанныеНоменклатуры = КэшированныеЗначения.КоэффициентВесОбъемУпаковки[Номенклатура];
		Если ДанныеНоменклатуры = Неопределено Тогда
			КэшированныеЗначения.КоэффициентВесОбъемУпаковки.Вставить(Номенклатура, Новый Соответствие);
			ДанныеНоменклатуры = КэшированныеЗначения.КоэффициентВесОбъемУпаковки[Номенклатура];
		КонецЕсли;
		
		Если Упаковка = Неопределено Тогда
			КлючУпаковки = ИнтеграцияИСКлиентСерверПовтИсп.ПустоеЗначениеУпаковки();
			Если КлючУпаковки = Неопределено Тогда
				КлючУпаковки = "";
			КонецЕсли;
		Иначе
			КлючУпаковки = Упаковка;
		КонецЕсли;
		
		ДанныеУпаковки = ДанныеНоменклатуры[КлючУпаковки];
		
	КонецЕсли;
	
	Возврат ДанныеУпаковки;
	
КонецФункции

// Тип измеряемой величины САТУРН по данным упаковки.
// 
// Параметры:
//  ДанныеУпаковки - Структура - Данные упаковки
// 
// Возвращаемое значение:
//  Число - Тип измеряемой величины по данным упаковки
Функция ТипИзмеряемойВеличиныСАТУРНПоДаннымУпаковки(ДанныеУпаковки)
	
	// ТипИзмеряемойВеличины
	// 0 - Неизвестен
	// 1 - Объем
	// 2 - Вес
	// 3 - Вес или Объем
	Если ДанныеУпаковки.ТипИзмеряемойВеличиныОбъем Тогда
		ТипИзмеряемойВеличины = 1;
	ИначеЕсли ДанныеУпаковки.ТипИзмеряемойВеличиныВес Тогда
		ТипИзмеряемойВеличины = 2;
	ИначеЕсли ДанныеУпаковки.Вес > 0 И ДанныеУпаковки.Объем > 0 Тогда
		ТипИзмеряемойВеличины = 3;
	ИначеЕсли ДанныеУпаковки.Объем > 0 Тогда
		ТипИзмеряемойВеличины = 1;
	ИначеЕсли ДанныеУпаковки.Вес > 0 Тогда
		ТипИзмеряемойВеличины = 2;
	Иначе
		ТипИзмеряемойВеличины = 0;
	КонецЕсли;
	
	Возврат ТипИзмеряемойВеличины;
	
КонецФункции

// Текущий тип измеряемой величины по данным строки.
// 
// Параметры:
//  ТекущаяСтрока - Структура - Текущая строка
//  ТипИзмеряемойВеличины -Число - Тип измеряемой величины
// 
// Возвращаемое значение:
//  Число - Текущий тип измеряемой величины по данным строки
Функция ТекущийТипИзмеряемойВеличиныСАТУРНПоДаннымСтроки(ТекущаяСтрока, ТипИзмеряемойВеличины)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ТипИзмеряемойВеличиныСАТУРН") Тогда
		
		ТипИзмеряемойВеличиныОбъем = ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличинСАТУРН.Объем");
		ТипИзмеряемойВеличиныВес   = ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличинСАТУРН.Вес");
	
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ТипИзмеряемойВеличиныСАТУРН) Тогда
			Если ТипИзмеряемойВеличины = 1 Или ТипИзмеряемойВеличины = 3 Тогда
				ТекущаяСтрока.ТипИзмеряемойВеличиныСАТУРН = ТипИзмеряемойВеличиныОбъем;
			ИначеЕсли ТипИзмеряемойВеличины = 2 Или ТипИзмеряемойВеличины = 0 Тогда
				ТекущаяСтрока.ТипИзмеряемойВеличиныСАТУРН = ТипИзмеряемойВеличиныВес;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущаяСтрока.ТипИзмеряемойВеличиныСАТУРН = ТипИзмеряемойВеличиныОбъем Тогда
			ТекущийТипИзмеряемойВеличины = 1;
		ИначеЕсли ТекущаяСтрока.ТипИзмеряемойВеличиныСАТУРН = ТипИзмеряемойВеличиныВес  Тогда
			ТекущийТипИзмеряемойВеличины = 2;
		Иначе
			ТекущийТипИзмеряемойВеличины = 0;
		КонецЕсли;
	Иначе
		ТекущийТипИзмеряемойВеличины = 0;
	КонецЕсли;
	
	Возврат ТекущийТипИзмеряемойВеличины;
	
КонецФункции

//-- Локализация

#КонецОбласти