#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
//	- Неопределено
//	- СтрокаТаблицыЗначений.
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.СверкаРасчетовСПартнерами) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Обработчик = "ОтчетыКлиентЛокализация.СверкаРасчетовСПартнерами";
		КомандаОтчет.Менеджер = Метаданные.Отчеты.СверкаРасчетовСПартнерами.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Сверка расчетов с партнерами';
											|en = 'Reconciliation of AR/AP with partners'");
		
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.РежимЗаписи = "Проводить";
		КомандаОтчет.ИмяПараметраФормы = "Отбор.СверкаВзаиморасчетов";
		Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
			КомандаОтчет.КлючВарианта = "СверкаВзаиморасчетовКонтекстБазовая";
		Иначе
			КомандаОтчет.КлючВарианта = "СверкаВзаиморасчетовКонтекст";
		КонецЕсли;
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли