///////////////////////////////////////////////////////////////////
// Модуль "ОтложенныеЗадания" содержит переопределяемые
// процедуры и функции для работы с механизмом отложенных заданий.
//
///////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает количество фоновых заданий по умолчанию.
// 
// Возвращаемое значение:
//  Число - Количество фоновых заданий по умолчанию
//
Функция КоличествоФоновыхЗаданийПоУмолчанию() Экспорт
	
	Возврат 4;
	
КонецФункции

// Возвращает порцию расчета по умолчанию.
// 
// Возвращаемое значение:
//  Число - Порция расчета по умолчанию
//
Функция ПорцияРасчетаПоУмолчанию() Экспорт
	
	Возврат 100;
	
КонецФункции

#КонецОбласти
