#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
//
// Параметры:
//  КомандыОтчетов - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.Команды
//
// Возвращаемое значение:
//  Неопределено, СтрокаТаблицыЗначений - описание добавленной команды.
//
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.КонтрольПоставкиСырьяИМатериаловДавальцем2_5) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КомандаОтчет = КомандыОтчетов.Добавить();
	КомандаОтчет.Менеджер           = Метаданные.Отчеты.КонтрольПоставкиСырьяИМатериаловДавальцем2_5.ПолноеИмя();
	КомандаОтчет.Представление      = НСтр("ru = 'Контроль поставки сырья и материалов давальцем';
											|en = 'Control of raw and consumable materials delivery from material provider'");
	КомандаОтчет.МножественныйВыбор = Ложь;
	КомандаОтчет.Важность           = "Обычное";
	КомандаОтчет.КлючВарианта       = "КонтрольПоставкиСырьяИМатериаловДавальцем2_5Контекст";
	
	Возврат КомандаОтчет;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли