#Область ПрограммныйИнтерфейс

// см. ВариантыОтчетовПереопределяемый.ОпределитьРазделыСВариантамиОтчетов
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	Если НЕ ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		Разделы.Добавить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы(),
			НСтр("ru = 'Главное';
				|en = 'Main'"));
		
		Разделы.Добавить(Метаданные.Подсистемы.CRMИМаркетинг,
			НСтр("ru = 'Отчеты по CRM и маркетингу';
				|en = 'CRM and marketing reports'"));
		
		Разделы.Добавить(Метаданные.Подсистемы.Закупки,
			НСтр("ru = 'Отчеты по закупкам';
				|en = 'Purchasing reports'"));
		
		Разделы.Добавить(Метаданные.Подсистемы.Казначейство,
			НСтр("ru = 'Отчеты по казначейству';
				|en = 'Treasury reports'"));
		
		Разделы.Добавить(Метаданные.Подсистемы.Продажи,
			НСтр("ru = 'Отчеты по продажам';
				|en = 'Sales reports'"));
		
		Разделы.Добавить(Метаданные.Подсистемы.Склад,
			НСтр("ru = 'Отчеты по складу';
				|en = 'Warehouse reports'") );
		
		Разделы.Добавить(Метаданные.Подсистемы.ФинансовыйРезультатИКонтроллинг,
			НСтр("ru = 'Отчеты по финансовому результату';
				|en = 'Profitability and cost reports'"));
			
		//++ НЕ УТ
		Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		//-- НЕ УТ
			Разделы.Добавить(Метаданные.Подсистемы.Найти("Планирование"),
					НСтр("ru = 'Отчеты по планированию';
						|en = 'Planning reports'"));
		//++ НЕ УТ
		Иначе
			Разделы.Добавить(Метаданные.Подсистемы.БюджетированиеИПланирование,
				НСтр("ru = 'Отчеты по бюджетированию и планированию';
					|en = 'Budgeting and planning reports'"));
		КонецЕсли;
		//-- НЕ УТ
		
		//++ НЕ УТ
		Разделы.Добавить(Метаданные.Подсистемы.Производство,
			НСтр("ru = 'Отчеты по производству';
				|en = 'Manufacturing reports'"));
			
		Разделы.Добавить(Метаданные.Подсистемы.ВнеоборотныеАктивы,
			НСтр("ru = 'Отчеты по внеоборотным активам';
				|en = 'Fixed and intangible assets reports'"));
			
		//-- НЕ УТ
			
		//++ НЕ УТКА
		Разделы.Добавить(Метаданные.Подсистемы.МеждународныйФинансовыйУчет,
			НСтр("ru = 'Отчеты по международному финансовому учету';
				|en = 'General ledger reports'"));
		//-- НЕ УТКА
	
	КонецЕсли;
КонецПроцедуры

// см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	ВыводитьВариантыОтчетов = Ложь;
	
	ИспользоватьПроизводство = ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство");
	ИспользоватьНесколькоВидовНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовНоменклатуры");
	
	УчетНДСУП.НастроитьВариантыОтчетов(Настройки);
	//++ НЕ УТ
	ВнеоборотныеАктивы.НастроитьВариантыОтчетов(Настройки);
	УчетАрендованныхОС.НастроитьВариантыОтчетов(Настройки);
	//++ НЕ УТКА
	УправлениеРемонтами.НастроитьВариантыОтчетов(Настройки);
	МеждународныйУчетОбщегоНазначения.НастроитьВариантыОтчетов(Настройки);
	//-- НЕ УТКА

	//-- НЕ УТ
	
	#Область ABCXYZАнализНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ABCXYZАнализНоменклатуры);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие товары хорошо и стабильно продаются? 
		|Какие имеют низкий товарооборот и продаются нестабильно?';
		|en = 'Track which goods are sold well and consistently.
		|Verify which goods are sold poorly and inconsistently.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗапасыПоСкладам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие товары хорошо и стабильно продаются? 
		|Какие имеют низкий товарооборот и продаются нестабильно?';
		|en = 'Track which goods are sold well and consistently.
		|Verify which goods are sold poorly and inconsistently.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	#КонецОбласти
	
	#Область ABCXYZРаспределениеКлиентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ABCXYZРаспределениеКлиентов);
	ОписаниеОтчета.Описание = НСтр("ru = 'ABC/XYZ - распределение клиентов.';
									|en = 'ABC/XYZ distribution of customers.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область АнализДоходовРасходов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализДоходовРасходов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	// По предприятию.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоходыИРасходыПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Постатейный анализ доходов и расходов по предприятию в целом с возможностью выбора аналитики.';
									|en = 'Itemized analysis of income and expenses by enterprise as a whole with dimension selection.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасходыПредприятия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Постатейный анализ расходов по предприятию в целом.';
									|en = 'Itemized analysis of expenses by enterprise as a whole.'");
	
	// По организациям.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоходыИРасходыПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Постатейный анализ доходов и расходов предприятия в разрезе организаций с возможностью выбора аналитики.';
									|en = 'Itemized analysis of enterprise income and expenses by companies with dimension selection.'");
	//++ Локализация
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ВестиУправленческийУчетОрганизаций");
	//-- Локализация
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУчетПрочихДоходовРасходовРегл");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасходыОрганизаций");
	ОписаниеВарианта.Описание = НСтр("ru = 'Постатейный анализ расходов предприятия в разрезе организаций.';
									|en = 'Itemized analysis of enterprise expenses by companies.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУчетПрочихДоходовРасходовРегл");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоходыИРасходыПоПредприятиюМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Постатейный анализ доходов и расходов по предприятию в целом с возможностью выбора аналитики.';
									|en = 'Itemized analysis of income and expenses by enterprise as a whole with dimension selection.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Доходы и расходы предприятия (моб.)';
										|en = 'Income and Expenses — Enterprise (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область АнализЖурналаРегистрации
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализЖурналаРегистрации);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АктивностьПользователя");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализАктивностиПользователей");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольЖурналаРегистрации");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродолжительностьРаботыРегламентныхЗаданий");
	#КонецОбласти
	
	#Область АнализЗависимостиОтКлиентовABC
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализЗависимостиОтКлиентовABC);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие группы клиентов покупают более всего?';
									|en = 'Which customer groups are more active?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ изменения количества и соотношения клиентов, покупающих много, средне и мало.';
									|en = 'Analysis of quantity and ratio of customers who buy a lot, average and little.'");
	#КонецОбласти
	
	#Область АнализИсполненияАссортимента
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализИсполненияАссортимента);
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль соблюдения требований ассортиментной политики.
		|Какие квоты назначены на товары? Какие товары представлены в магазинах?';
		|en = 'Control compliance with the requirements of the product range policy.
		|Check which quotas are set for the goods and what kind of goods are present in stores.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализИсполненияАссортимента");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Соответствует ли количество товаров установленным квотам:
		|- по вводу в ассортимент,
		|- по наличию в магазинах?';
		|en = 'Check if the goods quantity corresponds to the set quotas:
		|- by adding to product range;
		|- by availability in stores.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоКатегорииКонтекст");
	#КонецОбласти
	
	#Область АнализКлиентскойБазыBCG
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализКлиентскойБазыBCG);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Комплексный анализ клиентской базы на основе АВС/XYZ-классификации клиентов.
		|С какими клиентам перспективно работать?';
		|en = 'Comprehensively analyze the customer base based on the ABC/XYZ classification of customers.
		|View which customers are promising to work with.'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПолей = НСтр("ru = 'A-класс
		|B-класс
		|C-класс
		|X-класс
		|Y-класс
		|Z-класс
		|Потерянные
		|Потенциальные
		|Текущая классификация
		|Предыдущая классификация
		|ABC/XYZ распределение
		|Изменения ABC
		|Изменения XYZ';
		|en = 'A class
		|B class
		|C class
		|X class
		|Y class
		|Z class
		|Lost
		|Potential
		|Current classification
		|Previous classification
		|ABC/XYZ classification
		|ABC changes
		|XYZ changes'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = НСтр("ru = 'Анализ на дату
		|Тип параметра классификации
		|Дата текущего среза
		|Дата предыдущего среза';
		|en = 'Analysis as of the date
		|Classification parameter type
		|Current slice date 
		|Previous slice date'");
	#КонецОбласти
	
	#Область АнализЛояльностиКлиентовXYZ
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализЛояльностиКлиентовXYZ);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие клиенты покупают регулярно?';
									|en = 'Check which customers buy regularly.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие клиенты покупают стабильно?
		|Какие клиенты являются разовыми?';
		|en = 'Track which customers buy consistently.
		|See which customers make one-time purchases.'");
	#КонецОбласти
	
	#Область АнализОстатковТоваровОрганизаций
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализОстатковТоваровОрганизаций);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область АнализПервичногоИнтереса
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПервичногоИнтереса);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько клиентов было привлечено?
		|Сколько было заключено сделок?
		|Анализ в разрезе источников воздействия, каналов первичного интереса и типам источников.';
		|en = 'How many customers are attracted?
		|How many deals are concluded?
		|Analysis by impact sources, lead source channels, and source types.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПервичныйИнтерес");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение источников первичного интереса по количеству зарегистрированных клиентов и заключенных сделок.';
									|en = 'Compare lead sources against the number of registered customers and sales opportunities.'");
	#КонецОбласти
	
	#Область АнализПервичногоСпроса
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПервичногоСпроса);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Насколько удовлетворен спрос клиентов?
		|Какие причины неудовлетворения спроса?';
		|en = 'Is customer demand fulfilled?
		|Why the demand is not fulfilled?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "УдовлетворениеПервичногоСпроса");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы основные причины неудовлетворения спроса в разрезе сделок и менеджеров?
		|По каким сделкам спрос был удовлетворен?';
		|en = 'Check the reasons for unfulfilled demand by sales opportunities and managers.
		|Verify for which sales opportunities the demand is fulfilled.'");
	#КонецОбласти
	
	#Область АнализПретензийКлиентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПретензийКлиентов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ регистрации и удовлетворения претензий от клиентов.';
									|en = 'Summary analysis of registration and satisfaction of customer complaints.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализВозникновенияПретензийКлиентов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Рейтинг причин возникновения претензий, подразделений и сотрудников по количеству претензий.';
									|en = 'Rating of reasons for customer complaint causes, business units and employees by the number of complaints.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализУдовлетворенияПретензий");
	ОписаниеВарианта.Описание = НСтр("ru = 'Соотношение удовлетворенных и неудовлетворенных претензий в разрезе причин.';
									|en = 'Ratio of fulfilled and unfulfilled complaints for each complaint reason.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаВозникновения");
	ОписаниеВарианта.Описание = НСтр("ru = 'Соотношение поступивших и отработанных претензий за период помесячно.';
									|en = 'Ratio of received and processed complaints for a month period.'");
	#КонецОбласти
	
	#Область АнализПричинОтменыЗаказовКлиентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПричинОтменыЗаказовКлиентов);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким причинам чаще всего заказы выполняются частично или не выполняются полностью?';
									|en = 'Check the reasons why the orders are fulfilled partially or incompletely.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПричиныОтменыЗаказовКлиентовБезЦеновыхГрупп");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким причинам чаще всего заказы выполняются частично или не выполняются полностью?
		|У каких менеджеров более всего выполненных не полностью заказов?';
		|en = 'Check the reasons why the orders are fulfilled partially or incompletely.
		|Verify which sales persons have the highest number of partially fulfilled orders.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьЦеновыеГруппы");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПричиныОтменыЗаказовКлиентовСЦеновымиГруппами");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким причинам чаще всего заказы выполняются частично или не выполняются полностью?
		|У каких менеджеров более всего выполненных не полностью заказов?';
		|en = 'Check the reasons why the orders are fulfilled partially or incompletely.
		|Verify which sales persons have the highest number of partially fulfilled orders.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьЦеновыеГруппы");
	#КонецОбласти
	
	#Область АнализПричинОтменыЗаказовПоставщикам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПричинОтменыЗаказовПоставщикам);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким причинам чаще всего заказы выполняются частично или не выполняются полностью?
		|У каких поставщиков более всего выполненных не полностью заказов?';
		|en = 'Check the reasons why the orders are fulfilled partially or incompletely.
		|Verify which vendors have the highest number of partially fulfilled orders.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РейтингПричинОтменыЗаказовПоставщикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Соотношение причин отмены с нашей стороны и со стороны поставщика.';
									|en = 'Ratio of cancellation reasons from our side and vendor side.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СтатистикаОтменыЗаказовПоставщикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Соотношение заказанных и отмененных строк в заказах поставщикам.';
									|en = 'Ratio of ordered and canceled lines in purchase orders.'");
	#КонецОбласти
	
	#Область АнализПричинОтменыЗаказовПоставщикамПоДокументу
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПричинОтменыЗаказовПоставщикамПоДокументу);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область АнализПричинПроигрышаСделок
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализПричинПроигрышаСделок);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие причины привели к проигрышу сделок?';
									|en = 'Verify the reasons for losing sales opportunities.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПричиныПроигрышаСделок");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие причины привели к проигрышу сделок?
		|У каких менеджеров?
		|С какими клиентами?';
		|en = 'Verify the reasons for losing sales opportunities.
		|Check which managers and customers were involved.
		|'");
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область АнализРаспределенияНачальныхОстатковНЗП
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализРаспределенияНачальныхОстатковНЗП);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	//++ НЕ УТ
	#Область АнализСебестоимостиВыпущеннойПродукции
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализСебестоимостиВыпущеннойПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ фактической себестоимости выпущенной продукции после закрытия месяца.';
									|en = 'Analysis of actual cost of released products after month-end closing.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализСебестоимостиВыпущеннойПродукции");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова себестоимость единицы произведенной продукции?
		|Какова совокупная себестоимость всей выпущенной продукции за период по организациям?';
		|en = 'Track the cost of manufactured product item.
		|Check the overall cost of all products manufactured for the period by companies.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализСебестоимостиВыпущеннойПродукцииПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова себестоимость единицы произведенной продукции?
		|Какова совокупная себестоимость всей выпущенной продукции за период по предприятию?';
		|en = 'Track the cost of manufactured product item.
		|Check the overall cost of all products manufactured for the period by the enterprise.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеСебестоимостиВыпущеннойПродукцииПоЗаказам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позаказный анализ удельной себестоимости выпущенной продукции по организациям.';
									|en = 'Order analysis of the issued product unit cost by companies.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеСебестоимостиВыпущеннойПродукцииПоЗаказамПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позаказный анализ удельной себестоимости выпущенной продукции по предприятию.';
									|en = 'Order analysis of the issued product unit cost by the enterprise.'");
	#КонецОбласти
	
	#Область ДеревоСебестоимостиПродукции
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДеревоСебестоимостиПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости продукции, детализированной до первичных затрат.';
									|en = 'Analysis of product cost detailed up to primary costs.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДеревоСебестоимостиПродукцииПредприятия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости продукции предприятия, детализированной до первичных затрат.';
									|en = 'Analysis of enterprise product cost detailed up to primary costs.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДеревоСебестоимостиПродукцииОрганизации");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости продукции организации, детализированной до первичных затрат.';
									|en = 'Analysis of company product cost detailed up to primary costs.'");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДеревоСебестоимостиПродукцииКонтекст");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область СебестоимостьТоваров

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СебестоимостьТоваров);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР.';
									|en = 'Analysis of inventory cost and additional expenses.'");
	
	// Общие.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР  по предприятию,
		|распределенных на себестоимость реализованных товаров.';
		|en = 'Analysis of inventory cost and additional expenses by the enterprise
		|allocated to cost of sold goods.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОперациямБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР  по предприятию в разрезе операций.';
									|en = 'Analysis of inventory cost and additional expenses by enterprise by transactions.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	// По организациям.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по организациям,
		|распределенных на себестоимость реализованных товаров.';
		|en = 'Analyze the inventory cost and additional expenses by companies
		|allocated to cost of sold goods.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОперациямПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по организациям в разрезе операций.';
									|en = 'Analysis of inventory cost and additional expenses by companies by transactions.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаЗакупокОрганизаций");
	ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Удалить", "ФинансовыйРезультатИКонтроллинг.СебестоимостьЗапасов");
	ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Вставить", "Закупки.Закупки");
	ОписаниеВарианта.Описание = НСтр("ru = 'Помесячные объемы закупок за выбранный период по поставщикам и номенклатуре.
		|Возможен анализ по периодам - квартал, месяц, неделя, день.';
		|en = 'Monthly purchase volume for the selected period by vendors and by items.
		|Analysis is available by the following periods - quarter, month, week, day.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	// По предприятию.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по предприятию,
		|распределенных на себестоимость реализованных товаров.';
		|en = 'Analysis of inventory cost and additional expenses by the enterprise
		|allocated to cost of sold goods.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СебестоимостьТоваровПоОперациямПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ себестоимости товаров и сумм ТЗР по предприятию в разрезе операций.';
									|en = 'Analysis of inventory cost and additional expenses by enterprise by transactions.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаЗакупокПредприятия");
	ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Удалить", "ФинансовыйРезультатИКонтроллинг.СебестоимостьЗапасов");
	ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Вставить", "Закупки.Закупки");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Помесячные объемы закупок за выбранный период по поставщикам и номенклатуре.
		|Возможен анализ по периодам - квартал, месяц, неделя, день.';
		|en = 'Monthly purchase volume for the selected period by vendors and by items.
		|Analysis is available by the following periods - quarter, month, week, day.'");
	
	#КонецОбласти
	
	#Область АнализФинансовыхРезультатов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализФинансовыхРезультатов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ прибылей и убытков по статьям и направлениям деятельности.';
									|en = 'Analysis of profits and losses by items and lines of business.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОтчетОПрибыляхИУбыткахПоНаправлениям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Постатейный анализ финансовых результатов по направлениям деятельности.';
									|en = 'Itemized analysis of profitability & cost by lines of business.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНаправлениямДеятельности");
	#КонецОбласти
	
	#Область АнализЦенПоставщиков
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализЦенПоставщиков);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область АнализЭффективностиРаботыТорговыхПредставителей
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализЭффективностиРаботыТорговыхПредставителей);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ того, насколько успешно торговые представители справляются с поставленными заданиями.
		|Отчет используется только при схеме работы с выдачей заданий торговым представителям.';
		|en = 'Analyze how successfully sales representatives perform their jobs. 
		|Use the report only if you assign sales representative tasks.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ того, насколько успешно торговые представители справляются с поставленными заданиями.
		|Отчет используется только при схеме работы с выдачей заданий торговым представителям.';
		|en = 'Analyze how successfully sales representatives perform their jobs. 
		|Use the report only if you assign sales representative tasks.'");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область БазаРаспределенияМатериаловИРабот
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.БазаРаспределенияМатериаловИРабот);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область БазаРаспределенияПроизводственныхРасходов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.БазаРаспределенияПроизводственныхРасходов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТ
	
	#Область БонусныеБаллы
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.БонусныеБаллы);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько осталось бонусных баллов, начисленных клиенту?';
									|en = 'Check how many accumulated bonus points are available.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиБонусныхБаллов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько осталось бонусных баллов, начисленных клиенту?
		|По каким бонусным программам остались начисленные баллы?';
		|en = 'Check how many accumulated bonus points are available.
		|Verify which rewards programs have accumulated bonus points.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиБонусныхБалловБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько осталось бонусных баллов, начисленных клиенту?';
									|en = 'Check how many accumulated bonus points are available.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	#КонецОбласти

	#Область СостояниеКассовыхСмен
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеКассовыхСмен);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ состояния кассовых смен по организациям и складам.
		|Контроль создания отчетов о розничных продажах/возвратах в разрезе применяемых СНО.';
		|en = 'Analyze the state of POS shifts by companies and warehouses.
		|Control generation of reports on retail sales/returns broken down by the TS used.'");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область БюджетныйОтчет
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.БюджетныйОтчет);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ВаловаяПрибыльПоОплаченнымОтгрузкам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВаловаяПрибыльПоОплаченнымОтгрузкам);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВаловаяПрибыльПоПолностьюОплаченнымОтгрузкам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие подразделения и менеджеры принесли более всего прибыли по оплате?';
									|en = 'Check which business units and sales persons generated more payment profit.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВаловаяПрибыльПоПолностьюОплаченнымОтгрузкамБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие клиенты принесли более всего прибыли по оплате?';
									|en = 'Which customers generated more profit from payment?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВаловаяПрибыльПоЧастичноОплаченнымОтгрузкам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие подразделения и менеджеры принесли более всего прибыли по частичной оплате?';
									|en = 'Check which business units and sales persons generated more partial payment profit.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВаловаяПрибыльПоЧастичноОплаченнымОтгрузкамБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие клиенты принесли более всего прибыли по частичной оплате?';
									|en = 'Which customers have generated more partial payment profit?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВаловаяПрибыльПоПолностьюОплаченнымОтгрузкамМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие подразделения и менеджеры принесли более всего прибыли по оплате?';
									|en = 'Check which business units and sales persons generated more payment profit.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Валовая прибыль по полной оплате отгрузок (моб.)';
										|en = 'Gross profit by full shipment payment (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ВедомостьБезналичныхДенежныхСредств
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьБезналичныхДенежныхСредств);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоДням");
	ОписаниеВарианта.Описание = НСтр("ru = 'Есть ли расхождения данных системы с загруженными выписками банка?';
									|en = 'Control any possible discrepancies between the application data and the imported bank statements.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ВедомостьПоДнямОдинСчет");
	#КонецОбласти
	
	#Область ВедомостьПоДенежнымСредствам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоДенежнымСредствам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоДенежнымСредствам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько денежных средств на расчетных счетах и в кассах, в пути?';
									|en = 'Check how much cash is on accounts, cash accounts, and in transit.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоДенежнымСредствамМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько денежных средств на расчетных счетах и в кассах, в пути?';
									|en = 'Check how much cash is on accounts, cash accounts, and in transit.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Ведомость по денежным средствам (моб.)';
										|en = 'Cash statement (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ВедомостьПоДенежнымСредствамУПодотчетныхЛиц
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоДенежнымСредствамУПодотчетныхЛиц);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоДенежнымСредствамУПодотчетныхЛиц");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько денежных средств на руках у подотчетных лиц?';
									|en = 'Check how much cash advance holders have.'");
	#КонецОбласти
	
	#Область ДвижениеДенежныхСредств
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДвиженияДенежныхСредств);
	ОписаниеОтчета.Наименование = НСтр("ru = 'Движение денежных средств';
										|en = 'Cash flow'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияДенежныхСредств");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие движения денежных средств происходили и планируются помесячно за период?
		|Из каких источников, на какие направления использования, по каким статьям ДДС?';
		|en = 'Verify what cash flows occurred and are planned monthly over the period.
		|Check the cash flow sources, lines of use, and cash flow items.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Движение денежных средств';
										|en = 'Cash flow'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияДенежныхСредствПоНаправлениямДеятельности");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие движения денежных средств происходили и планируются помесячно за период по направлению деятельности?
		|Из каких источников, на какие направления использования, по каким статьям ДДС?';
		|en = 'Verify what cash flows occurred and are planned monthly over the period by a line of business.
		|Check the cash flow sources, lines of use, and cash flow items.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Движение денежных средств по направлениям деятельности';
										|en = 'Cash flow by lines of business'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КорреспонденцииДвиженийДенежныхСредств");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова связь мест хранения денежных средств с источниками поступления и направлениями использования?';
									|en = 'What is the connection between the cash storage location with cash inflow sources and lines of use?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Корреспонденции движения денежных средств';
										|en = 'Cash flow correspondences'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеДенежныхСредствМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие движения денежных средств происходили и планируются помесячно за период?
		|Из каких источников, на какие направления использования, по каким статьям ДДС?';
		|en = 'Verify what cash flows occurred and are planned monthly over the period.
		|Check the cash flow sources, lines of use, and cash flow items.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Движение денежных средств (моб.)';
										|en = 'Cash flow (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ВедомостьПоПартиямТоваров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоПартиямТоваров);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль поступлений и списаний партий товаров.
		|Контроль распределения расходов механизмом партионного учета.';
		|en = 'Control how you can receive and write off lots. 
		|Control expense allocation using lot accounting.'");
	//++ Локализация
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПартионныйУчет");
	//-- Локализация
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоПартиямТоваровПредприятия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль поступлений и списаний партий товаров.
		|Контроль распределения расходов механизмом партионного учета.';
		|en = 'Control how you can receive and write off lots. 
		|Control expense allocation using lot accounting.'");
	//++ Локализация
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПартионныйУчет");
	//-- Локализация
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПередачиТоваровМеждуОрганизациями");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоПартиямТоваровОрганизаций");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль поступлений и списаний партий товаров.
		|Контроль распределения расходов механизмом партионного учета.';
		|en = 'Control how you can receive and write off lots. 
		|Control expense allocation using lot accounting.'");
	//++ Локализация
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПартионныйУчет");
	//-- Локализация
	#КонецОбласти
	
	#Область ВедомостьПоПереданнойВозвратнойТаре
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоПереданнойВозвратнойТаре);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ оборотов переданной клиентам возвратной тары за определенный период.';
									|en = 'Summary analysis of turnovers of returnable packaging transferred to customers for the specified period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоПереданнойВозвратнойТаре");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ оборотов переданной клиентам возвратной тары за определенный период.
		|Какова ее стоимость и количество?';
		|en = 'Summary analysis of turnovers of returnable packaging transferred to customers for the specified period.
		|Verify its cost and quantity.'");
	#КонецОбласти
	
	#Область ВедомостьПоПринятойВозвратнойТаре
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоПринятойВозвратнойТаре);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ оборотов принятой от поставщиков тары за определенный период.';
									|en = 'Summary analysis of turnovers of the packaging received from vendors for the specified period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоПринятойВозвратнойТаре");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ оборотов принятой от поставщиков тары за определенный период.
		|Какова ее стоимость и количество?';
		|en = 'Summary analysis of turnovers of the packaging received from vendors for the specified period.
		|Check its cost and quantity.'");
	#КонецОбласти
	
	#Область ВедомостьПоСериямНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоСериямНоменклатуры);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьСерииНоменклатуры");
	ОписаниеВарианта.Описание = ?(ИспользоватьПроизводство,
									НСтр("ru = 'Сводный анализ движения серии номенклатуры на складах и в производстве.';
										|en = 'Summary analysis of movement of item batch across warehouses and production.'"),
									НСтр("ru = 'Сводный анализ движения серии номенклатуры на складах.';
										|en = 'Summary analysis of movement of item batch in warehouses.'"));
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоСериямНоменклатуры");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьСерииНоменклатуры");
	ОписаниеВарианта.Описание = ?(ИспользоватьПроизводство,
									НСтр("ru = 'Сводный анализ движения серии номенклатуры на складах и в производстве.';
										|en = 'Summary analysis of movement of item batch across warehouses and production.'"),
									НСтр("ru = 'Сводный анализ движения серии номенклатуры на складах.';
										|en = 'Summary analysis of movement of item batch in warehouses.'"));
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ВедомостьПоСериямНоменклатурыКонтекст");
	#КонецОбласти
	
	#Область ВедомостьПоТоварамНаСкладах
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоТоварамНаСкладах);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ количественного движения товаров на складах предприятия.';
									|en = 'Analyze quantitative goods transfer within the enterprise warehouses.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоТоварамНаСкладах");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ количественного движения товаров на складах предприятия.';
									|en = 'Analyze quantitative goods transfer within the enterprise warehouses.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиНаСкладе");
	ОписаниеВарианта.Описание = НСтр("ru = 'Остатки товаров на складах и в помещениях предприятия.';
									|en = 'Stock balance in warehouses and enterprise warerooms.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОстаткиИОборотыСГруппировкойПоСкладам");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОтгружаемыеТовары");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОтгружаемыеТоварыПоПересчетуКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоТоварамНаСкладахМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ количественного движения товаров на складах предприятия.';
									|en = 'Analyze quantitative goods transfer within the enterprise warehouses.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Ведомость по товарам на складах (моб.)';
										|en = 'Warehouse stock (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений и оценка стоимости товаров на складах по выбранному виду цен.';
									|en = 'Analyze movement and estimate warehouse stock by the selected price type.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьВЦенахНоменклатуры");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений и оценка стоимости товаров на складах по выбранному виду цен.';
									|en = 'Analyze movement and estimate warehouse stock by the selected price type.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОценкаОстатковТоваров");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка стоимости остатков товаров на складах по выбранному виду цен.';
									|en = 'Warehouse stock valuation by the selected price type.'");
	#КонецОбласти
	
	#Область ВедомостьПоТоварамОрганизаций
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоТоварамОрганизаций);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль остатков и движений товаров по организациям.';
									|en = 'Control stock balance and goods movements by companies.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровОрганизаций");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений товаров на складах и организациях.
		|В какой организации и по какому складу есть товар и были движения за период?';
		|en = 'Analyze goods movement in warehouses and companies.
		|Shows which company and warehouse have goods available and movements over the period.'");
	ПодсистемаОтчета = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.ОптовыеПродажи");
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаОтчета);
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоступныеДляПродажиТоварыОрганизаций");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие товары доступны на складах для продажи от имени выбранной организации?';
									|en = 'Which goods are available for sale in warehouses on behalf of the selected company?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровПереданных");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений товаров, переданных на хранение.
		|У каких партнеров и по каким договорам есть наш товар и были движения за период?';
		|en = 'Analyze movement of goods transferred for storage.
		|Check at what partners and under what contracts there are our goods and movements over the period.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровПереданныхНаКомиссию25");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений товаров, переданных на комиссию.
		|У каких партнеров и по каким договорам есть наш товар и были движения за период?';
		|en = 'Analyze movements of consignment sales stock.
		|Check what partners have our goods and under what contracts. Check if there were any movements over the period.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриПродажах");
	ПодсистемаОтчета = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.КомиссионныеПродажи");
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаОтчета);
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОтключитьВариантДвиженияТоваровПереданныхПереработчикам = Истина;
	//++ НЕ УТ
	ОтключитьВариантДвиженияТоваровПереданныхПереработчикам = Ложь;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровПереданныхПереработчикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений товаров, хранящихся у переработчиков.
									|У каких переработчиков и по каким договорам есть наш товар и были движения за период?';
									|en = 'Analyze movements of goods stored at subcontractors.
									|Check at what subcontractors and under what contracts  there are our goods and movements over the period.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	
	ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Вставить", "Производство.ПередачаВПереработку2_5");
	ИзменитьРазмещениеВариантаОтчета(ОписаниеВарианта.Размещение, "Вставить", "Производство.ПередачаВПереработку2_5_СЗаголовками");
	
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	//-- НЕ УТ
	Если ОтключитьВариантДвиженияТоваровПереданныхПереработчикам Тогда
		ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДвиженияТоваровПереданныхПереработчикам");
	КонецЕсли;
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОстаткиТоваровОрганизаций");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекстБазовая");
	//++ Локализация
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровОрганизацийПоРНПТ");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль остатков и движений прослеживаемых импортных товаров по организациям.';
									|en = 'Control of balances and register records of traced imported goods by companies.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУчетПрослеживаемыхИмпортныхТоваров");
	//-- Локализация
	#КонецОбласти
	
	#Область ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений и оценка стоимости товаров на складах и организациях по виду цен.';
									|en = 'Movement analysis and valuation of goods in warehouses and companies by the price type.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений и оценка стоимости товаров на складах и организациях по виду цен.
									|В какой организации, по какому складу есть товар и какова его стоимость?';
									|en = 'Analyze movement and estimate the cost of goods in warehouses and companies by the price type.
									|Check in what company and in what warehouse there are goods and what its cost is.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровПереданных");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений и оценка стоимости переданных на хранение товаров.
									|У каких партнеров есть наш товар и какова его оценка стоимости?';
									|en = 'Analyze and estimate filled up VMI.
									|Check what partners have our goods and what its estimation is.'");
	ПодсистемаОтчета = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.РозничныеПродажи");
	ОписаниеВарианта.Размещение.Удалить(ПодсистемаОтчета);
	ПодсистемаОтчета = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.ОптовыеПродажи");
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаОтчета);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровПереданныхНаКомиссию25");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движений и оценка стоимости переданных на комиссию товаров.
									|У каких партнеров есть наш товар и какова его оценка стоимости?';
									|en = 'Estimate the value of transferred consignment stock.
									|Check which partners have our stock and what its value is.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриПродажах");
	ПодсистемаОтчета = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.РозничныеПродажи");
	ОписаниеВарианта.Размещение.Удалить(ПодсистемаОтчета);
	ПодсистемаОтчета = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.КомиссионныеПродажи");
	ОписаниеВарианта.Размещение.Вставить(ПодсистемаОтчета);
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	#КонецОбласти
	
	#Область ВедомостьРасчетовМеждуОрганизациями
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьРасчетовМеждуОрганизациями);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль взаиморасчетов между организациями, входящими в состав предприятия.';
									|en = 'Control mutual intercompany AR/AP open items that are a part of an organization.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыПоЗакупкам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль взаиморасчетов между организациями, входящими в состав предприятия.
		|Сколько организация-покупатель должна организации-продавцу?
		|Уменьшился или увеличился долг за выбранный период?';
		|en = 'Control mutual intercompany AR/AP open items that are a part of an organization.
		|Verify the debt of the customer company to the seller company.
		|Check if the debt has increased or decreased over the selected period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыПоПродажам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль взаиморасчетов между организациями, входящими в состав предприятия.
		|Сколько организация-продавец должна получить от организации-покупателя?
		|Уменьшился или увеличился долг за выбранный период?';
		|en = 'Control mutual intercompany AR/AP open items that are a part of an organization.
		|What is the debt of the customer company to the seller company?
		|Has the debt increased or decreased for the selected period?'");
	#КонецОбласти
	
	#Область ВедомостьРасчетовСКлиентами
	ОписаниеВедомостьРасчетовСКлиентами = НСтр("ru = 'Детальный анализ взаиморасчетов с клиентами.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Analyze customer AR/AP in detail.
		|Verify how the debt changed over the specified period.
		|Check the current AR/AP balance.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьРасчетовСКлиентами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСКлиентами;
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Ведомость");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСКлиентами;
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСКлиентами;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьМобильныйКлиент");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСКлиентами;
	ОписаниеВарианта.Наименование = НСтр("ru = 'Ведомость расчетов с клиентами (моб.)';
										|en = 'Customer AR/AP roll forward (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ВедомостьРасчетовСПартнерами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьРасчетовСПартнерами);
	ОписаниеВедомостьРасчетовСПартнерами = НСтр("ru = 'Сводный анализ взаиморасчетов с клиентами и поставщиками.
											|Как изменялась задолженность за указанный период?
											|Какое текущее сальдо расчетов?';
											|en = 'Summary analysis of AR/AP with customers and vendors.
											|Check how the debt has changed over the specified period.
											|Verify the current AR/AP balance.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСПартнерами");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСПартнерами;
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСПартнерамиБазовая");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСПартнерами;
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоКонтрагентамКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоКонтрагентамКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоПартнерамКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоПартнерамКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоСверкеВзаиморасчетовКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоСверкеВзаиморасчетовКонтекстБазовая");
	#КонецОбласти
	
	#Область ВероятностныйПрогноз
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВероятностныйПрогноз);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какая вероятность выигрыша сделок на каждом из этапов процесса продаж?';
									|en = 'Check the probability for winning sales opportunities on each stage of the sales process.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какая вероятность выигрыша сделок на каждом из этапов процесса продаж?';
									|en = 'Check the probability for winning sales opportunities on each stage of the sales process.'");
	#КонецОбласти
	
	#Область ВоронкаПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВоронкаПродаж);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова эффективность каждой стадии продажи?';
									|en = 'Check the efficiency of each sale stage.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова эффективность каждой стадии продажи?';
									|en = 'Check the efficiency of each sale stage.'");
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область ВыполнениеЗадачБюджетногоПроцесса
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВыполнениеЗадачБюджетногоПроцесса);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ исполнительской дисциплины бюджетного процесса.';
									|en = 'Analysis of budget process performance discipline.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВсеЗадачи");
	ОписаниеВарианта.Описание = НСтр("ru = 'Выполнены или нет задачи бюджетирования?
		|Какие просрочены, кем и на сколько дней?';
		|en = 'Check whether budgeting tasks are completed.
		|Verify which of them are overdue, by whom, and for how many days.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СтатистикаПоИсполнениюЗадач");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько бюджетных задач выполнено и не выполнено исполнителями?
		|В рамках каких бюджетных шагов?';
		|en = 'Verify how many budget tasks were completed and not completed by assignees.
		|Check within which budget steps the tasks were completed.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СвязанныеЗадачи");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ТекущиеЗадачи");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ТекущиеЗадачиРасшифровка");
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ВыполнениеУсловийСоглашенийСКлиентами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВыполнениеУсловийСоглашенийСКлиентами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль выполнения клиентами условий соглашений, в которых заданы регулярные условия продаж.';
									|en = 'Control of customer''s compliance with the standard terms of sales.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль выполнения клиентами условий соглашений, в которых заданы регулярные условия продаж.';
									|en = 'Control of customer''s compliance with the standard terms of sales.'");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ВыпускПродукции
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВыпускПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка выпуска по подразделениям.';
									|en = 'Business unit release evaluation.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВыпускПродукции");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какой объем выпуска в подразделениях?
											|Нет ли ошибок при оформлении документов выпуска?
											|Нет ли ошибок в отражении затрат по работам и полуфабрикатам?';
											|en = 'Take an overview of the output volume in the business units.
											|Check if there any errors upon registering output documents.
											|Verify if there any errors upon recording costs of works and semi-finished products.'");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ВыручкаИСебестоимостьПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВыручкаИСебестоимостьПродаж);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	// Общие.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Финансовый анализ продаж по аналитикам организации, клиенты, менеджеры, 
		|склады, номенклатура и другим.';
		|en = 'Financial analysis of sales by company dimensions, customers, managers, 
		|warehouses, products, etc.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаПродаж");
	ОписаниеВарианта.Описание = НСтр("ru = 'Помесячные объемы продаж за выбранный период по видам номенклатуры.
									 |Возможен анализ по периодам - квартал, месяц, неделя, день.';
									 |en = 'Monthly sales volume for the selected period by item kinds.
									 |Analysis is available by the following periods - quarter, month, week, day.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Динамика продаж по видам номенклатуры';
										|en = 'Sales trends by item kinds'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьНесколькоВидовНоменклатуры");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаПродажБизнесРегионы");
	ОписаниеВарианта.Описание = ?(ИспользоватьНесколькоВидовНоменклатуры, 
									НСтр("ru = 'Помесячные объемы продаж за выбранный период по бизнес-регионам и видам номенклатуры.
										 |Возможен анализ по периодам - квартал, месяц, неделя, день.';
										 |en = 'Monthly sales volume for the selected period by business regions and item kinds.
										 |Analysis is available by the following periods - quarter, month, week, day.'"),
									НСтр("ru = 'Помесячные объемы продаж за выбранный период по бизнес-регионам.
										 |Возможен анализ по периодам - квартал, месяц, неделя, день.';
										 |en = 'Monthly sales volume for the selected period by business regions.
										 |Analysis is available by the following periods: a quarter, a month, a week, a day.'"));
	ОписаниеВарианта.Наименование = ?(ИспользоватьНесколькоВидовНоменклатуры, 
										НСтр("ru = 'Динамика продаж по бизнес-регионам и видам номенклатуры';
											|en = 'Sales trends by business regions and item kinds'"),
										НСтр("ru = 'Динамика продаж по бизнес-регионам';
											|en = 'Sales trends by business regions'"));
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.ОптовыеПродажи");
	ОписаниеВарианта.Размещение.Вставить(Подсистема);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьБизнесРегионы");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиПоПартнерамБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким клиентам получена наибольшая валовая прибыль?';
									|en = 'Check which customers brought the biggest gross profit.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиПоПоставщикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'По товарам от каких поставщиков получена наибольшая валовая прибыль?';
									|en = 'Verify goods of which vendors generated the biggest gross profit.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.ФинансовыйРезультатИКонтроллинг.Подсистема.ФинансовыйРезультат");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	
	// По предприятию.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиСводно");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ продаж по подразделениям (магазинам), 
		|менеджерам и номенклатуре.';
		|en = 'Summary analysis of sales by business units (stores), 
		|sales persons, and items.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.ОптовыеПродажи");
	ОписаниеВарианта.Размещение.Вставить(Подсистема, "Важный");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.ФинансовыйРезультатИКонтроллинг.Подсистема.ФинансовыйРезультат");
	ОписаниеВарианта.Размещение.Вставить(Подсистема);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПередачиТоваровМеждуОрганизациями");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиСводноБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ продаж по организациям, подразделениям (магазинам), 
		|менеджерам и номенклатуре.';
		|en = 'Summary analysis of sales by companies, business units (stores), 
		|sales persons, and items.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДинамикаПродажКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПродажиПоЗаказуКонтекст");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиПоСделкамПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким видам сделок и сделкам больше всего продаж клиентам по предприятию?';
									|en = 'Verify which sales opportunities and sales opportunity kinds bring the most sales to customers across the enterprise.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.ОптовыеПродажи");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.ФинансовыйРезультатИКонтроллинг.Подсистема.ФинансовыйРезультат");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.CRMИМаркетинг.Подсистема.ПроведениеСделокОтчеты");
	ОписаниеВарианта.Размещение.Вставить(Подсистема);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьСделкиСКлиентами");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПередачиТоваровМеждуОрганизациями");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиПоПартнерамПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким клиентам получена наибольшая валовая прибыль по предприятию?';
									|en = 'Check which customers brought the biggest gross profit by enterprise.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.ФинансовыйРезультатИКонтроллинг.Подсистема.ФинансовыйРезультат");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПередачиТоваровМеждуОрганизациями");
	
	// По организациям.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиОрганизаций");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ продаж по организациям, подразделениям (магазинам), 
		|менеджерам и номенклатуре.';
		|en = 'Summary analysis of sales by companies, business units (stores), 
		|sales persons, and items.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.ФинансовыйРезультатИКонтроллинг.Подсистема.ФинансовыйРезультат");
	ОписаниеВарианта.Размещение.Вставить(Подсистема);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиПоСделкамПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким видам сделок и сделкам больше всего продаж клиентам по организациям?';
									|en = 'Verify which sales opportunities and sales opportunity kinds bring the most sales to customers by companies.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи.Подсистема.ОптовыеПродажи");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.ФинансовыйРезультатИКонтроллинг.Подсистема.ФинансовыйРезультат");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.CRMИМаркетинг.Подсистема.ПроведениеСделокОтчеты");
	ОписаниеВарианта.Размещение.Вставить(Подсистема);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьСделкиСКлиентами");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиПоПартнерамПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким клиентам получена наибольшая валовая прибыль по организациям?';
									|en = 'Check which customers brought the biggest gross profit by the companies.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.ФинансовыйРезультатИКонтроллинг.Подсистема.ФинансовыйРезультат");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиСводноМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ продаж по подразделениям (магазинам), 
		|менеджерам и номенклатуре.';
		|en = 'Summary analysis of sales by business units (stores), 
		|sales persons, and items.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Валовая прибыль предприятия (моб.)';
										|en = 'Enterprise gross profit (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ВыручкаИСебестоимостьРозничныхПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВыручкаИСебестоимостьРозничныхПродаж);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Финансовый анализ розничных продаж
		|по подразделениям (магазинам), складам и поставщикам.';
		|en = 'Financial analysis of retail sales 
		|by business units (stores), warehouses, and vendors'");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаПродажРозницы");
	ОписаниеВарианта.Описание = НСтр("ru = 'Помесячные объемы розничных продаж за выбранный период.
		|Возможен анализ по периодам - квартал, месяц, неделя, день.';
		|en = 'Monthly volume of retail sales for the selected period.
		|Analysis is available by the following periods - quarter, month, week, day.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьБизнесРегионы");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаПродажРозницыБизнесРегионы");
	ОписаниеВарианта.Описание = НСтр("ru = 'Помесячные объемы розничных продаж за выбранный период.
		|Возможен анализ по периодам - квартал, месяц, неделя, день.';
		|en = 'Monthly volume of retail sales for the selected period.
		|Analysis is available by the following periods - quarter, month, week, day.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьБизнесРегионы");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиРозницыПоПодразделениям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие магазины принесли более всего валовой прибыли?';
									|en = 'Verify which stores generated more gross profit.'");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиРозницыПоПоставщикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'По товарам от каких поставщиков получена
		|наибольшая валовая прибыль при розничных продажах?';
		|en = 'Check goods of which vendors generated 
		|the biggest gross profit from retail sales.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ФормироватьВидыЗапасовПоПоставщикам");
	#КонецОбласти

	//++ НЕ УТКА
	#Область ГрафикПроизводстваПродукции2_2
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ГрафикПроизводстваПродукции2_2);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Просмотр графика производства продукции.';
									|en = 'View the production schedule.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ГрафикПроизводстваПродукцииПоЗаказам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие даты выпуска/запуска продукции?
										|Когда будут выполнены заказы?
										|Какой объем выпуска запланирован в подразделении?
										|Какие этапы необходимо выполнить в подразделении за период?';
										|en = 'Check product release/launch dates.
										|Verify when the orders will be fulfilled.
										|Track the planned output volume in the business unit.
										|Analyze which steps must be performed in the business unit over a period.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	#КонецОбласти
	
	#Область НормативныйГрафикВыпускаПродукцииПоЗаказам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.НормативныйГрафикПроизводстваПоЗаказам);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Просмотр нормативного графика производства продукции.';
									|en = 'View the standard production schedule.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НормативныйГрафикПроизводстваПоЗаказам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие желаемые даты запуска/выпуска продукции и полуфабрикатов по заказам?
										|Какие этапы необходимо выполнить за период?
										|Какой объем номенклатуры запланирован к производству?';
										|en = 'What are the desired launch/release dates of manufactured products and semi-finished products under orders?
										|What stages need to be completed during the period?
										|What volume of products is planned for production?'");
	
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ДвижениеСерииНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДвижениеСерииНоменклатуры);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьСерииНоменклатуры");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.Описание = ?(ИспользоватьПроизводство,
									НСтр("ru = 'Детальный анализ движения серии номенклатуры на складах и в производстве.';
										|en = 'Detailed analysis of movement of item batch in warehouses and production.'"),
									НСтр("ru = 'Детальный анализ движения серии номенклатуры на складах.';
										|en = 'Detailed analysis of movement of item batch in warehouses.'"));
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеСерииНоменклатуры");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьСерииНоменклатуры");
	ОписаниеВарианта.Описание = ?(ИспользоватьПроизводство,
									НСтр("ru = 'Детальный анализ движения серии номенклатуры на складах и в производстве.';
										|en = 'Detailed analysis of movement of item batch in warehouses and production.'"),
									НСтр("ru = 'Детальный анализ движения серии номенклатуры на складах.';
										|en = 'Detailed analysis of movement of item batch in warehouses.'"));
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДвижениеСерииНоменклатурыКонтекст");
	#КонецОбласти
	
	
	#Область ДебиторскаяЗадолженность
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДебиторскаяЗадолженность);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности клиентов с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Customer receivables analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДебиторскаяЗадолженность");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности клиентов с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Customer receivables analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	#КонецОбласти
	
	#Область ДебиторскаяЗадолженностьДоляПросрочки
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДебиторскаяЗадолженностьДоляПросрочки);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ изменения доли просроченной дебиторской задолженности с разбивкой по периодам.';
									|en = 'Analyze overdue receivable share change broken down by periods.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоляПросроченнойДЗ");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ изменения доли просроченной дебиторской задолженности с разбивкой по периодам.';
									|en = 'Analyze overdue receivable share change broken down by periods.'");
	#КонецОбласти
	
	#Область ДемонстрационныеСценарииОбъекта
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДемонстрационныеСценарииОбъекта);
	ОписаниеОтчета.Включен = Ложь;
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область ДиагностикаЭтапаПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДиагностикаЭтапаПроизводства);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ДиаграммаПроизводстваЗаказа
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДиаграммаПроизводстваЗаказа);
	ОписаниеОтчета.Описание = НСтр("ru = 'Просмотр графика производства заказа в виде диаграммы Ганта.';
									|en = 'View order production schedule as a Gantt chart.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПолей = НСтр("ru = 'Подразделение
		|Вид рабочего центра
		|Продукция
		|Полуфабрикат
		|Этап производства';
		|en = 'Business unit
		|Work center type
		|Manufactured products
		|Semi-finished product
		|Production stage'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = НСтр("ru = 'Заказ на производство';
																				|en = 'Production order'");
	#КонецОбласти
	
	#Область ДиаграммаПроизводстваПартииЗапуска
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДиаграммаПроизводстваПартииЗапуска);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ДиаграммаСмежныхЭтаповПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДиаграммаСмежныхЭтаповПроизводства);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ДинамикаИзмененияЦенНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДинамикаИзмененияЦенНоменклатуры);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ДинамикаИзмененияЦенНоменклатуры2_5
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДинамикаИзмененияЦенНоменклатуры2_5);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ДинамикаИзмененияЦенНоменклатурыПоставщика
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДинамикаИзмененияЦенНоменклатурыПоставщика);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ДинамикаПоказателейРаботыТорговыхПредставителей
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДинамикаПоказателейРаботыТорговыхПредставителей);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ изменения показателей, характеризующих эффективность работы торговых представителей.';
									|en = 'Analyze the change of indicators showing efficiency of sales representatives.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДинамикаПоказателейТорговыхПредставителей");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ изменения показателей, характеризующих эффективность работы торговых представителей.';
									|en = 'Analyze the change of indicators showing efficiency of sales representatives.'");
	#КонецОбласти
	
	#Область ДинамикаИнцидентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДинамикаИнцидентов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика обращений пользователей по инцидентам за период.';
									|en = 'Trends of user support tickets on incidents for the period.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьИнциденты");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	#КонецОбласти

	#Область ДоступностьВариантовАнализаЦелевыхПоказателей
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДоступностьВариантовАнализаЦелевыхПоказателей);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ДосьеПартнера
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДосьеПартнера);
	ОписаниеОтчета.Включен = Ложь;
	#КонецОбласти
	
	#Область ДублиИнцидента
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДублиИнцидента);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ЗаблокированныеЯчейки
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗаблокированныеЯчейки);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти

	#Область ЗависшиеЗадачи
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗависшиеЗадачи);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Задачи, которые не могут быть выполнены из-за того, что не заполнен список ролей и исполнителей.';
									|en = 'Tasks that cannot be completed because of unfilled list of roles and assignees.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗависшиеЗадачиПоИсполнителям");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗависшиеЗадачиПоОбъектамАдресации");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПросроченныеЗадачи");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СводкаПоЗависшимЗадачам");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область ЗагрузкаВидовРабочихЦентров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗагрузкаВидовРабочихЦентров);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ загрузки видов рабочих центров по графику производства.';
									|en = 'Analysis of load of work center types by production schedule.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗагрузкаВидовРабочихЦентровТаблица");
	ОписаниеВарианта.Описание = НСтр("ru = 'Показывает загрузку видов рабочих центров в каждом подразделении.';
									|en = 'Shows the load of work center types in each business unit.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПланированиеПоПроизводственнымРесурсам");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗанятостьВидовРабочихЦентров");
	ОписаниеВарианта.Описание = НСтр("ru = 'Занятость видов рабочих центров с детализацией до производственных процессов.';
									|en = 'Stage placement in work center calendar with itemization to production processes.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяТолькоУправлениеПроизводством21");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗагрузкаВидовРабочихЦентровТаблицаКонтекст");
	#КонецОбласти

	#Область ЗагрузкаОборудованияПоМоделиГрафикаПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗагрузкаОборудованияПоМоделиГрафикаПроизводства);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти

	#Область ПараметрыПроизводственныхОпераций
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПараметрыПроизводственныхОпераций);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Значения параметров производственных операций с отклонениями от нормативов.';
									|en = 'Production operation parameter values with variances from standards.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПооперационноеПланирование");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПооперационноеУправление");
	#КонецОбласти
	
	#Область ХодВыполненияПроизводственныхОпераций
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ХодВыполненияПроизводственныхОпераций);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Отслеживание хода выполнения операций этапа';
									|en = 'Stage operation procedure tracking'");
	
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПооперационноеПланирование");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПооперационноеУправление");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ХодВыполненияОперацийЭтапаКонтекст");
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область Задания
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.Задания);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СписокЗаданий");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	#КонецОбласти
	
	#Область Задачи
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.Задачи);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СправкаПоИсполнительскойДисциплине");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТекущиеЗадачи");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	#КонецОбласти
	
	#Область ЗадачиИстекающиеНаДату
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗадачиИстекающиеНаДату);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадачиИстекающиеНаДату");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	#КонецОбласти

	#Область ЗадолженностьКлиентов
	ОписаниеЗадолженностьКлиентов = НСтр("ru = 'Текущее состояние расчетов с клиентами.
		|Какой долг клиента сейчас? На какую сумму планируется отгрузка?
		|На какую сумма ожидается оплата от клиента?';
		|en = 'The current customer AR/AP.
		|Check the customer receivables. Verify the amount of goods to be shipped.
		|Track the amount of customer''s payment.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗадолженностьКлиентов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = ОписаниеЗадолженностьКлиентов;
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентов");
	ОписаниеВарианта.Описание = ОписаниеЗадолженностьКлиентов;
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовБазовая");
	ОписаниеВарианта.Описание = ОписаниеЗадолженностьКлиентов;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовПоОбъектуРасчетовКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовПоОбъектуРасчетовКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентаКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентаКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовПричиныЗапретаОтгрузки");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовМобильныйКлиент");
	ОписаниеВарианта.Описание = ОписаниеЗадолженностьКлиентов;
	ОписаниеВарианта.Наименование = НСтр("ru = 'Задолженность клиентов (моб.)';
										|en = 'Customer AR/AP open items (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ЗадолженностьКлиентовПоСрокам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗадолженностьКлиентовПоСрокам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности клиентов с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Customer receivables analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовПоСрокам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности клиентов с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Customer receivables analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьКлиентовПоСрокамМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности клиентов с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Customer receivables analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Задолженность клиентов по срокам (моб.)';
										|en = 'Customer AR/AP open items aging (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ОплатыКлиентовПоСрокам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОплатыКлиентовПоСрокам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ нашей задолженности клиентам с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Analysis of customer payables broken down by debt intervals.
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОплатыКлиентовПоСрокам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ нашей задолженности клиентам с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Analysis of customer payables broken down by debt intervals.
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	#КонецОбласти
	
	#Область ЗадолженностьПоставщикам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗадолженностьПоставщикам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с поставщиками.
		|Какой долг поставщику сейчас? На какую сумму планируется поступление?
		|На какую сумма ожидается оплата поставщику?';
		|en = 'The current state of vendor AR/AP.
		|Check the accounts payable to the vendor now. Verify the amount of delivered goods.
		|Check the amount of payment to the vendor.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с поставщиками.
		|Какой долг поставщику сейчас? На какую сумму планируется поступление?
		|На какую сумма ожидается оплата поставщику?';
		|en = 'The current state of vendor AR/AP.
		|Check the accounts payable to the vendor now. Verify the amount of delivered goods.
		|Check the amount of payment to the vendor.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикамБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с поставщиками.
		|Какой долг поставщику сейчас? На какую сумму планируется поступление?
		|На какую сумма ожидается оплата поставщику?';
		|en = 'The current state of vendor AR/AP.
		|Check the accounts payable to the vendor now. Verify the amount of delivered goods.
		|Check the amount of payment to the vendor.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикамПоОбъектуРасчетовКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикамПоОбъектуРасчетовКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикуКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикуКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикамКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикамКонтекстБазовая");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикамМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с поставщиками.
		|Какой долг поставщику сейчас? На какую сумму планируется поступление?
		|На какую сумма ожидается оплата поставщику?';
		|en = 'The current state of vendor AR/AP.
		|Check the accounts payable to the vendor now. Verify the amount of delivered goods.
		|Check the amount of payment to the vendor.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Задолженность поставщикам (моб.)';
										|en = 'Vendor payables (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ЗадолженностьПоставщикамПоСрокам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗадолженностьПоставщикамПоСрокам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности перед поставщиками с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Accounts payable analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьПоставщикамПоСрокам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности перед поставщиками с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Accounts payable analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	#КонецОбласти
	
	#Область ОплатыПоставщикамПоСрокам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОплатыПоставщикамПоСрокам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности поставщиков с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Analysis of vendor receivables broken down by debt intervals.
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОплатыПоставщикамПоСрокам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности поставщиков с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Analysis of vendor receivables broken down by debt intervals.
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	#КонецОбласти
	
	#Область ЗаполнениеСвойствПартнеров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗаполнениеСвойствПартнеров);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.Описание = НСтр("ru = 'Все ли свойства клиентов, поставщиков заполнены?
		|Сколько и каких свойств нужно заполнить?';
		|en = 'Are all the customers'' and vendors'' properties filled in? 
		|How many and which properties are yet to be filled in?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.Описание = НСтр("ru = 'Насколько заполнены свойства клиентов, поставщиков?
		|Оценка полноты клиентской базы.';
		|en = 'Check if customer and vendor properties are fully filled in.
		|Assess the customer base fullness.'");
	#КонецОбласти
	
	#Область ЗаполненностьСклада
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗаполненностьСклада);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие складские помещения простаивают (пусты или заполнены недостаточно)?';
									|en = 'Which warerooms are out of action (empty or not full enough)?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗаполненностьСклада");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие складские помещения простаивают (пусты или заполнены недостаточно)?
		|Какие области переполнены и требуют расширения?';
		|en = 'Check which warerooms are out of action (empty or not full enough).
		|Verify which areas are overloaded and require extension.'");
	#КонецОбласти	
	
	//++ НЕ УТ
	#Область ЗначенияНефинансовыхПоказателей
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЗначенияНефинансовыхПоказателей);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗначенияНефинансовыхПоказателей");
	ОписаниеВарианта.Описание = НСтр("ru = 'Обзор значений нефинансовых показателей по периодам.';
									|en = 'View non-financial item values by periods.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЗначенияНефинансовогоПоказателя");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Расшифровка");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ИзменениеABCXYZРаспределенияКлиентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИзменениеABCXYZРаспределенияКлиентов);
	ОписаниеОтчета.Описание = НСтр("ru = 'Изменение ABC/XYZ - распределения клиентов.';
									|en = 'Change ABC/XYZ distribution of customers.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ИндексыЦенНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИндексыЦенНоменклатуры);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка эффективности сдерживания закупочных цен
		|без учета цен отдельных поставщиков.';
		|en = 'Estimate purchasing price regulation effectiveness 
		|not considering prices of certain vendors.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИндексыЦенНоменклатуры");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка эффективности сдерживания закупочных цен
		|без учета цен отдельных поставщиков.';
		|en = 'Estimate purchasing price regulation effectiveness 
		|not considering prices of certain vendors.'");
	#КонецОбласти
	
	#Область ИндексыЦенПоставщиков
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИндексыЦенПоставщиков);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка эффективности сдерживания закупочных цен
		|с учетом цен отдельных поставщиков.';
		|en = 'Estimate purchasing price regulation effectiveness
		|considering prices of certain vendors.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ФормироватьВидыЗапасовПоПоставщикам");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИндексыЦенПоставщиков");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка эффективности сдерживания закупочных цен
		|с учетом цен отдельных поставщиков.';
		|en = 'Estimate purchasing price regulation effectiveness
		|considering prices of certain vendors.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ФормироватьВидыЗапасовПоПоставщикам");
	#КонецОбласти
	
	#Область ИсполнениеПланаЗакупок
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИсполнениеПланаЗакупок);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка фактического состояния закупок товаров по плану.
		|Какие заказы поставщикам еще не поступили на склад?';
		|en = 'Evaluate actual state of goods purchase according to the plan.
		|Check which purchase orders have not been delivered to the warehouse yet.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаЗакупокПоПодразделениям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе подразделений и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by business units and items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаЗакупокПоПоставщикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе поставщиков и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by vendors and by items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаЗакупокПоСкладам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе складов и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by warehouses and items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаОплатПоПоставщикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка исполнения плана по фактическому расходу денежных средств.
		|План и факт поставок от поставщика за период.';
		|en = 'Check payment plan fulfillment against actual cash outflow.
		|View planned and actual shipments from the vendor over the period.'");
	#КонецОбласти
	
	#Область ИсполнениеПланаПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИсполнениеПланаПродаж);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка фактического состояния продаж товаров по плану.
		|Какие заказы клиентов еще не отгружены со склада?';
		|en = 'Evaluate actual state of goods sales according to the plan.
		|Check which sales orders have not been shipped from the warehouse yet.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаОплатПоКлиентам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка исполнения плана оплат по фактическому приходу денежных средств.
		|Плана и факт отгрузок клиенту за период.';
		|en = 'Check payment plan fulfillment against actual cash inflow.
		|View planned and actual shipments to the customer over the period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаПродажПоКлиентам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе клиентов и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by customers and items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаПродажПоМенеджерам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе менеджеров и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by managers and items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаПродажПоПодразделениям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе подразделений и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by business units and items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаПродажПоСкладам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе складов и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by warehouses and items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаПродажПоФорматамМагазинов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе формата магазинов.';
									|en = 'View trends of actual plan fulfillment by retail formats.'");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ИсполнениеПланаПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИсполнениеПланаПроизводства);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Выполнен ли план производства?
		|Насколько выполнен по факту?';
		|en = 'Is the production plan fulfilled? 
		|To what extent is it actually fulfilled?'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаПроизводства");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИсполнениеПланаПроизводстваПоПодразделениям");
	//++ НЕ УТКА
	ОписаниеВарианта.Включен = Ложь;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаПроизводстваПоПодразделениям");
	ОписаниеВарианта.Включен = Истина;
	//-- НЕ УТКА
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка фактического состояния производства продукции по плану.
		|Какие заказы на производство еще не поступили на склад?';
		|en = 'Evaluate actual state of goods production according to the plan.
		|Check which production orders have not been received in the warehouse yet.'");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ИсполнениеПланаСборкиРазборки
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИсполнениеПланаСборкиРазборки);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Выполнен ли план сборок (разборок)?
		|Насколько выполнен по факту?';
		|en = 'Is the kitting plan fulfilled? 
		|To what extent is it actually fulfilled?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаСборкиРазборкиПоСкладам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка фактического состояния сборки (разборки) товаров по плану.
		|Какие заказы на сборку (разборку) еще не поступили на склад?';
		|en = 'Evaluate actual state of goods kitting according to the schedule.
		|Check which kitting orders have not been received in the warehouse yet.'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.Склад.Подсистема.ВнутреннееТовародвижение");
	ОписаниеВарианта.Размещение.Удалить(Подсистема);
	#КонецОбласти
	
	#Область ИсполнениеПланаВнутреннихПотреблений
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИсполнениеПланаВнутреннихПотреблений);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка фактического состояния внутренних потреблений товаров по плану.
		|Какие заказы на внутреннее потребление еще не отгружены со склада?';
		|en = 'Evaluate actual state of inventory consumption according to the plan.
		|Check which inventory consumption orders have not been shipped from the warehouse yet.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаВнутреннихПотребленийПоПодразделениям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе подразделений и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by business units and items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИсполнениеПланаВнутреннихПотребленийПоСкладам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Динамика фактического исполнения плана в разрезе складов и номенклатуры.';
									|en = 'View trends of actual plan fulfillment by warehouses and items.'");
	#КонецОбласти
	
	#Область ИсполнениеРаспоряженийНаПеремещениеСборку
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИсполнениеРаспоряженийНаПеремещениеСборку);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область КалендарьСобытий
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КалендарьСобытий);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Список текущих дел - просроченных и запланированных.';
									|en = 'To-do list - overdue and planned.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Список текущих дел - просроченных и запланированных.';
									|en = 'To-do list - overdue and planned.'");
	#КонецОбласти

	#Область КарточкаРасхода
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КарточкаРасхода);
	ОписаниеОтчета.Описание = 
		НСтр("ru = 'Анализ формирования и выбытия/распределения расхода по указанному варианту распределения в хронологическом порядке.
			|Актуально для расходов с вариантами распределения, предполагающими переходящий остаток между месяцами.';
			|en = 'Analysis of generating and disposing/allocating expenses according to the specified allocation option in chronological order.
			|You can use it for expenses with allocation options involving carryforward between months.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = 
		НСтр("ru = 'Анализ формирования и выбытия/распределения расхода по указанному варианту распределения в хронологическом порядке.
			|Актуально для расходов с вариантами распределения, предполагающими переходящий остаток между месяцами.';
			|en = 'Analysis of generating and disposing/allocating expenses according to the specified allocation option in chronological order.
			|You can use it for expenses with allocation options involving carryforward between months.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НаРасходыБудущихПериодов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Для варианта распределения ""На расходы будущих периодов"".';
									|en = 'For the ""To deferred expenses"" allocation option.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НаСебестоимостьТоваров");
	ОписаниеВарианта.Описание = НСтр("ru = 'Для варианта распределения ""На себестоимость товаров"".';
									|en = 'For the ""To inventory cost"" allocation option.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НаПроизводственныеЗатраты");
	ОписаниеВарианта.Описание = НСтр("ru = 'Для варианта распределения ""На себестоимость производства (распределяемые)"".';
									|en = 'For the ""To production cost (overheads)"" allocation option.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НаСебестоимостьПродаж");
	ОписаниеВарианта.Описание = НСтр("ru = 'Для варианта распределения ""На себестоимость продаж"".';
									|en = 'For the ""To cost of goods sold"" allocation option.'");
	#КонецОбласти
	
	#Область КарточкаРасчетовПоПереданнойВозвратнойТаре
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КарточкаРасчетовПоПереданнойВозвратнойТаре);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область КарточкаРасчетовПоПринятойВозвратнойТаре
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КарточкаРасчетовПоПринятойВозвратнойТаре);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область КарточкаРасчетовСКлиентами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КарточкаРасчетовСКлиентами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область КарточкаРасчетовСКлиентами24
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КарточкаРасчетовСКлиентами24);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Расшифровка взаиморасчетов до документов регистраторов.
		|Какие документы сформировали текущее сальдо расчетов?
		|Как изменялись взаиморасчеты за период?';
		|en = 'Drill down AR/AP items to recorder document level.
		|Check which documents generated the current AR/AP open items.
		|Verify how AR/AP items changed over the period.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Карточка");
	ОписаниеВарианта.Описание = НСтр("ru = 'Расшифровка взаиморасчетов до документов регистраторов.
		|Какие документы сформировали текущее сальдо расчетов?
		|Как изменялись взаиморасчеты за период?';
		|en = 'Drill down AR/AP items to recorder document level.
		|Check which documents generated the current AR/AP open items.
		|Verify how AR/AP items changed over the period.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	#КонецОбласти
	
	#Область КарточкаРасчетовСПоставщиками
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КарточкаРасчетовСПоставщиками);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область КонтактнаяИнформация
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтактнаяИнформация);
	ОписаниеОтчета.ФорматНастроекСКД = Ложь;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "СмТакже");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о клиентах, поставщиках, их основном менеджере, 
		|ABC/XYZ-классификации и контактной информации.';
		|en = 'Information about customers, vendors, their main sales persons, 
		|ABC/XYZ classification and contact details.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоКонтактнымЛицам");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "СмТакже");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о контактных лицах.';
									|en = 'Information on contact persons.'");
	#КонецОбласти
	
	#Область КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке 
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольВыданныхПодотчетномуЛицуАвансовПоЗаявке);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область КонтрольДвиженияПродукцииИМатериаловПоЭтапуПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольДвиженияПродукцииИМатериаловПоЭтапуПроизводства);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область КонтрольНомеровГТДТоваров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольНомеровГТДТоваров);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль корректности учета операций с импортными товарами с указанием номера ГТД и страны происхождения.';
									|en = 'Control accuracy of accounting of transactions with imported goods with specification of a CCD number and country of origin.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольНомеровГТДТоваров");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль корректности учета операций с импортными товарами с указанием номера ГТД и страны происхождения.';
									|en = 'Control accuracy of accounting of transactions with imported goods with specification of a CCD number and country of origin.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольНомеровГТДТоваровБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль корректности учета операций с импортными товарами с указанием номера ГТД и страны происхождения.';
									|en = 'Control accuracy of accounting of transactions with imported goods with specification of a CCD number and country of origin.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	#КонецОбласти
	
	#Область КонтрольОперацийСДенежнымиСредствами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольОперацийСДенежнымиСредствами);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль корректности операций с денежными средствами:
		|- подотчетные лица,
		|- эквайринг (операции с платежными картами),
		|- конвертация валют,
		|- перемещения внутри организации,
		|- перемещения между организациями.';
		|en = 'Control accuracy of cash transactions:
		|- advance holders,
		|- acquiring (payment card transactions),
		|- currency conversion,
		|- transfers inside the company,
		|- transfers between companies.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольОперацийСДенежнымиСредствами");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный контроль корректности операций с денежными средствами.';
									|en = 'Control the accuracy of cash transactions.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольДенежныхСредствУПодотчетныхЛиц");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольОперацийСДенежнымиСредствамиМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный контроль корректности операций с денежными средствами.';
									|en = 'Control the accuracy of cash transactions.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Контроль операций с денежными средствами (моб.)';
										|en = 'Cash transaction control (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область КонтрольОформленияДокументовТовародвижений
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольОформленияДокументовТовародвижений);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль корректности операций с товарно-материальными ценностями.';
									|en = 'Control the accuracy of transactions with inventory'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольОформленияДокументовТовародвижений");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль отражения операций с детализацией до номенклатуры.';
									|en = 'Control transaction recording with itemization to products.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СводныйКонтрольОформленияДокументовТовародвижений");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль отражения операций сводно по номенклатуре с детализацией до документа.';
									|en = 'Control of summary transaction recording by items with itemization to document.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РежимПомощникаИсправленияОстатковТоваровОрганизаций");
	ОписаниеВарианта.Описание = НСтр("ru = 'Режим помощника исправления остатков товаров организаций.';
									|en = 'Company stock balance correction wizard mode.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДетальныеЗаписи");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальные записи.';
									|en = 'Detailed records.'");
	#КонецОбласти
	
	#Область КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие товары находятся в пути?
		|Какие товары поступили на склад неотфактурованными?
		|По каким товарам в пути или неотфактурованным товарам, необходимо оформить таможенную декларацию на импорт?';
		|en = 'Check which goods are in transit.
		|Check which goods received were not invoiced.
		|Check which goods in transit or not invoiced goods require customs import declarations.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольОформленияТоваровВПутиИНеотфактурованныхПоставок");
	#КонецОбласти

	//++ НЕ УТКА

	//++ Устарело_Переработка24
	#Область КонтрольПередачиПродукцииДавальцу
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПередачиПродукцииДавальцу);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько выпущено, передано продукции давальцам?';
									|en = 'How many products are issued, transferred to material providers?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПередачиПродукцииДавальцу");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько выпущено, передано продукции давальцам?';
									|en = 'How many products are issued, transferred to material providers?'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПередачиПродукцииДавальцуКонтекст");
	#КонецОбласти
	//-- Устарело_Переработка24
	
	#Область КонтрольПередачиПродукцииДавальцу2_5
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПередачиПродукцииДавальцу2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько заказано, выпущено, передано продукции давальцам?';
									|en = 'Check how many manufactured products are ordered, released, and transferred to providers.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПередачиПродукцииДавальцу2_5");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько заказано, выпущено, передано продукции давальцам?';
									|en = 'Check how many manufactured products are ordered, released, and transferred to providers.'");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПередачиПродукцииДавальцу2_5Контекст");
	
	#КонецОбласти
	//-- НЕ УТКА
	
	//++ НЕ УТ

	//++ Устарело_Переработка24
	#Область КонтрольПередачиСырьяИМатериаловПереработчику
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПередачиСырьяИМатериаловПереработчику);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько передано сырья и материалов переработчикам по заказам?';
									|en = 'How many raw and consumable materials are transferred to subcontractors against the orders?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПередачиСырьяИМатериаловПереработчику");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько передано сырья и материалов переработчикам по заказам?';
									|en = 'How many raw and consumable materials are transferred to subcontractors against the orders?'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПередачиСырьяИМатериаловПереработчикуКонтекст");
	#КонецОбласти
	//-- Устарело_Переработка24
	
	#Область КонтрольПередачиСырьяИМатериаловПереработчику2_5
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПередачиСырьяИМатериаловПереработчику2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько необходимо передать и передано материалов переработчикам?';
									|en = 'Check how many materials you need to transfer and are transferred to subcontractors.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПередачиСырьяИМатериаловПереработчику2_5");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько необходимо передать и передано материалов переработчикам?';
									|en = 'Check how many materials you need to transfer and are transferred to subcontractors.'");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПередачиСырьяИМатериаловПереработчику2_5Контекст");
	
	#КонецОбласти
	//-- НЕ УТ
	
	#Область КонтрольПередачТоваровМеждуОрганизациями
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПередачТоваровМеждуОрганизациями);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Все ли передачи товаров оформлены?
		|Все ли отчеты комиссии оформлены?
		|Каковы остатки комиссионных товаров?';
		|en = 'Check if all goods transfers are completed.
		|Verify if all consignment notifications have been completed.
		|Track the consignment goods balances.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОформлениеОтчетовПоКомиссии");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ товаров, которые были переданы на комиссию другой организации.
		|Какие получатели еще не отчитались?';
		|en = 'Analyze consignment goods handed over to another company.
		|Verify which recipients have not reported yet.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОформлениеПередачТоваров");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ товаров, проданных по схеме интеркампани.
		|Кто отправитель и получатель?';
		|en = 'Analysis of goods sold under the intercompany scheme. 
		|Who is the sender and the recipient?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыНаКомиссии");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ имеющихся остатков комиссионных товаров организации.
		|От каких организаций приняты товары на комиссию?';
		|en = 'Analyze available stock of company consignment goods.
		|Verify, from which companies consignment goods have been received.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОформлениеПередачТоваровКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОформлениеОтчетовПоКомиссииКонтекст");
	#КонецОбласти
		
	//++ НЕ УТ

	//++ Устарело_Переработка24
	#Область КонтрольПоставкиПродукцииПереработчиком
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПоставкиПродукцииПереработчиком);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько продукции поступило от переработчиков?';
									|en = 'How many products were received from subcontractors?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПоставкиПродукцииПереработчиком");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько продукции поступило от переработчиков?';
									|en = 'How many products were received from subcontractors?'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПоставкиПродукцииПереработчикомКонтекст");
	#КонецОбласти
	//-- Устарело_Переработка24
	
	#Область КонтрольПоставкиПродукцииПереработчиком2_5
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПоставкиПродукцииПереработчиком2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько заказано, выпущено, поступило продукции от переработчиков?';
									|en = 'Check how many manufactured products are ordered, released, and received from subcontractors.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПоставкиПродукцииПереработчиком2_5");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько заказано, выпущено, поступило продукции от переработчиков?';
									|en = 'Check how many manufactured products are ordered, released, and received from subcontractors.'");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПоставкиПродукцииПереработчиком2_5Контекст");
	
	#КонецОбласти
	//-- НЕ УТ
	
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	#Область КонтрольПоставкиСырьяИМатериаловДавальцем 
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПоставкиСырьяИМатериаловДавальцем);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько материалов и сырья поступило от давальцев?
		|Сколько возвращено или списано?';
		|en = 'How much material and raw material were received from material providers?
		|How much of them were returned or written off?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПоставкиСырьяИМатериаловДавальцем");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько материалов и сырья поступило от давальцев?
		|Сколько возвращено или списано?';
		|en = 'How much material and raw material were received from material providers?
		|How much of them were returned or written off?'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПоставкиСырьяИМатериаловДавальцемКонтекст");
	#КонецОбласти
	//-- Устарело_Переработка24
	
	#Область КонтрольПоставкиСырьяИМатериаловДавальцем2_5
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонтрольПоставкиСырьяИМатериаловДавальцем2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько должно поступить и поступило материалов от давальцев?';
									|en = 'Check how many materials are expected and received from providers.'");
		
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольПоставкиСырьяИМатериаловДавальцем2_5");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько должно поступить и поступило материалов от давальцев?';
									|en = 'Check how many materials are expected and received from providers.'");
		
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольПоставкиСырьяИМатериаловДавальцем2_5Контекст");
	
	#КонецОбласти
	//-- НЕ УТКА
	
	//++ НЕ УТ
	#Область ПрименениеПравилаРасчетаРезервовПодОбесценение
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПрименениеПравилаРасчетаРезервовПодОбесценение);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие остатки запасов подпадают под выбранное правило?';
									|en = 'What inventory balances apply to the selected rule?'");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Основной");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область КредиторскаяЗадолженность
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КредиторскаяЗадолженность);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности перед поставщиками с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Accounts payable analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КредиторскаяЗадолженность");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задолженности перед поставщиками с разбивкой по интервалам долга.
		|Например, 0-7 дней, 7-15 дней, 15-30 дней, более 30 дней.';
		|en = 'Accounts payable analysis by debt intervals. 
		|For example, 0-7 days, 7-15 days, 15-30 days, over 30 days.'");
	#КонецОбласти
	
	#Область ЛимитыРасходаДенежныхСредств
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЛимитыРасходаДенежныхСредств);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ использования лимитов за период.';
									|en = 'View variance analysis of cash flow limits over the period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИспользованияЛимитовРасходаДенежныхСредств");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ использования лимитов за период.
		|По каким статьям ДДС есть превышение или лимит израсходован не полностью?';
		|en = 'View variance analysis of cash flow limits over the period.
		|Check which cash flow items have an exceeded limit or not fully reached limit.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ЛимитыРасходаДенежныхСредствКонтекст");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ЛимитыРасходаДенежныхСредствПоДаннымБюджетирования
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЛимитыРасходаДенежныхСредствПоДаннымБюджетирования);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИспользованияЛимитовРасходаДенежныхСредств");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ использования лимитов за период.';
									|en = 'View variance analysis of cash flow limits over the period.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИспользованияЛимитовРасходаДенежныхСредствКонтекст");
	#КонецОбласти
	//-- НЕ УТ
	
	//++ НЕ УТКА
	#Область МониторБюджетныхПроцессов 
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.МониторБюджетныхПроцессов);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область МониторЦелевыхПоказателей
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.МониторЦелевыхПоказателей);
	ОписаниеОтчета.Размещение.Очистить();
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "МониторЦелевыхПоказателей");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль ключевых (целевых) показателей деятельности предприятия.';
									|en = 'Control key (target) values of enterprise activity.'");
	#КонецОбласти
	
	#Область ОборачиваемостьЗапасов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОборачиваемостьЗапасов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какая оборачиваемость у товаров?';
									|en = 'What is the goods turnover?'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОборачиваемостьЗапасов");
	ОписаниеВарианта.Описание = НСтр("ru = 'На каких складах оборачиваемость товаров низкая?
		|Каковы текущие остатки и уровень запасов интересующих товаров?';
		|en = 'Check which warehouses have low goods turnover.
		|Verify the current stock balance and its level.'");
	#КонецОбласти
	
	#Область ОборотноСальдоваяВедомостьАктивовПассивов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОборотноСальдоваяВедомостьАктивовПассивов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОСВАктивовПассивов");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.Описание = НСтр("ru = 'Остатки активов и пассивов на начало и на конец периода и суммы оборотов за период.';
									|en = 'Balance of assets and liabilities as of the start and end of the period and turnover amount for the period.'");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КарточкаАктиваПассива");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ОборотнаяВедомостьБюджетирования
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОборотнаяВедомостьБюджетирования);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение запланированных в рамках сценариев сумм с фактическим исполнением за период.';
									|en = 'Compare amounts planned within scenarios with actual execution over the period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОборотнаяВедомость");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение запланированных в рамках сценариев сумм с фактическим исполнением за период.';
									|en = 'Compare amounts planned within scenarios with actual execution over the period.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОборотнаяВедомостьПоСтатьеБюджетов");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Расшифровка");
	#КонецОбласти
	
	#Область ОборотноСальдоваяВедомостьБюджетирования
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОборотноСальдоваяВедомостьБюджетирования);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение плановых и фактических сальдо и оборотов по показателям за период.';
									|en = 'Compare planned and actual balance and turnovers for the balance items over the period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОборотноСальдоваяВедомость");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение плановых и фактических сальдо и оборотов по показателям за период.';
									|en = 'Compare planned and actual balance and turnovers for the balance items over the period.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОборотноСальдоваяВедомостьПоПоказателюБюджетов");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Расшифровка");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ОплатаЗаявокНаРасходованиеДенежныхСредств
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОплатаЗаявокНаРасходованиеДенежныхСредств);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОплатаЗаявокНаРасходованиеДенежныхСредств");
	#КонецОбласти	
	
	#Область ОстаткиИДвиженияДенежныхСредствВКассахККМ
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОстаткиИДвиженияДенежныхСредствВКассахККМ);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль денежных средств в кассах ККМ.';
									|en = 'Control cash in cash registers.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияДенежныхСредствККМ");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль денежных средств в кассах ККМ.
		|В какой кассе ККМ, когда и сколько денежных средств приходило или уходило?';
		|en = 'Control cash in cash registers.
		|Track in which cash register, when and how much cash was put in and taken out.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьНесколькоВалют");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияДенежныхСредствККМОднаВалюта");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль денежных средств в кассах ККМ.
		|В какой кассе ККМ, когда и сколько денежных средств приходило или уходило?';
		|en = 'Control cash in cash registers.
		|Track in which cash register, when and how much cash was put in and taken out.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьНесколькоВалют");
	#КонецОбласти
	
	#Область ОстаткиИДоступностьТоваров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОстаткиИДоступностьТоваров);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каков остаток товаров и сколько из них доступно?
		|Сколько товаров отгружается, в резерве или в обособлении?
		|Какими заказами зарезервирован товар?';
		|en = 'Check the stock balance. Verify how many goods are available.
		|Track how many goods are shipped, in reserve or assigned.
		|Track by which orders the goods are reserved.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каков остаток товаров и сколько из них доступно?
		|Сколько товаров отгружается, в резерве или в обособлении?
		|Какими заказами зарезервирован товар?';
		|en = 'Check the stock balance. Verify how many goods are available.
		|Track how many goods are shipped, in reserve or assigned.
		|Track by which orders the goods are reserved.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НеИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каков остаток товаров и сколько из них доступно?
		|Сколько товаров отгружается, в резерве или в обособлении?
		|Какими заказами зарезервирован товар?';
		|en = 'Check the stock balance. Verify how many goods are available.
		|Track how many goods are shipped, in reserve or assigned.
		|Track by which orders the goods are reserved.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекстНазначенияБезЗаказа");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИспользоватьНазначенияБезЗаказаМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каков остаток товаров и сколько из них доступно?
		|Сколько товаров отгружается, в резерве или в обособлении?
		|Какими заказами зарезервирован товар?';
		|en = 'Check the stock balance. Verify how many goods are available.
		|Track how many goods are shipped, in reserve or assigned.
		|Track by which orders the goods are reserved.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Остатки и доступность товаров (моб.)';
										|en = 'Stock availability (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ОстаткиТоваровОрганизаций
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОстаткиТоваровОрганизаций);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОстаткиТоваровПереданныхНаКомиссию
	ПостфиксСхемыКомиссии = КомиссионнаяТорговляСервер.ПостфиксСхемыКомиссии();
	НаименованиеВарианта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Остатки товаров, переданных на комиссию (версия %1)';
		|en = 'Remaining consignment stock (version %1)'"),
	ПостфиксСхемыКомиссии);
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОстаткиТоваровПереданныхНаКомиссию);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько, каких товаров у комиссионеров и по какой цене?';
									|en = 'See how many goods and which of them are transferred to consignees, and at what price.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяКомиссионнаяПродажа20");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиТоваровПереданныхНаКомиссию");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько, каких товаров у комиссионеров и по какой цене?
		|Когда товары были переданы на комиссию?';
		|en = 'See how many goods and which of them are transferred to consignees, and at what price.
		|Track when goods were transferred to consignees.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяКомиссионнаяПродажа20");
	#КонецОбласти
	
	//++ НЕ УТ

	//++ Устарело_Переработка24
	#Область ОстаткиТоваровПереданныхПереработчикам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОстаткиТоваровПереданныхПереработчикам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каков остаток сырья и материалов у переработчиков?
	|Какая потребность в сырье и материалах у переработчиков?
	|Какой излишек/дефицит сырья и материалов у переработчиков?';
	|en = 'How much remaining raw and consumable materials do the subcontractors hold?
	|How much raw and consumable materials do the subcontractors need?
	|What surplus/shortage of raw and consumable materials do the subcontractors have?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СырьеИМатериалыУПереработчиков");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каков остаток сырья и материалов у переработчиков?
	|Какая потребность в сырье и материалах у переработчиков?
	|Какой излишек/дефицит сырья и материалов у переработчиков?';
	|en = 'How much remaining raw and consumable materials do the subcontractors hold?
	|How much raw and consumable materials do the subcontractors need?
	|What surplus/shortage of raw and consumable materials do the subcontractors have?'");
	#КонецОбласти
	//-- Устарело_Переработка24

	//-- НЕ УТ
	
	#Область ОстаткиТоваровПринятыхНаКомиссию
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОстаткиТоваровПринятыхНаКомиссию);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько, каких товаров от комитентов и по какой цене?';
									|en = 'Verify how many and which consignor goods are received and at what price.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупках");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиТоваровПринятыхНаКомиссию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько, каких товаров от комитентов и по какой цене?
		|Когда товары были приняты на комиссию?';
		|en = 'Verify how many goods and which of them are received from consignors, and at what price. 
		|Check when goods were received by consignees.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупках");
	#КонецОбласти
	
	#Область ОтклоненияОтУсловийЗакупок
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОтклоненияОтУсловийЗакупок);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОтклоненияОтУсловийПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОтклоненияОтУсловийПродаж);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОтрицательныеОстаткиТоваровОрганизаций
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОтрицательныеОстаткиТоваровОрганизаций);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОтрицательныеОстаткиТоваровИРезервовОрганизаций
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОтрицательныеОстаткиТоваровИРезервовОрганизаций);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область РазвернутоеСальдоПоВидамЗапасовИНомерамГТД
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РазвернутоеСальдоПоВидамЗапасовИНомерамГТД);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОформлениеИзлишковНедостачТоваров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОформлениеИзлишковНедостачТоваров);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОформлениеОтчетовКомитенту
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОформлениеОтчетовКомитенту);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль за своевременным предоставлением отчетности комитенту.';
									|en = 'Control the timeliness of reporting provision to the consignor.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупках");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОформлениеОтчетовКомитенту");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль за своевременным предоставлением отчетности комитенту.
		|По каким товарам, на какие количество и сумму мы не отчитались?';
		|en = 'Control over timely provision of reporting to a consignor.
		|For which goods, and for which quantity and amount have we not reported?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупках");
	#КонецОбласти
	
	#Область ОценкаРентабельностиПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОценкаРентабельностиПродаж);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти

	#Область ОценкаРентабельностиПродаж2_5
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОценкаРентабельностиПродаж2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти

	//++ НЕ УТКА
	#Область ОшибкиВДанныхРаспределенияОстатковНЗП
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОшибкиВДанныхРаспределенияОстатковНЗП);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОшибкиРасчетаКалькуляцииПродукции
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОшибкиРасчетаКалькуляцииПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОшибкиРасчетаКалькуляцииПродукции");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ОшибкиРасчетаКалькуляцииПродукции");
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ПартнерыКоторымОтгрузкаЗапрещена
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПартнерыКоторымОтгрузкаЗапрещена);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каким клиентам запрещена отгрузка?';
									|en = 'Which customers cannot ship?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьЗапретОтгрузки");
	ОписаниеОтчета.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПартнерыКоторымОтгрузкаЗапрещена");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каким клиентам запрещена отгрузка?
		|Кто основной менеджер клиента?
		|Какие причины запрета?';
		|en = 'Check to which customers delivery is blocked.
		|Verify the principal customer manager.
		|Check the delivery block reasons.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьЗапретОтгрузки");
	ОписаниеОтчета.ВидимостьПоУмолчанию = Ложь;
	#КонецОбласти
	
	#Область ПереданнаяВозвратнаяТара
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПереданнаяВозвратнаяТара);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка количества и залоговой суммы невозвращенной клиентом тары.';
									|en = 'Evaluate the quantity and a deposit value of the packaging that a customer has not returned.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПереданнаяВозвратнаяТара");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка количества и залоговой суммы невозвращенной (или возвращенной не вовремя) клиентом тары.
		|Каковы сроки наступления ближайших возвратов?';
		|en = 'Evaluate the quantity and a deposit value of the packaging that a customer has not returned (or has not returned on time).
		|Verify the nearest packaging return date.'");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ПересечениеПравилРасчетаРезервовПодОбесценение
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПересечениеПравилРасчетаРезервовПодОбесценение);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие правила пересекаются по условиям отбора?';
									|en = 'What rules overlap by the filter criteria?'");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ПересеченияСегментаНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПересеченияСегментаНоменклатуры);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ПересеченияСегментаПартнеров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПересеченияСегментаПартнеров);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти

	//++ НЕ УТКА
	#Область ПлановыеИФактическиеЗатратыПеределов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановыеИФактическиеЗатратыПеределов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлановыеИФактическиеЗатратыПеределовПредприятия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы плановые и фактические затраты по выпущенной продукции предприятия?
		|По каким объектам произошли отклонения?';
		|en = 'Check planned and actual costs for the released enterprise products.
		|Verify which objects have variances.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлановыеИФактическиеЗатратыПеределовОрганизации");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы плановые и фактические затраты по выпущенной продукции организации?
		|По каким объектам произошли отклонения?';
		|en = 'Check planned and actual costs for the released enterprise products.
		|Verify which objects have variances.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	#КонецОбласти
	
	#Область ПлановаяИФактическаяСебестоимостьПродукции
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановаяИФактическаяСебестоимостьПродукции);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлановаяФактическаяСебестоимость");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы плановые и фактические затраты по выпущенной продукции в разрезе видов затрат?';
									|en = 'Verify the planned and actual costs for the released products by cost kinds.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	#КонецОбласти
	//-- НЕ УТКА
	
	//++ НЕ УТ
	#Область ПлановаяПотребностьВМатериалах
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановаяПотребностьВМатериалах);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПлановаяПотребностьВМатериалахКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РасшифровкаКонтекст");
	#КонецОбласти
	
	#Область ПлановаяПотребностьВПолуфабрикатах
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановаяПотребностьВПолуфабрикатах);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПлановаяПотребностьВПолуфабрикатахКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РасшифровкаКонтекст");
	#КонецОбласти
	
	#Область ПлановаяПотребностьВТрудовыхРесурсах
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановаяПотребностьВТрудовыхРесурсах);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка потребности в трудовых ресурсах для исполнения планов производства.';
									|en = 'Evaluate demand for human resources to fulfill production plans.'");
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПлановыеТрудозатратыКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РасшифровкаКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Расшифровка");
	#КонецОбласти
	//-- НЕ УТ	
	
	//++ НЕ УТКА
	#Область ПлановаяПотребностьВВидахРЦ
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановаяПотребностьВВидахРЦ);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка потребности в видах РЦ для исполнения планов производства и сопоставление с доступностью для определения дефицита.';
									|en = 'Evaluate demand for work center types to fulfill production plans; and mapping with availability to estimate shortage.'");
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Расшифровка");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПлановаяПотребностьВВидахРЦКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РасшифровкаКонтекст");
	#КонецОбласти
		
	#Область ПланПроизводстваПродукцииИПолуфабрикатов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПланПроизводстваПродукцииИПолуфабрикатов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПланПроизводстваПродукцииИПолуфабрикатовКонтекст");
	#КонецОбласти
	
	#Область ПлановаяСебестоимостьПродукции
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановаяСебестоимостьПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлановаяСебестоимостьПродукции");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы плановые затраты по выпускаемой продукции?';
									|en = 'Check the planned costs for the released products.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПлановаяСебестоимостьПродукцииКонтекст");
	#КонецОбласти
	
	#Область ПлановыеИФактическиеНормативыПроизводственныхРасходов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлановыеИФактическиеНормативыПроизводственныхРасходов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Плановые и фактические нормативы производственных расходов.';
									|en = 'Standard and actual production overheads.'");
											
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлановыеИФактическиеНормативыПроизводственныхРасходов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Плановые и фактические нормативы производственных расходов.';
									|en = 'Standard and actual production overheads.'");
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ПланЗакупок
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПланЗакупок);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ПланФактныйАнализФинансовыхИнструментов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПланФактныйАнализФинансовыхИнструментов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеОтчета.Описание = НСтр("ru = 'Анализ отклонений по фактически произведенным оплатам и начислениям
		|в рамках заключенных договоров.';
		|en = 'Check variance analysis by actual payments and accruals
		|under concluded contracts.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПланФактныйАнализКредитыДепозитыКонтекст");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ПланФактныйАнализФинансовыхИнструментовУТ
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПланФактныйАнализФинансовыхИнструментовУТ);
	ОписаниеОтчета.ФункциональныеОпции.Добавить("УправлениеТорговлей");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеОтчета.Описание = НСтр("ru = 'Анализ отклонений по фактически произведенным оплатам и начислениям
		|в рамках заключенных договоров.';
		|en = 'Check variance analysis by actual payments and accruals
		|under concluded contracts.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПланФактныйАнализКредитыДепозитыКонтекст");
	#КонецОбласти
	
	#Область ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение плановых и фактических количественных показателей торгового представителя.';
									|en = 'Comparison of target and actual quantitative indicators of a sales representative.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВыполнениеЗаданийПоНоменклатуре");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ исполнения заданий торговыми представителями.';
									|en = 'Analysis of how sales representatives have performed their jobs.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВыполнениеЗаданийПоПредставителям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ исполнения заданий торговыми представителями с точностью до номенклатуры.';
									|en = 'Analyze how sales representatives performed their jobs, detailed by items.'");
	#КонецОбласти
	
	#Область ПланФактныйАнализРаботыТорговыхПредставителейПоСумме
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПланФактныйАнализРаботыТорговыхПредставителейПоСумме);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение плановых и фактических суммовых показателей торгового представителя.';
									|en = 'Comparison of scheduled and actual amount indicators of a sales representative.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВыполнениеЗаданийПоСумме");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение плановых и фактических суммовых показателей торгового представителя.';
									|en = 'Comparison of scheduled and actual amount indicators of a sales representative.'");
	#КонецОбласти
	
	#Область ПлатежнаяДисциплинаКлиентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлатежнаяДисциплинаКлиентов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Как часто, на сколько дней и какие клиенты задерживают оплаты?';
									|en = 'How often, for how many days and which customers delay payment?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлатежнаяДисциплинаКлиентов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль просроченной задолженности у клиентов в течении выбранного периода.
		|Как часто, на сколько дней и какие клиенты задерживают оплаты?';
		|en = 'Control total receivables overdue within the selected period.
		|Check how often, for how many days and which customers delay payments.'");
	#КонецОбласти

	#Область ПовторныеПродажи

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПовторныеПродажи);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ и организация стабильных продаж по постоянной клиентской базе.
	    |Каким клиентами будет выгодно сделать своевременное предложение?';
	    |en = 'Analyze and ensure stable sales with a permanent customer base.
	    |Check customers to make a timely offer.'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПолей = НСтр("ru = 'Клиенты
		|Клиент
		|Сегмент
		|Выручка
		|Потенциал
		|Активные
		|Засыпающие
		|Спящие и потерянные
		|Новые
		|Перспективные
		|Верные
		|Телефон
		|Продажи';
		|en = 'Customers
		|Customer
		|Segment
		|Revenue
		|Potential
		|Active
		|Sleepy
		|Sleeping and lost
		|New
		|Probable
		|Loyal
		|Phone
		|Sales'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = НСтр("ru = 'Дата начала
		|Дата окончания
		|Период
		|Организация
		|Менеджер
		|Сумма покупки от
		|Сегмент клиентов
		|Сегмент номенклатуры
		|Номенклатура';
		|en = 'Start date
		|End date
		|Period
		|Company
		|Manager
		|Purchase amount from
		|Customer segment
		|Inventory segment
		|Products'");
	Подсистема = Метаданные.НайтиПоПолномуИмени("Подсистема.CRMИМаркетинг.Подсистема.АнализКлиентскойБазы");
	ОписаниеВарианта.Размещение.Вставить(Подсистема);

	#КонецОбласти

	//++ НЕ УТКА
	#Область ПотребностьВМатериалахПоМоделиГрафикаПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПотребностьВМатериалахПоМоделиГрафикаПроизводства);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ПлатежнаяДисциплинаКлиентов24
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПлатежнаяДисциплинаКлиентов24);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Как часто, на сколько дней и какие клиенты задерживают оплаты?';
									|en = 'How often, for how many days and which customers delay payment?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлатежнаяДисциплинаКлиентов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль просроченной задолженности у клиентов в течении выбранного периода.
		|Как часто, на сколько дней и какие клиенты задерживают оплаты?';
		|en = 'Control total receivables overdue within the selected period.
		|Check how often, for how many days and which customers delay payments.'");
	#КонецОбласти
		
	#Область ПрайсЛист
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПрайсЛист);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие цены установлены на товары?';
									|en = 'What prices are set for goods?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяЦенообразование20");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПрайсЛист");
	ОписаниеВарианта.Описание = НСтр("ru = 'Формирование прайс-листа по выбранным ценам, 
		|при необходимости только товары в наличии.';
		|en = 'Generate price lists by the selected prices,
		|only available goods if required.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПрайсЛистКонтекст");
	#КонецОбласти
	
	#Область ПрайсЛист2_5
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПрайсЛист2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие цены установлены на товары?';
									|en = 'What prices are set for goods?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяЦенообразование25");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПрайсЛист");
	ОписаниеВарианта.Описание = НСтр("ru = 'Формирование прайс-листа по выбранным ценам, 
		|при необходимости только товары в наличии.';
		|en = 'Generate price lists by the selected prices,
		|only available goods if required.'");	
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПрайсЛистКонтекст");
	#КонецОбласти
	
	#Область ПрайсЛистДляПриемаЗаказов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПрайсЛистДляПриемаЗаказов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Печатная форма прайс-листа для выдачи торговому представителю.';
									|en = 'Price list print form to issue to the sales representative.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Печатная форма прайс-листа для выдачи торговому представителю.';
									|en = 'Price list print form to issue to the sales representative.'");
	#КонецОбласти
	
	#Область ПрименениеСерииНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПрименениеСерииНоменклатуры);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПрименениеСерииНоменклатуры");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяСборкаРазборкаИСерииНоменклатуры");
	ОписаниеВарианта.Описание = ?(ИспользоватьПроизводство,
									НСтр("ru = 'В каких изделиях использовалась серия номенклатуры?';
										|en = 'Check in which finished products the item batch was used.'"),
									НСтр("ru = 'В каких комплектах использовалась серия номенклатуры?';
										|en = 'In which kits item batch was used?'"));
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПрименениеСерииНоменклатурыКонтекст");
	#КонецОбласти
	
	#Область ПримененныеСкидкиВДокументе
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПримененныеСкидкиВДокументе);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ПринятаяВозвратнаяТара
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПринятаяВозвратнаяТара);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка количества и залоговой суммы принятой тары.';
									|en = 'Evaluate the quantity and a deposit value of the received packaging.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПринятаяВозвратнаяТара");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка количества и залоговой суммы принятой тары.
		|Каковы сроки наступления ближайших возвратов тары поставщикам?';
		|en = 'Evaluate the quantity and a deposit value of the accepted packaging.
		|Verify what the nearest packaging return to vendors is.'");
	#КонецОбласти
	
	#Область ПричиныЗапретаОтгрузки
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПричиныЗапретаОтгрузки);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ПроверкаСвязейПоказателейБюджетов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроверкаСвязейПоказателейБюджетов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка соответствия настройки связанных статей правилам получения фактических данных показателей бюджетов.';
									|en = 'Check correspondence between linked item settings and actual data query rules of budget balance items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПроверкаСвязейПоказателейБюджетов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка соответствия настройки связанных статей правилам получения фактических данных показателей бюджетов.';
									|en = 'Check correspondence between linked item settings and actual data query rules of budget balance items.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПроверкаСвязейПоказателяБюджетов");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ПродажиМеждуОрганизациями
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПродажиМеждуОрганизациями);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ прибыли при продажах между организациями предприятия.';
									|en = 'Profit analysis on sales among enterprise companies.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПродажиМеждуОрганизациями");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ прибыли, полученной при оформлении продаж товаров между организациями, 
		|входящими в состав торгового предприятия.';
		|en = 'Analyze the profit received upon registering goods sales between companies
		|included in a trading enterprise.'");
	#КонецОбласти
	
	#Область ПродажиСравнениеАналогичныхПериодов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПродажиСравнениеАналогичныхПериодов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ структуры и изменений выручки за несколько периодов - лет, месяцев,
		|недель, дней.';
		|en = 'Analysis of revenue structure and changes for several periods: years, months,
		|weeks, and days.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеПродажАналогичныхПериодов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ структуры и изменений выручки за несколько периодов - лет, месяцев,
		|недель, дней.';
		|en = 'Analysis of revenue structure and changes for several periods: years, months,
		|weeks, and days.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьБизнесРегионы");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеПродажАналогичныхПериодовБизнесРегионы");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ структуры и изменений выручки за несколько периодов - лет, месяцев,
		|недель, дней.';
		|en = 'Analysis of revenue structure and changes for several periods: years, months,
		|weeks, and days.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьБизнесРегионы");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеПродажАналогичныхПериодовМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ структуры и изменений выручки за несколько периодов - лет, месяцев,
		|недель, дней.';
		|en = 'Analysis of revenue structure and changes for several periods: years, months,
		|weeks, and days.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Сравнение продаж аналогичных периодов (моб.)';
										|en = 'Current vs previous sales comparison (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ПродажиСравнениеДвухПериодов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПродажиСравнениеДвухПериодов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ колебаний выручки в сравниваемых периодах
		|по полученному приросту/спаду.';
		|en = 'Analysis of revenue fluctuations in the compared periods
		|by the resulting increase/decrease.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РейтингПродажДвухПериодов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ тренда продаж по сравнению с прошлым периодом?
		|Понижаются или повышаются продажи?';
		|en = 'Analyze the sales trend compared to the previous period.
		|Track if the sales increase or decrease.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьБизнесРегионы");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РейтингПродажДвухПериодовБизнесРегионы");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ тренда продаж по сравнению с прошлым периодом?
		|Понижаются или повышаются продажи?';
		|en = 'Analyze the sales trend compared to the previous period.
		|Track if the sales increase or decrease.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьБизнесРегионы");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеВыручкиДвухПериодов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ продаж по двум периодам
		|по бизнес-регионам и видам номенклатуры.';
		|en = 'Summary analysis of sales for two periods
		|by business regions and kinds of products.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьБизнесРегионы");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеВыручкиДвухПериодовБизнесРегионы");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ продаж по двум периодам
		|по бизнес-регионам и видам номенклатуры.';
		|en = 'Summary analysis of sales for two periods
		|by business regions and kinds of products.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьБизнесРегионы");
	#КонецОбласти
	
	#Область ПроизводительностьРаботниковСклада
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводительностьРаботниковСклада);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка количества обработанных складскими сотрудниками заданий.';
									|en = 'Evaluation of quantity of jobs processed by warehouse workers.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПроизводительностьРаботниковСклада");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка количества обработанных складскими сотрудниками грузов за период.
		|Сколько приемок, размещений, отборов или пересчетов было сделано?';
		|en = 'Estimate the cargo quantity processed by warehouse workers for a period.
		|Verify how many receipts, put-away, pickings, or recounts have been made.'");
	#КонецОбласти
	
	//++ НЕ УТ
	
	#Область ПроизводственныеЗатраты
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатраты);
	ОписаниеОтчета.Описание = НСтр("ru = 'Сводная информация о затратах (материалах, выполненных видах работ и постатейных расходах), партиях производства и выпущенной продукции в разрезе организаций.';
									|en = 'Summary information about costs (materials, kinds of activity performed, and itemized expenses), production lots, and released products by companies.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеТМЦиПроизводственныеЗатратыПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводная информация о затратах (материалах, выполненных видах работ и постатейных расходах), партиях производства и выпущенной продукции по предприятию.';
									|en = 'Summary information about costs (materials, kinds of activity performed, and itemized expenses), production lots, and released products of the enterprise.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	#КонецОбласти
	
	#Область ПроизводственныеЗатратыПоПартиямПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатратыПоПартиямПроизводства);
	ОписаниеОтчета.Описание = НСтр("ru = 'Первичные затраты (материалы, труд и постатейные) отнесенные на партии производства.';
									|en = 'Primary costs (materials, labor, and itemized) allocated to production lots.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;	
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РаспределениеЗатратНаПартииПроизводства");
	ОписаниеВарианта.Описание = НСтр("ru = 'Первичные затраты в разрезе организаций (материалы, труд и постатейные), сгруппированные по местам возникновения затрат.
		|Позволяет увидеть, на какие партии распределены затраты.';
		|en = 'Primary costs by companies (materials, labor, itemized expenses) grouped according to cost centers.
		|It shows allocation of costs per lot.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ГруппировкаЗатратПоПартиямПроизводства");
	ОписаниеВарианта.Описание = НСтр("ru = 'Первичные затраты подразделений в разрезе организаций (материалы, труд и постатейные) сгруппированные по партиям производства.
		|Позволяет увидеть, из каких затрат, каких подразделений сложилась себестоимость партии производства.';
		|en = 'Primary costs of business units by companies (materials, labor, itemized expenses) grouped by production lots. 
		|Allows you to view expenses of business units the production lot costs consist of.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РаспределениеЗатратНаПартииПроизводстваПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Первичные затраты по предприятию в целом (материалы, труд и постатейные), сгруппированные по местам возникновения затрат.
		|Позволяет увидеть, на какие партии распределены затраты.';
		|en = 'Primary costs by the company as a whole (materials, labor, itemized expenses) grouped according to cost centers.
		|It shows allocation of costs per lot.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ГруппировкаЗатратПоПартиямПроизводстваПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Первичные затраты подразделений по предприятию в целом (материалы, труд и постатейные) сгруппированные по партиям производства.
		|Позволяет увидеть, из каких затрат, каких подразделений сложилась себестоимость партии производства.';
		|en = 'Primary business unit expenses by the company as a whole (materials, labor, itemized expenses) grouped by production lots. 
		|Allows you to view expenses of business units influenced the production lot cost.'");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "НачальныйОстаток");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИзрасходованоНаПартииПроизводства");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РасходыНаПроизводство");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонечныйОстаток");
	#КонецОбласти
	
	#Область ПроизводственныеЗатратыПостатейные
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатратыПостатейные);
	ОписаниеОтчета.Описание = НСтр("ru = 'Постатейные производственные расходы в разрезе организаций, отнесенные на подразделение и распределенные на себестоимость продукции.
		|Позволяет проанализировать, все ли постатейные расходы распределены на партии производства.';
		|en = 'Itemized production expenses by companies referred to a business unit and allocated to product cost.
		|It allows you to analyze if all itemized expenses are allocated to production lots.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "НачальныйОстаток");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Поступления");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИзрасходованоНаПартииПроизводства");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонечныйОстаток");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеПостатейныхРасходовПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Постатейные производственные расходы по предприятию в целом, отнесенные на подразделение и распределенные на себестоимость продукции.
		|Позволяет проанализировать, все ли постатейные расходы распределены на партии производства.';
		|en = 'Itemized production expenses of the whole enterprise referred to a business unit and allocated to product cost.
		|It allows you to analyze if all itemized expenses are allocated to production lots.'");
	#КонецОбласти
	
	#Область ПроизводственныеЗатратыТМЦ
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатратыТМЦ);
	ОписаниеОтчета.Описание = НСтр("ru = 'Сводные данные о движении затрат, распределении затрат на партии производства и выпущенной продукции в разрезе организаций.
		|Позволяет проследить поступление материалов, отнесение материалов, трудозатрат и постатейных расходов на партии производства и выпуск продукции.';
		|en = 'Summary information about cost movements, allocation of costs by production lots and released products by companies.
		|Allows you to follow material receipt; allocation of materials, labor costs and itemized expenses to production lots and product release.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "НачальныйОстаток");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Поступления");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Приобретено");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Перемещения");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПередачиНаСклад");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИзрасходованоНаПартииПроизводства");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Произведено");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СписанияНаРасходы");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонечныйОстаток");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеМатериаловПродукцииРаботПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводные данные о движении затрат, распределении затрат на партии производства и выпущенной продукции по предприятию.
		|Позволяет проследить поступление материалов, отнесение материалов, трудозатрат и постатейных расходов на партии производства и выпуск продукции.';
		|en = 'Summary information about cost movements, allocation of costs by production lots and released products by company.
		|Allows you to follow material receipt; allocation of materials, labor costs and itemized expenses to production lots and product release.'");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область ПросроченныеЗадачи
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПросроченныеЗадачи);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадачиВыполненныеСНарушениемСроков");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	#КонецОбласти
	
	#Область РаспределениеТорговыхПредставителей
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РаспределениеТорговыхПредставителей);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Когда, по какому заданию и к какому клиенту планируется визит?';
									|en = 'Verify which customers should be visited. Find out jobs and time of visit.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КалендарьВизитовТорговыхПредставителей");
	ОписаниеВарианта.Описание = НСтр("ru = 'Когда, по какому заданию и к какому клиенту планируется визит?';
									|en = 'Verify which customers should be visited. Find out jobs and time of visit.'");
	#КонецОбласти
	
	#Область РасчетыМеждуОрганизациями
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасчетыМеждуОрганизациями);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль взаиморасчетов между организациями, входящими в состав предприятия.';
									|en = 'Control mutual intercompany AR/AP open items that are a part of an organization.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыПоЗакупкам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль взаиморасчетов между организациями, входящими в состав предприятия.
		|Сколько организация-покупатель должна организации-продавцу?
		|Уменьшился или увеличился долг за выбранный период?';
		|en = 'Control mutual intercompany AR/AP open items that are a part of an organization.
		|Verify the debt of the customer company to the seller company.
		|Check if the debt has increased or decreased over the selected period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыПоПродажам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль взаиморасчетов между организациями, входящими в состав предприятия.
		|Сколько организация-продавец должна получить от организации-покупателя?
		|Уменьшился или увеличился долг за выбранный период?';
		|en = 'Control mutual intercompany AR/AP open items that are a part of an organization.
		|What is the debt of the customer company to the seller company?
		|Has the debt increased or decreased for the selected period?'");
	#КонецОбласти
	
	#Область РасчетыСКлиентами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасчетыСКлиентами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальный анализ взаиморасчетов с клиентами.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Analyze customer AR/AP in detail.
		|Verify how the debt changed over the specified period.
		|Check the current AR/AP balance.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСКлиентами");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальный анализ взаиморасчетов с клиентами.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Analyze customer AR/AP in detail.
		|Verify how the debt changed over the specified period.
		|Check the current AR/AP balance.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСКлиентамиБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальный анализ взаиморасчетов с клиентами.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Analyze customer AR/AP in detail.
		|Verify how the debt changed over the specified period.
		|Check the current AR/AP balance.'");
	#КонецОбласти
	
	#Область РасчетыСПартнерами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасчетыСПартнерами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСПартнерами");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ взаиморасчетов с клиентами и поставщиками.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Summary analysis of AR/AP with customers and vendors.
		|Check how the debt has changed over the specified period.
		|Verify the current AR/AP balance.'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСПартнерамиБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводный анализ взаиморасчетов с клиентами и поставщиками.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Summary analysis of AR/AP with customers and vendors.
		|Check how the debt has changed over the specified period.
		|Verify the current AR/AP balance.'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоКонтрагентамКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоКонтрагентамКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоПартнерамКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоПартнерамКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоСверкеВзаиморасчетовКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоСверкеВзаиморасчетовКонтекстБазовая");
	#КонецОбласти
	
	#Область РасчетыСПоставщиками
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасчетыСПоставщиками);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальный анализ взаиморасчетов с поставщиками.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Detailed analysis of vendor AR/AP.
		|Check how the debt has changed over the specified period.
		|Verify the current AR/AP balance.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСПоставщиками");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальный анализ взаиморасчетов с поставщиками.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Detailed analysis of vendor AR/AP.
		|Check how the debt has changed over the specified period.
		|Verify the current AR/AP balance.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РасчетыСПоставщикамиБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальный анализ взаиморасчетов с поставщиками.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Detailed analysis of vendor AR/AP.
		|Check how the debt has changed over the specified period.
		|Verify the current AR/AP balance.'");
		
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КарточкаРасчетовСПоставщиками24);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Расшифровка взаиморасчетов до документов регистраторов.
		|Какие документы сформировали текущее сальдо расчетов?
		|Как изменялись взаиморасчеты за период?';
		|en = 'Drill down AR/AP items to recorder document level.
		|Check which documents generated the current AR/AP open items.
		|Verify how AR/AP items changed over the period.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Карточка");
	ОписаниеВарианта.Описание = НСтр("ru = 'Расшифровка взаиморасчетов до документов регистраторов.
		|Какие документы сформировали текущее сальдо расчетов?
		|Как изменялись взаиморасчеты за период?';
		|en = 'Drill down AR/AP items to recorder document level.
		|Check which documents generated the current AR/AP open items.
		|Verify how AR/AP items changed over the period.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьРасчетовСПоставщиками);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВедомостьРасчетовСПоставщиками = НСтр("ru = 'Детальный анализ взаиморасчетов с поставщиками.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Detailed analysis of vendor AR/AP.
		|Check how the debt has changed over the specified period.
		|Verify the current AR/AP balance.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСПоставщиками;
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Ведомость");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСПоставщиками;
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьБазовая");
	ОписаниеВарианта.Описание = ОписаниеВедомостьРасчетовСПоставщиками;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'Детальный анализ взаиморасчетов с поставщиками.
		|Как изменялась задолженность за указанный период?
		|Какое текущее сальдо расчетов?';
		|en = 'Detailed analysis of vendor AR/AP.
		|Check how the debt has changed over the specified period.
		|Verify the current AR/AP balance.'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Ведомость с поставщиками (моб.)';
										|en = 'Statement of vendor AR/AP (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область РасшифровкаПоступленийПоНоменклатуре
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаПоступленийПоНоменклатуре); 
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
		
	//++ НЕ УТ
	#Область РасшифровкаСостоянияВыполненияЗаказовПереработчикам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаСостоянияВыполненияЗаказовПереработчикам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТ
	
	//++ НЕ УТКА
	#Область РасшифровкаСтоимостиПереработки
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаСтоимостиПереработки);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	//++ НЕ УТ
	#Область РасшифровкаФормулыБюджетногоОтчета
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаФормулыБюджетногоОтчета);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТ
	
	#Область РеестрКредитовИДепозитов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РеестрКредитовИДепозитов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Реквизиты договоров кредитов и депозитов.';
									|en = 'Credit and deposit contract details.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РеестрДоговоровКредитовДепозитов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Договоры указанного типа с реквизитами,
		|суммами плана оплат и начислений, фактом оплат и начислений,
		|отклонениями и остатком долга по договору.';
		|en = 'View contracts of the specified type with details,
		|amounts of payment and accrual plan, actual payments and accruals,
		|variances and remaining debt under the contract.'");
	#КонецОбласти
	
	#Область РеестрПлатежей
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РеестрПлатежей);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Реестр запланированных поступлений и списаний денежных средств.';
									|en = 'View planned cash inflows and outflows.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗаявкиКОплате");
	ОписаниеВарианта.Описание = НСтр("ru = 'Реестр заявок, утвержденных к оплате.';
									|en = 'Register of requests confirmed for payment.'");
	#КонецОбласти
	
	#Область РеестрИнцидентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РеестрИнцидентов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Список всех инцидентов по исполнителю.
		|Какие инциденты зарегистрированы на исполнителя?
		|Сколько у исполнителя инцидентов и на сколько дней просрочены?';
		|en = 'View the list of all incidents by the assignee.
		|Verify which incidents are registered for the assignee.
		|Check how many incidents the assignee has. Track how many days the incidents are overdue.'"); 
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьИнциденты");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеОтчета.ВидимостьПоУмолчанию = Истина;
	#КонецОбласти
	
	//++ Локализация
	#Область РеестрТорговыхДокументов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РеестрТорговыхДокументов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Список всех торговых документов.';
									|en = 'List of all trade documents.'");
	#КонецОбласти
	//-- Локализация
	
	//++ НЕ УТ
	#Область ВедомостьПоРезервамПредстоящихРасходов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоРезервамПредстоящихРасходов);
	ОписаниеОтчета.Описание = НСтр("ru = 'Ведомость по резервам предстоящих расходов.';
									|en = 'Statement of provisions and contingent liabilities.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РезервыПредстоящихРасходов");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Ведомость по резервам';
										|en = 'Reserve statement '");
	ОписаниеВарианта.Описание = НСтр("ru = 'Ведомость по резервам предстоящих расходов.';
									|en = 'Statement of provisions and contingent liabilities.'");
	#КонецОбласти
	//-- НЕ УТ
	
	//++ НЕ УТ
	#Область РезультатРаботыПравилПолученияФактическихДанных
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РезультатРаботыПравилПолученияФактическихДанных);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РезультатРаботыПравилПоСтатьеБюджетов");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РезультатРаботыПравилПоПоказателюБюджетов");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РезультатРаботыПравилПоСтатьямБюджетов");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РезультатРаботыПравилПоПоказателямБюджетов");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РезультатРаботыПравилПоСтатьямИПоказателямБюджетов");
	#КонецОбласти	
	//-- НЕ УТ
	
	#Область РезультатыСогласованияЗаказаНаВнутреннееПотребление
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РезультатыСогласованияЗаказаНаВнутреннееПотребление);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	

	#Область РезультатыСогласованияЗакупки
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РезультатыСогласованияЗакупки);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РезультатыСогласованияЗаявкиНаВозвратТоваровОтКлиента);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область РезультатыСогласованияПродажи
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РезультатыСогласованияПродажи);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область РезультатыСогласованияЦенНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РезультатыСогласованияЦенНоменклатуры);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область РезультатыТестирования
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РезультатыТестирования);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	//++ НЕ УТ
	#Область РекомендацииПоПовышениюСкоростиРасчетаЭкземпляраБюджета
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РекомендацииПоПовышениюСкоростиРасчетаЭкземпляраБюджета);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область СбалансированностьПлановУП
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СбалансированностьПлановУП);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Выполнимы ли планы потребностей за счет планов обеспечения?';
									|en = 'Track if demand plans can be fulfilled by means of supply plans.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СбалансированностьПлановЗаПериод");
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка корректности составленных планов. 
		|Выполнимы ли планы потребностей за счет планов обеспечения?';
		|en = 'Check correctness of drafted plans. 
		|Track if demand plans can be fulfilled by means of supply plans.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СбалансированностьПлановПоПериодам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка корректности составленных планов. 
		|Выполнимы ли планы потребностей за счет планов обеспечения?';
		|en = 'Check correctness of drafted plans. 
		|Track if demand plans can be fulfilled by means of supply plans.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеСценариевЗаПериод");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение нескольких сценариев между собой. 
		|Каковы отклонения основного сценария относительно дополнительных сценариев?';
		|en = 'Compare several scenarios.
		|Check if there are any deviations of the main scenario from the secondary scenarios.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеСценариевПоПериодам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение нескольких сценариев между собой. 
		|Каковы отклонения основного сценария относительно дополнительных сценариев?';
		|en = 'Compare several scenarios.
		|Check if there are any deviations of the main scenario from the secondary scenarios.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область СбалансированностьПлановУТ
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СбалансированностьПлановУТ);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	//++ НЕ УТ
	ОписаниеВарианта.Включен = Ложь;
	//-- НЕ УТ
	ОписаниеВарианта.Описание = НСтр("ru = 'Выполнимы ли планы потребностей за счет планов обеспечения?';
									|en = 'Track if demand plans can be fulfilled by means of supply plans.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СбалансированностьПлановЗаПериод");
	//++ НЕ УТ
	ОписаниеВарианта.Включен = Ложь;
	//-- НЕ УТ
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка корректности составленных планов. 
		|Выполнимы ли планы потребностей за счет планов обеспечения?';
		|en = 'Check correctness of drafted plans. 
		|Track if demand plans can be fulfilled by means of supply plans.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СбалансированностьПлановПоПериодам");
	//++ НЕ УТ
	ОписаниеВарианта.Включен = Ложь;
	//-- НЕ УТ
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы отклонения основного сценария относительно дополнительных сценариев?';
									|en = 'What are the deviations of the main scenario relative to the secondary scenarios?'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеСценариевЗаПериод");
	//++ НЕ УТ
	ОписаниеВарианта.Включен = Ложь;
	//-- НЕ УТ
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение нескольких сценариев между собой. 
		|Каковы отклонения основного сценария относительно дополнительных сценариев?';
		|en = 'Compare several scenarios.
		|Check if there are any deviations of the main scenario from the secondary scenarios.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеСценариевПоПериодам");
	//++ НЕ УТ
	ОписаниеВарианта.Включен = Ложь;
	//-- НЕ УТ
	ОписаниеВарианта.Описание = НСтр("ru = 'Проверка корректности составленных планов. 
		|Выполнимы ли планы потребностей за счет планов обеспечения?';
		|en = 'Check correctness of drafted plans. 
		|Track if demand plans can be fulfilled by means of supply plans.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	#КонецОбласти
	
	#Область СверкаОстатковОперативногоУчетаИСебестоимости 
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СверкаОстатковОперативногоУчетаИСебестоимости);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СверкаОстатковОперативногоУчетаИСебестоимости");
	//++ Локализация
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ПартионныйУчетВерсии22");
	//-- Локализация
	ОписаниеВарианта.Описание = НСтр("ru = 'Сверка остатков номенклатуры по оперативным регистрам и регистру себестоимости товаров.';
									|en = 'Reconcile inventory balances by current registers and the inventory cost register.'");
	#КонецОбласти
	
	#Область СверкаРасчетовСПартнерами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СверкаРасчетовСПартнерами);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СверкаВзаиморасчетов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задокументированных сверок расчетов с клиентами.
		|Есть ли расхождения между данными от клиента и нашими?';
		|en = 'Analysis of recorded reconciliations of settlements with customers. 
		|Are there discrepancies between the customer''s data and ours?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СверкаВзаиморасчетовБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ задокументированных сверок расчетов с клиентами.
		|Есть ли расхождения между данными от клиента и нашими?';
		|en = 'Analysis of recorded reconciliations of settlements with customers. 
		|Are there discrepancies between the customer''s data and ours?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СверкаВзаиморасчетовКонтекст");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СверкаВзаиморасчетовКонтекстБазовая");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область СвязиПоказателейБюджетов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СвязиПоказателейБюджетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Как обороты бюджетных статей влияют на показатели?';
									|en = 'Check how budget flow item turnovers influence budget balance items.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СвязиСтатейИПоказателейБюджетов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Как обороты бюджетных статей влияют на показатели?';
									|en = 'Check how budget flow item turnovers influence budget balance items.'");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область СертификатыНоменклатурыСИстекающимСрокомДействия
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СертификатыНоменклатурыСИстекающимСрокомДействия);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область СоставПродажи
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СоставПродажи);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область СоставСегмента
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СоставСегмента);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область СостояниеАссортимента
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеАссортимента);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область СостояниеВыполненияДокументов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеВыполненияДокументов);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти

	#Область СостояниеРасчетовСКлиентами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеРасчетовСКлиентами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с клиентами.
		|Какой долг клиента сейчас? На какую сумму планируется отгрузка?
		|На какую сумма ожидается оплата от клиента?';
		|en = 'The current customer AR/AP.
		|Check the customer receivables. Verify the amount of goods to be shipped.
		|Track the amount of customer''s payment.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКлиентами");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с клиентами.
		|Какой долг клиента сейчас? На какую сумму планируется отгрузка?
		|На какую сумма ожидается оплата от клиента?';
		|en = 'The current customer AR/AP.
		|Check the customer receivables. Verify the amount of goods to be shipped.
		|Track the amount of customer''s payment.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКлиентамиБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с клиентами.
		|Какой долг клиента сейчас? На какую сумму планируется отгрузка?
		|На какую сумма ожидается оплата от клиента?';
		|en = 'The current customer AR/AP.
		|Check the customer receivables. Verify the amount of goods to be shipped.
		|Track the amount of customer''s payment.'");

	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовПоОбъектуРасчетовКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовПоОбъектуРасчетовКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКлиентомКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКлиентомКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКлиентамиКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКлиентамиКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовПоОбъектуРасчетовУпрощенныйКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовПоОбъектуРасчетовУпрощенныйКонтекстБазовая");
	#КонецОбласти
	
	#Область СостояниеРасчетовСКлиентамиСамообслуживание
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеРасчетовСКлиентамиСамообслуживание);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеОтчета.ФорматНастроекСКД = Ложь;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти	
	
	#Область СостояниеРасчетовСКомиссионерами
	ПостфиксСхемыКомиссии = КомиссионнаяТорговляСервер.ПостфиксСхемыКомиссии();
	НаименованиеВарианта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Состояние расчетов с комиссионерами (версия %1)';
		|en = 'State of AR/AP with consignees (version %1)'"),
	ПостфиксСхемыКомиссии);
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеРасчетовСКомиссионерами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько комиссионер должен нам за проданные товары?
		|Сколько мы должны комиссионеру, например, по вознаграждениям?';
		|en = 'Track how much a consignee owes us for the sold goods.
		|Verify how much we owe a consignee (for example, fees).'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомиссионерами");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько комиссионер должен нам за проданные товары?
		|Сколько мы должны комиссионеру, например, по вознаграждениям?';
		|en = 'Track how much a consignee owes us for the sold goods.
		|Verify how much we owe a consignee (for example, fees).'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриПродажахНеБазовая");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомиссионерамиБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриПродажахБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомиссионерамиКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомиссионерамиКонтекстБазовая");
	#КонецОбласти
	
	#Область СостояниеРасчетовСКомитентами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеРасчетовСКомитентами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько мы должны комитенту за реализованные товары?
		|Сколько комитент должен нам, например, по вознаграждениям?';
		|en = 'Verify how much we owe a consignor for the sold goods.
		|Check how much the consignor owes us, for example, for commissions.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомитентами");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько мы должны комитенту за реализованные товары?
		|Сколько комитент должен нам, например, по вознаграждениям?';
		|en = 'Verify how much we owe a consignor for the sold goods.
		|Check how much the consignor owes us, for example, for commissions.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупкахНеБазовая");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомитентамиБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупкахБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомитентамиКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСКомитентамиКонтекстБазовая");
	#КонецОбласти
	
	#Область СостояниеРасчетовСПоставщиками
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СостояниеРасчетовСПоставщиками);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с поставщиками.
		|Какой долг поставщику сейчас? На какую сумму планируется поступление?
		|На какую сумма ожидается оплата поставщику?';
		|en = 'The current state of vendor AR/AP.
		|Check the accounts payable to the vendor now. Verify the amount of delivered goods.
		|Check the amount of payment to the vendor.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСПоставщиками");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с поставщиками.
		|Какой долг поставщику сейчас? На какую сумму планируется поступление?
		|На какую сумма ожидается оплата поставщику?';
		|en = 'The current state of vendor AR/AP.
		|Check the accounts payable to the vendor now. Verify the amount of delivered goods.
		|Check the amount of payment to the vendor.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеРасчетовСПоставщикамиБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние расчетов с поставщиками.
		|Какой долг поставщику сейчас? На какую сумму планируется поступление?
		|На какую сумма ожидается оплата поставщику?';
		|en = 'The current state of vendor AR/AP.
		|Check the accounts payable to the vendor now. Verify the amount of delivered goods.
		|Check the amount of payment to the vendor.'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовПоОбъектуРасчетовКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовПоОбъектуРасчетовКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСПоставщикомКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСПоставщикомКонтекстБазовая");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСПоставщикамиКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СостояниеРасчетовСПоставщикамиКонтекстБазовая");
	#КонецОбласти
	//++ НЕ УТ
	
	#Область СправкаРасчетПоказателяБюджетов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетПоказателяБюджетов);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТ
	
	#Область СправкаРасчетПереоценкиВалютныхСредств
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетПереоценкиВалютныхСредств);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Откуда возникают курсовые разницы?
		|Почему требуется переоценка?';
		|en = 'Check where exchange differences come from.
		|Find out why revaluation is required.'");
	#КонецОбласти
	//++ НЕ УТ
	
	#Область СправкаРасчетДвиженияРезервовПодОбесценение
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетДвиженияРезервовПодОбесценение);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каким образом сформировался остаток резерва на момент начала расчета?';
									|en = 'How was the provision balance generated at the beginning of the calculation?'");
	#КонецОбласти
	
	#Область СправкаРасчетРезервовПодОбесценениеЗапасов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетРезервовПодОбесценениеЗапасов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каким образом был произведен расчет формирования/восстановления резерва в выбранном периоде?';
									|en = 'How was the provision generation/recovery calculated in the selected period?'");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область СправочноеРазмещениеНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправочноеРазмещениеНоменклатуры);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Для каких товаров в наличии не назначена основная ячейка?
		|Какие ячейки пусты и не назначены для товаров?';
		|en = 'Check for which goods in stock the main storage bin is not assigned.
		|Verify which storage bins are empty and not assigned for goods.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РазмещениеНоменклатурыПоЯчейкамСправочно");
	ОписаниеВарианта.Описание = НСтр("ru = 'Для каких товаров в наличии не назначена основная ячейка?
		|Какие ячейки пусты и не назначены для товаров?';
		|en = 'Check for which goods in stock the main storage bin is not assigned.
		|Verify which storage bins are empty and not assigned for goods.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РазмещениеНоменклатурыПоЯчейкамСправочноКонтекст");
	#КонецОбласти
	
	#Область СравнениеГрафиковКредитовИДепозитов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СравнениеГрафиковКредитовИДепозитов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ отклонений между двумя вариантами графиков по договорам.';
									|en = 'Analyze variances between two contract schedule options.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СравнениеВариантовГрафиков");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ отклонений между двумя вариантами графиков по договорам.';
									|en = 'Analyze variances between two contract schedule options.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СравнениеВариантовГрафиковКонтекст");
	#КонецОбласти
	
	#Область СравнениеСегментовПартнеров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СравнениеСегментовПартнеров);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько клиентов в сегментах?
		|Какой объем продаж по сегментам?
		|Какое количество сделок и их состояние.';
		|en = 'View how many customers there are in segments.
		|Track the sales volume by segments.
		|Check how many sales opportunities are registered, and what their states are.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько клиентов в сегментах?
		|Какой объем продаж по сегментам?
		|Какое количество сделок и их состояние.';
		|en = 'View how many customers there are in segments.
		|Track the sales volume by segments.
		|Check how many sales opportunities are registered, and what their states are.'");
	#КонецОбласти
	
	#Область СравнительныйАнализДинамикиАссортиментаИПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СравнительныйАнализДинамикиАссортиментаИПродаж);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Как изменяется наполнение ассортимента со временем?';
									|en = 'Verify how the product range completeness change over time.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоКатегориям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Как изменяется наполнение ассортимента со временем?';
									|en = 'Verify how the product range completeness change over time.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	#КонецОбласти
	
	#Область СравнительныйАнализПоказателейРаботыМенеджеров
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СравнительныйАнализПоказателейРаботыМенеджеров);
	ОписаниеОтчета.ФорматНастроекСКД = Ложь;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Комплексный анализ показателей, характеризующих эффективность работы менеджеров.';
									|en = 'Comprehensive analysis of sales person efficiency indicators.'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПолей = НСтр("ru = 'Продажи
		|Прибыль
		|Поступление денежных средств
		|Выручка (по оплате) минус себестоимость (по отгрузке)
		|Соблюдение условий продаж
		|Потери
		|Ручные скидки
		|Продажи на одну сделку
		|Продажи на одно взаимодействие
		|Основные этапы потерь
		|Причины проигрыша сделок
		|Причины неудовлетворения первичного спроса
		|Динамика клиентской базы
		|Продажи новым клиентам
		|Претензии клиентов
		|Причины возникновения претензий клиентов';
		|en = 'Sales
		|Profit
		|Receipt
		|Revenue (by payment) minus cost (by shipment)
		|Compliance with sales terms and conditions
		|Losses
		|Discount adjustments
		|Sales per sales opportunity
		|Sales per interaction
		|Main stages of losses
		|Reasons for losing sales opportunities
		|Reasons for primary demand non-fulfillment
		|Customer base trends
		|Sales to new customers
		|Customer complaints
		|Reasons for customer complaints'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = НСтр("ru = 'Анализируемый период
		|Период для сравнения
		|Показатели
		|Годовая ставка
		|Подразделение
		|Менеджер';
		|en = 'Analyzed period
		|Period for comparison
		|Indicators
		|Annual rate
		|Business unit
		|Manager'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Комплексный анализ показателей, характеризующих эффективность работы менеджеров.
		|Таких, как продажи, прибыль, поступление ДС, скидки и другие.';
		|en = 'Comprehensive analysis of sales person efficiency indicators
		|, such as sales, income, cash receipt, discounts, and other.'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПолей = НСтр("ru = 'Продажи
		|Прибыль
		|Поступление денежных средств
		|Выручка (по оплате) минус себестоимость (по отгрузке)
		|Соблюдение условий продаж
		|Потери
		|Ручные скидки
		|Продажи на одну сделку
		|Продажи на одно взаимодействие
		|Основные этапы потерь
		|Причины проигрыша сделок
		|Причины неудовлетворения первичного спроса
		|Динамика клиентской базы
		|Продажи новым клиентам
		|Претензии клиентов
		|Причины возникновения претензий клиентов';
		|en = 'Sales
		|Profit
		|Receipt
		|Revenue (by payment) minus cost (by shipment)
		|Compliance with sales terms and conditions
		|Losses
		|Discount adjustments
		|Sales per sales opportunity
		|Sales per interaction
		|Main stages of losses
		|Reasons for losing sales opportunities
		|Reasons for primary demand non-fulfillment
		|Customer base trends
		|Sales to new customers
		|Customer complaints
		|Reasons for customer complaints'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = НСтр("ru = 'Анализируемый период
		|Период для сравнения
		|Показатели
		|Годовая ставка
		|Подразделение
		|Менеджер';
		|en = 'Analyzed period
		|Period for comparison
		|Indicators
		|Annual rate
		|Business unit
		|Manager'");
	#КонецОбласти
	
	#Область СтатистикаИнцидентов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СтатистикаИнцидентов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ исполнения инцидентов по ответственному.
		|Какое количество инцидентов на сотруднике? 
		|Количество решенных инцидентов в срок и просроченных?';
		|en = 'Analyze the incident execution by the responsible person. 
		|Verify how many incidents the employee has.
		|Track how many incidents have been solved on time. Check how many incidents are overdue.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьИнциденты");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеОтчета.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОбщаяСтатистикаИнцидентов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ распределения обращений пользователей по видам инцидентов в количественном и процентном отношении.';
									|en = 'Analyze the user support ticket allocation by incident kinds in terms of quantity and percentage.'");
	ОписаниеВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	ОписаниеОтчета.ВидимостьПоУмолчанию = Истина;
	#КонецОбласти

	//++ НЕ УТКА
	#Область СтруктураЗаказаНаПроизводство2_2
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СтруктураЗаказаНаПроизводство2_2);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	#Область СтруктураЗаказаНаПроизводствоДинамическая
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СтруктураЗаказаНаПроизводствоДинамическая);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА	
	
	//++ НЕ УТ
	#Область СтруктураЗатратНаКапитализацию
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СтруктураЗатратНаКапитализацию);
	ОписаниеОтчета.Включен = Истина;
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Включен = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова структура затрат на объект по организациям?';
									|en = 'What is the object cost structure by companies?'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СтруктураЗатрат");
	ОписаниеВарианта.Включен = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова структура затрат на объект по организациям?';
									|en = 'What is the object cost structure by companies?'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СтруктураЗатратПоПредприятию");
	ОписаниеВарианта.Включен = Истина;
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова структура затрат на объект по предприятию?';
									|en = 'What is the object cost structure at enterprise?'");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область СтруктураСерииНоменклатуры
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СтруктураСерииНоменклатуры);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СтруктураСерииНоменклатуры");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяСборкаРазборкаИСерииНоменклатуры");
	ОписаниеВарианта.Описание = ?(ИспользоватьПроизводство,
									НСтр("ru = 'Какие серии использовались при выпуске серии изделия?';
										|en = 'Check which batches were used to release the item batch.'"),
									НСтр("ru = 'Какие серии использовались при сборке серии комплекта?';
										|en = 'Verify which batches were used to assemble the kit batch.'"));
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СтруктураСерииНоменклатурыКонтекст");
	#КонецОбласти

	//++ НЕ УТКА
	#Область СхемаМаршрутнойКарты
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СхемаМаршрутнойКарты);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьМаршрутныеКарты");
	ОписаниеВарианта.Описание = НСтр("ru = 'Последовательность выполнения операций маршрутной карты в виде схемы.';
									|en = 'View the sequence of route sheet operations (flow chart view).'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПолей = НСтр("ru = 'Вид операции
		|Подразделение
		|Вид рабочего центра';
		|en = 'Operation kind
		|Business unit
		|Work center type'");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = НСтр("ru = 'Маршрутная карта
		|Операции вложенных маршрутов';
		|en = 'Route sheet
		|Nested route operations'");
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ТекущаяНаполненностьАссортимента
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТекущаяНаполненностьАссортимента);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова роль, стадия жизни товара в ассортименте?';
									|en = 'Track the role, life cycle stage of goods in the product range.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТекущаяНаполненностьАссортимента");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какова роль, стадия жизни товара в ассортименте?
		|В каких форматах магазинов товар представлен и по какой цене?';
		|en = 'Track the role, life cycle stage of goods in the product range.
		|Check the retail formats and price of the goods.'");
	#КонецОбласти
	
	#Область ТекущиеКвотыАссортимента 
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТекущиеКвотыАссортимента);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Состав и объемы квот товаров ассортимента.';
									|en = 'Content and volume of product range quotas.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПрисутствиеМаркиВКатегориях");
	ОписаниеВарианта.Описание = НСтр("ru = 'В каких категориях товаров присутствуют различные марки?';
									|en = 'Check in which product categories various brands exist.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТекущиеКвотыАссортимента");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие квоты действуют на товары для различных форматов магазинов?';
									|en = 'Check which quotas for goods are valid for different retail formats.'");
	#КонецОбласти
	
	#Область ТоварныйКалендарь
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварныйКалендарь);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы текущие остатки товаров на складах? 
		|Когда планируются отгрузки и поступления товаров?';
		|en = 'Check the current stock balance in warehouses.
		|Verify when shipment and delivery are planned.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы текущие остатки товаров на складах? 
		|Когда планируются отгрузки и поступления товаров?';
		|en = 'Check the current stock balance in warehouses.
		|Verify when shipment and delivery are planned.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварныйКалендарь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НеИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеИспользоватьНазначенияБезЗаказа");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы текущие остатки товаров на складах? 
		|Когда планируются отгрузки и поступления товаров?';
		|en = 'Check the current stock balance in warehouses.
		|Verify when shipment and delivery are planned.'");
	#КонецОбласти
	
	#Область ТоварыВЯчейках
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыВЯчейках);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие товары размещены по складским ячейкам?';
									|en = 'Which goods are placed in the storage bins?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвиженияТоваровВнутриСклада");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие товары размещены по складским ячейкам?
		|Какие товары запланированы к непосредственной выемке или размещению?';
		|en = 'Items in storage bins.
		|Items in Pick lists and Put-away lists.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДвиженияТоваровВЯчейкеКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДвиженияТоваровПоЗаблокированнымЯчейкамКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоОбластиХраненияКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоСкладскойГруппеНоменклатурыКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоЯчейкеКонтекст");
	#КонецОбласти
	
	#Область ТоварыКОтбору
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыКОтбору);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ состояния выполнения отбора товаров из складских ячеек';
									|en = 'Analysis of the state of the selection of goods from storage bins'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВыполнениеОтбораТоваровПоСкладуКонтекст");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ состояния выполнения отбора товаров из складских ячеек';
									|en = 'Analysis of the state of the selection of goods from storage bins'");
	#КонецОбласти
	
	#Область ТоварыКПоступлению
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыКПоступлению);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ состояний распоряжений на поступление.';
									|en = 'Analyze receipt reference states.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СостояниеПриемки");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ состояний распоряжений на поступление.';
									|en = 'Analyze receipt reference states.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыКПоступлению);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ТоварыНаСкладахПоСрокамГодности
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыНаСкладахПоСрокамГодности);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким товарам скоро истекает срок годности?';
									|en = 'Which goods are expiring soon?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиТоваровПоСрокамГодности");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким товарам скоро истекает срок годности?
		|Сколько таких товаров и на каком складе?';
		|en = 'Check which goods are expiring soon.
		|Verify how many of such goods there are and in which warehouse.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоНоменклатуреКонтекст");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиТоваровПоСрокамГодностиМобильныйКлиент");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким товарам скоро истекает срок годности?';
									|en = 'Which goods are expiring soon?'");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Остатки товаров по срокам годности (моб.)';
										|en = 'Stock by shelf life (mob. client)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.Назначение = Перечисления.НазначенияВариантовОтчетов.ДляСмартфонов;
	#КонецОбласти
	
	#Область ТоварыКОтгрузке
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыКОтгрузке);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ состояний распоряжений на отгрузку.';
									|en = 'Analyze shipment reference states.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВыполнениеСборкиОтгрузкиТоваров");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ состояний распоряжений на отгрузку.';
									|en = 'Analyze shipment reference states.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыКОтгрузке);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ТоварыПереданныеНаКомиссию
	ПостфиксСхемыКомиссии = КомиссионнаяТорговляСервер.ПостфиксСхемыКомиссии();
	НаименованиеВарианта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Товары, переданные на комиссию (версия %1)';
		|en = 'Consignment sales stock (version %1)'"),
	ПостфиксСхемыКомиссии);
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПереданныеНаКомиссию);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было передано комиссионеру за период?';
									|en = 'Check how many goods were transferred to the consignee for the period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПереданныеНаКомиссию");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было передано комиссионеру за период?
		|Сколько он продал, списал, вернул или заказал за тот же период?';
		|en = 'Check how many goods were transferred to the consignee for the period.
		|Verify how many of them they sold, wrote off, returned or ordered for the same period.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриПродажахНеБазовая");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПереданныеНаКомиссиюБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриПродажахБазовая");
	#КонецОбласти
	
	#Область ТоварыПереданныеНаКомиссию25
	ПостфиксСхемыКомиссии = КомиссионнаяТорговляСервер.ПостфиксСхемыКомиссии25();
	НаименованиеВарианта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Товары, переданные на комиссию (версия %1)';
		|en = 'Consignment sales stock (version %1)'"), ПостфиксСхемыКомиссии);
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПереданныеНаКомиссию2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было передано комиссионеру за период?
		|Сколько он продал, списал, вернул или заказал за тот же период?';
		|en = 'Check how many goods were transferred to the consignee for the period.
		|Verify how many of them they sold, wrote off, returned or ordered for the same period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПереданныеНаКомиссию");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	ОписаниеВарианта.Наименование = НаименованиеВарианта;
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было передано комиссионеру за период?
		|Сколько он продал, списал, вернул или заказал за тот же период?';
		|en = 'Check how many goods were transferred to the consignee for the period.
		|Verify how many of them they sold, wrote off, returned or ordered for the same period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПереданныеНаКомиссиюБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	#КонецОбласти

	//++ НЕ УТ

	//++ Устарело_Переработка24
	#Область ТоварыПереданныеПереработчикам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПереданныеПереработчикам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько сырья и материалов было передано переработчикам за период?';
									|en = 'How much raw and consumable materials were transferred to subcontractors during the period?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПереданныеНаКомиссию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько сырья и материалов было передано переработчикам за период?
		|Сколько он израсходовал или вернул за тот же период?';
		|en = 'How much raw and consumable materials were transferred to subcontractors during the period?
		|How much did they spend or return during the same period?'");
	#КонецОбласти
	//-- Устарело_Переработка24
	
	#Область ТоварыПереданныеПереработчикам2_5
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПереданныеПереработчикам2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движения товаров, переданных переработчикам, по операциям.
									|Сколько было передано, произведено, израсходовано, передано на склад, списано?';
									|en = 'Analyze transfers of goods transferred to subcontractors by operations.
									|Check how many goods were transferred, produced, spent, transferred to the warehouse, and adjusted.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПереданныеПереработчикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движения товаров, переданных переработчикам, по операциям.
									|Сколько было передано, произведено, израсходовано, передано на склад, списано?';
									|en = 'Analyze transfers of goods transferred to subcontractors by operations.
									|Check how many goods were transferred, produced, spent, transferred to the warehouse, and adjusted.'");
	
	#КонецОбласти
	//-- НЕ УТ
	
	//++ НЕ УТКА
	#Область ТоварыПринятыеВПереработку2_5
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПринятыеВПереработку2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движения товаров, принятых в переработку, по операциям.
									|Сколько было принято, произведено, израсходовано, передано, списано, выкуплено?
									|Сколько необходимо списать, выкупить?
									|По каким позициям необходимо оформить отчеты давальцу?';
									|en = 'Analyze transfers of goods received for subcontracting by operations.
									|Check how many goods were received, produced, spent, transferred, adjusted, and redeemed.
									|Check how many goods you need to adjust and redeem.
									|Specify items to register ""Consumption reports — Subcontracting services delivered"".'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПринятыеВПереработку");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ движения товаров, принятых в переработку, по операциям.
									|Сколько было принято, произведено, израсходовано, передано, списано, выкуплено?
									|Сколько необходимо списать, выкупить?
									|По каким позициям необходимо оформить отчеты давальцу?';
									|en = 'Analyze transfers of goods received for subcontracting by operations.
									|Check how many goods were received, produced, spent, transferred, adjusted, and redeemed.
									|Check how many goods you need to adjust and redeem.
									|Specify items to register ""Consumption reports — Subcontracting services delivered"".'");
	
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ТоварыПринятыеНаКомиссию
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПринятыеНаКомиссию);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, Ложь);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было принято от комитентов за период?';
									|en = 'Verify how many goods were received from consignors for the period.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПринятыеНаКомиссию");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было принято от комитентов за период?
		|Сколько мы продали, списали, вернули или заказали за тот же период?';
		|en = 'Check how many goods were received from consignors for the period.
		|Verify how many of them we sold, consumed, returned, or ordered for the same period.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупкахНеБазовая");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПринятыеНаКомиссиюБазовая");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьКомиссиюПриЗакупкахБазовая");
	#КонецОбласти
	
	#Область ТоварыПринятыеНаХранение
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыПринятыеНаХранение);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было принято на хранение от поклажедателей?';
									|en = 'Check how much VMI was received from vendors.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыПринятыеНаХранение");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сколько товаров было принято на хранение от поклажедателей?
		|Сколько товаров хранится на складах?
		|Сколько принятых на хранение товаров необходимо выкупить?';
		|en = 'Check how much VMI was received from vendors.
		|Verify how many goods are stored in warehouses.
		|Check how much VMI needs to be purchased.'");
	#КонецОбласти
	
	#Область ТоварыСИстекающимиСертификатами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыСИстекающимиСертификатами);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТоварыСИстекающимиСертификатами");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким сертификатам заканчивается срок действия?';
									|en = 'Verify which certificates are expiring soon.'");
	ОписаниеВарианта.Включен = Истина;
	#КонецОбласти
	
	#Область ТоварыСхемыОбеспечения
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварыСхемыОбеспечения);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область УсловияЗакупок
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.УсловияЗакупок);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение условий закупки товаров у различных поставщиков.';
									|en = 'Compare goods purchase conditions of vendors.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "УсловияЗакупок");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение условий закупки товаров у различных поставщиков.';
									|en = 'Compare goods purchase conditions of vendors.'");
	#КонецОбласти
	
	#Область УсловияПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.УсловияПродаж);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеОтчета.ФункциональныеОпции.Добавить("ИспользуетсяЦенообразование20");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение фактических условий продаж товаров с зарегистрированными в соглашениях.';
									|en = 'Comparison between actual sales terms and conditions of goods and conditions registered in agreements.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОбщиеПараметры");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ типовых соглашений о продажах по видам цен, графикам оплат, периодам действия, хозяйственным операциям, складам и срокам поставки номенклатуры.';
									|en = 'Analyze standard sales terms and conditions by price types, payment schedules, validity periods, business transactions, warehouses, and items delivery periods.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Цены");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводные данные по ценовым группам и соглашениям.';
									|en = 'Summary information about price groups and terms of sales.'");
	#КонецОбласти
	
	#Область УсловияПродаж
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.УсловияПродаж2_5);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеОтчета.ФункциональныеОпции.Добавить("ИспользуетсяЦенообразование25");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сравнение фактических условий продаж товаров с зарегистрированными в соглашениях.';
									|en = 'Comparison between actual sales terms and conditions of goods and conditions registered in agreements.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОбщиеПараметры");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ типовых соглашений о продажах по видам цен, графикам оплат, периодам действия, хозяйственным операциям, складам и срокам поставки номенклатуры.';
									|en = 'Analyze standard sales terms and conditions by price types, payment schedules, validity periods, business transactions, warehouses, and items delivery periods.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Цены");
	ОписаниеВарианта.Описание = НСтр("ru = 'Сводные данные по ценовым группам и соглашениям.';
									|en = 'Summary information about price groups and terms of sales.'");
	#КонецОбласти
	
	//++ НЕ УТ
	#Область ФактическаяСебестоимостьПродукции
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ФактическаяСебестоимостьПродукции);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииПредприятия");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы фактические затраты по выпущенной продукции предприятия?';
									|en = 'Verify the actual costs for the released enterprise products.'");	
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииОрганизации");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы фактические затраты по выпущенной продукции организации?';
									|en = 'Verify the actual costs for the released company products.'");	
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекст");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекст");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекстОтчетДавальцу");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьУправлениеПроизводством2_2");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне2_5");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ФактическаяСебестоимостьПродукцииКонтекстОтчетДавальцу");
	#КонецОбласти
	//-- НЕ УТ
	
	#Область УправленческийБаланс
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.УправленческийБаланс);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ финансовых показателей на начало и конец периода и их изменения.';
									|en = 'Analysis of financial indicators on the period start and end, and their changes.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "УправленческийБаланс");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы финансовые показатели по статьям активов и пассивов?
		|Каковы финансовые показатели по организациям и подразделениям?
		|Есть ли нарушение баланса?';
		|en = 'Verify financial indicators of items of assets and liabilities.
		|Check financial indicators of companies and business units.
		|Verify if there is balance violation.'");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "УпрБалансПоНаправлениям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль финансовых показателей по направлениям и статьям активов/пассивов.';
									|en = 'Control over financial indicators by lines of business and asset/liability items.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("УправлениеПредприятием");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "УпрБалансПоОрганизациям");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль финансовых показателей по организациям и статьям активов/пассивов.';
									|en = 'Control over financial indicators by companies and  asset/liability items.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("УправлениеПредприятием");
	#КонецОбласти
	
	#Область УправленческийБалансКонтроль
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.УправленческийБалансКонтроль);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольБалансаКонтекст");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтрольБаланса");
	ОписаниеВарианта.Описание = НСтр("ru = 'Контроль финансовых показателей по месяцам, статьям активов/пассивов и документам.';
									|en = 'Control over financial indicators by months, asset/liability items, and documents.'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("НеБазоваяВерсия");
	#КонецОбласти
	
	#Область ФинансовоеСостояние
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ФинансовоеСостояние);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ФинансовоеСостояниеБазовая");
	ОписаниеВарианта.Описание = НСтр("ru = 'Каковы финансовые показатели по статьям активов и обязательств?';
									|en = 'What are financial indicators of items of assets and liabilities?'");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("БазоваяВерсия");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "УправленческийБалансУстаревший");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольБалансаУстаревший");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КарточкаАктиваПассиваКонтекст");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонтрольВводаОстатковКонтекст");
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область ХодРемонтныхМероприятий
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ХодРемонтныхМероприятий);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие заказы на ремонт оформлены, выполнены или просрочены?';
									|en = 'What R&M orders are registered, completed or overdue?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ХодРемонтныхМероприятий");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какие заказы на ремонт оформлены?
		|Сколько заказов на ремонт выполнено по плану?
		|Есть ли просроченные ремонтные работы?';
		|en = 'View registered R&M orders.
		|Check how many R&M orders are timely completed.
		|Check if there any overdue R&M.'");
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ЭффективностьСделокСКлиентами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ЭффективностьСделокСКлиентами);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какое количество сделок выиграно, проиграно или находится в работе?';
									|en = 'Check how many sales opportunities are won, lost, or in progress.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЭффективностьСделок");
	ОписаниеВарианта.Описание = НСтр("ru = 'Какое количество сделок выиграно, проиграно или находится в работе?
		|На какую потенциальную сумму продаж?';
		|en = 'Check how many sales opportunities are won, lost, or in progress.
		|Verify for what potential sales amount.'");
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область ПартииВПроизводстве
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПартииВПроизводстве);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru = 'По каким партиям запущено производство?
	|В каком подразделении и на каком этапе (операции) находится выполнение?
	|Какие плановые сроки производства, есть ли задержка?';
	|en = 'Check by which lots production is running.
	|Track the business unit in charge and the execution stage (operation).
	|Verify the planned production duration and any possible delay.'");
	#КонецОбласти
	//-- НЕ УТКА	
	
	#Область ВедомостьРасчетовПоФинансовымИнструментам
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьРасчетовПоФинансовымИнструментам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеОтчета.Описание = НСтр("ru = 'Контроль поступлений и списаний денежных средств по финансовым инструментам.';
									|en = 'Control incoming and outgoing payments by financial instruments.'");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ВедомостьРасчетовПоФинансовымИнструментамКонтекст");
	#КонецОбласти
	
	//++ НЕ УТКА
	#Область ПотребностиКФормированиюЭтаповПроизводства
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПотребностиКФормированиюЭтаповПроизводства);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	//++ НЕ УТКА
	#Область КонфликтыВОчередиЗаказовНаПроизводство
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.КонфликтыВОчередиЗаказовНаПроизводство);
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	//-- НЕ УТКА
	
	#Область ВедомостьПоДисконтированнойЗадолженности
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоДисконтированнойЗадолженности);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоДисконтированнойЗадолженности");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ дисконтированной кредиторской задолженности поставщикам.
	|Как изменялись процентные расходы дисконтирования и задолженность за указанный период?';
	|en = 'Analyze the discounted accounts payable to vendors.
	|Check how the discounting interest expenses and debt changed over the specified period.'");
	ОписаниеВарианта.Включен = Истина;
	#КонецОбласти
	
	#Область СправкаРасчетНачисленияПроцентныхРасходовДисконтирования
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетНачисленияПроцентныхРасходовДисконтирования);
	ОписаниеОтчета.Описание = НСтр("ru = 'Определение суммы процентных расходов дисконтирования кредиторской задолженности поставщикам.';
									|en = 'Determine the amount of discounting interest expenses of accounts payable to vendors.'");
	#КонецОбласти

	#Область СправкаРасчетСписанияПроцентныхРасходовДисконтирования
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетСписанияПроцентныхРасходовДисконтирования);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СправкаРасчетСписанияПроцентныхРасходовДисконтирования");
	ОписаниеВарианта.Описание = НСтр("ru = 'Определение суммы списания процентных расходов дисконтирования на указанный месяц
	|с учетом изменения условий оплаты и ставки дисконтирования, проведения оплаты и корректировки.';
	|en = 'Determine the write-off amount of discounting interest expenses for the specified month
	|considering changes in payment terms, discounting rates, payment transactions, and adjustments.'");
	ОписаниеВарианта.Включен = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "КонтекстныйВариант");
	ОписаниеВарианта.Включен = Ложь;
	#КонецОбласти
	
	//++ НЕ УТ
	#Область СправкаРасчетДисконтированиеРезервовПредстоящихРасходов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетДисконтированияРезервовПредстоящихРасходов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СправкаРасчетДисконтированиеРезервовПредстоящихРасходов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Определение суммы процентных расходов дисконтирования резервов предстоящих расходов.';
									|en = 'Identify an interest expense amount of discounting of provisions and contingent liabilities.'");
	ОписаниеВарианта.Включен = Истина;
	#КонецОбласти
	
	#Область СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ изменения суммы процентных расходов дисконтирования объекта учета резервов.';
									|en = 'Analyze changes in the interest expense amount of provision object discounting.'");
	ОписаниеВарианта.Включен = Истина;
	#КонецОбласти
	//-- НЕ УТ
	
	//++ Локализация
	#Область ОтчетСервисПрогнозированияСлужебный
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОтчетСервисПрогнозированияСлужебный);
	ОписаниеОтчета.ВидимостьПоУмолчанию = Ложь;
	ОписаниеОтчета.Описание = НСтр("ru = 'Просмотр и управление прогнозами продаж, полученными из сервиса прогнозирования.';
									|en = 'View and manage sales forecasts received from the forecasting service.'");
	ОписаниеОтчета.Размещение.Очистить();
	#КонецОбласти
	//-- Локализация
	
	//++ НЕ УТКА
	#Область ГрафикПотребленияМатериаловПоЗаказамНаПроизводство
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ГрафикПотребленияМатериаловПоЗаказамНаПроизводство);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Наименование = НСтр("ru = 'График потребления материалов по заказам';
										|en = 'Order material consumption schedule'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка потребности в материалах и полуфабрикатах необходимых для исполнения заказов на производство.';
									|en = 'Estimate demand for materials and semi-finished products required for production orders.'");
	#КонецОбласти
	
	#Область ГрафикЗанятостиТрудовыхРесурсовПоЗаказамНаПроизводство
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ГрафикЗанятостиТрудовыхРесурсовПоЗаказамНаПроизводство);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Наименование = НСтр("ru = 'График занятости трудовых ресурсов по видам работ';
										|en = 'Schedule of human resource occupancy by activity kinds'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка потребности в трудовых ресурсах необходимых для исполнения заказов на производство.';
									|en = 'Estimate demand for human resources required for production orders.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоПодразделениям");
	ОписаниеВарианта.Наименование = НСтр("ru = 'График занятости трудовых ресурсов по подразделениям';
										|en = 'Schedule of human resource occupancy by business units'");
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ТрудоемкостьЗаказаНаПроизводство
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТрудоемкостьЗаказаНаПроизводство);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТрудоемкостьПоЗаказу");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Трудоемкость заказа на производство';
										|en = 'Labor input of production order'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка состояния заказа на производство по плановым и фактическим трудозатратам.';
									|en = 'Evaluate the state of production orders by planned and actual labor costs.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТрудоемкостьПоПартии");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Трудоемкость заказов на производство по партии';
										|en = 'Labor input of production orders by lot'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка состояния по плановым и фактическим трудозатратам по партиям производства.';
									|en = 'Evaluate the state by planned and actual labor costs by production lots.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТрудоемкостьПоЭтапу");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Трудоемкость заказов на производство по этапам';
										|en = 'Labor input of production orders by stages'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка состояния по плановым и фактическим трудозатратам по этапам производства.';
									|en = 'Evaluate the state by planned and actual labor costs by production stages.'");
	
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
		
	#Область РасшифровкаПозицииНоменклатурногоПлана
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаПозицииНоменклатурногоПлана);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти

	#Область УкомплектованностьЗаказов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.УкомплектованностьЗаказов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоВсемЗаказам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Оценка укомплектованности заказов материалами и полуфабрикатами.
		|По каким заказам есть проблемы с обеспечением?
		|Какая часть материалов и полуфабрикатов есть в наличии, будет или не будет в срок?';
		|en = 'Estimate whether orders are equipped with materials and semi-finished products.
		|Check what orders have supply issues.
		|Verify if all materials and semi-finished products are available. If not, check if they will be supplied on time.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоЗаказу");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Укомплектованность заказа на производство';
										|en = 'Production order completeness'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ укомплектованности заказа материалами и полуфабрикатами.
		|По каким материалам и полуфабрикатам есть проблемы с обеспечением?
		|Какие материалы и полуфабрикаты есть в наличии, будут или не будут в срок?';
		|en = 'Analyze whether orders are equipped with materials and semi-finished products.
		|Check what materials and semi-finished products have supply issues.
		|Verify what materials and semi-finished product are available. If not, check if they will be supplied on time.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоНоменклатуре");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Укомплектованность заказов на производство по номенклатуре';
										|en = 'Production order completeness by items'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Анализ укомплектованности заказов по выбранной номенклатуре
		|По каким заказам есть проблемы с обеспечением?';
		|en = 'Analyze order completeness by the selected items
		|Check what orders have supply issues.'");
	
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоИсточникамИДатамКонтекст");
	ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПоЭтапуКонтекст");
	
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ПросроченноеОбеспечениеПозицийЗаказаНаПроизводство
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаПросроченныхПоОбеспечениюПозицииНоменклатурногоПлана);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	//-- НЕ УТКА
	
	#Область ОшибкиВыполненияОтложенныхЗаданий
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОшибкиВыполненияОтложенныхЗаданий);
	
	ОтключитьОтчет(ОписаниеОтчета);
	
	#КонецОбласти
	
КонецПроцедуры

// см. ВариантыОтчетовПереопределяемый.ЗарегистрироватьИзмененияКлючейВариантовОтчетов.
Процедура ЗарегистрироватьИзмененияКлючейВариантовОтчетов(Изменения) Экспорт
	
	ДобавитьИзменениеКлючей(Изменения, "ДебиторскаяЗадолженность", "ИнтервалыГоризонтально", "ДебиторскаяЗадолженность");
	ДобавитьИзменениеКлючей(Изменения, "ДебиторскаяЗадолженность", "ПоРасчетнымДокументам", "ДебиторскаяЗадолженностьПоРасчетнымДокументам");
	ДобавитьИзменениеКлючей(Изменения, "КредиторскаяЗадолженность", "ИнтервалыГоризонтально", "КредиторскаяЗадолженность");
	ДобавитьИзменениеКлючей(Изменения, "КредиторскаяЗадолженность", "ПоРасчетнымДокументам", "КредиторскаяЗадолженностьПоРасчетнымДокументам");
	ДобавитьИзменениеКлючей(Изменения, "ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры", "Основной", "ВедомостьВЦенахНоменклатуры");
	ДобавитьИзменениеКлючей(Изменения, "ВыручкаИСебестоимостьПродаж", "ПродажиСписок", "ПродажиПоПартнерам");
	ДобавитьИзменениеКлючей(Изменения, "ВыручкаИСебестоимостьПродаж", "АнализПродажПоПоставщикам", "ПродажиПоПоставщикам");
	ДобавитьИзменениеКлючей(Изменения, "ВыручкаИСебестоимостьПродаж", "АнализПродажПоБизнесРегионамДиаграмма", "АнализПродажПоБизнесРегионам");
	ДобавитьИзменениеКлючей(Изменения, "ДинамикаПоказателейРаботыТорговыхПредставителей", "Основной", "ДинамикаПоказателейТорговыхПредставителей");
	ДобавитьИзменениеКлючей(Изменения, "КарточкаРасчетовСКлиентами", "Основной", "КарточкаРасчетовСКлиентами");
	ДобавитьИзменениеКлючей(Изменения, "КарточкаРасчетовСПоставщиками", "Основной", "КарточкаРасчетовСПоставщиками");
	ДобавитьИзменениеКлючей(Изменения, "ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству", 
		"ВыполнениеЗаданийПоКоличествуВРазрезеТорговыхПредставителей", "ВыполнениеЗаданийПоПредставителям");
	ДобавитьИзменениеКлючей(Изменения, "ПланФактныйАнализРаботыТорговыхПредставителейПоКоличеству", 
		"ВыполнениеЗаданийПоКоличествуВРазрезеНоменклатуры", "ВыполнениеЗаданийПоНоменклатуре");
	ДобавитьИзменениеКлючей(Изменения, "РаспределениеТорговыхПредставителей", "Основной", "КалендарьВизитовТорговыхПредставителей");
	ДобавитьИзменениеКлючей(Изменения, "РеестрКредитовИДепозитов", "Основной", "РеестрДоговоровКредитовДепозитов");
	ДобавитьИзменениеКлючей(Изменения, "РеестрКредитовИДепозитов", "Горизонтальный", "РеестрДоговоровКредитовДепозитовГоризонтальный");
	ДобавитьИзменениеКлючей(Изменения, "СостояниеРасчетовСКлиентами", "Основной", "СостояниеРасчетовСКлиентами");
	ДобавитьИзменениеКлючей(Изменения, "СостояниеРасчетовСПоставщиками", "Основной", "СостояниеРасчетовСПоставщиками");
	ДобавитьИзменениеКлючей(Изменения, "ТоварныйКалендарь", "Основной", "ТоварныйКалендарь");
	ДобавитьИзменениеКлючей(Изменения, "ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры", "Основной", "ВедомостьПоТоварамОрганизацийВЦенахНоменклатуры");
	
КонецПроцедуры

// Возвращает имя отчета как оно задано в конфигураторе
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
// Возвращаемое значение:
//	Строка - имя отчета без слова "Отчет.".
//
Функция ИмяОтчетаПоКлючуОбъекта(Форма) Экспорт
	Если Форма = Неопределено Тогда
		ИмяОтчета = Неопределено;
	Иначе
		Если ТипЗнч(Форма.НастройкиОтчета.ОтчетСсылка) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
			ИмяОтчета = Форма.НастройкиОтчета.ОтчетСсылка.ИмяОбъекта;
		ИначеЕсли ТипЗнч(Форма.НастройкиОтчета.ОтчетСсылка) = Тип("Строка") Тогда
			ИмяОтчета = СтрЗаменить(Форма.НастройкиОтчета.ОтчетСсылка, "ВнешнийОтчет.", "");
		Иначе
			ИмяОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.НастройкиОтчета.ОтчетСсылка, "Имя");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяОтчета;
КонецФункции

// Отключает указанный отчет со всеми его вариантами от механизма "Варианты отчетов".
//
// Параметры:
//  ОписаниеОтчета - СтрокаДереваЗначений - Передается "как есть" из ВариантыОтчетов.ОписаниеОтчета().
//
Процедура ОтключитьОтчет(ОписаниеОтчета) Экспорт
	
	ОписаниеОтчета.Включен = Ложь;
	
КонецПроцедуры

// Отключает указанный вариант отчета от механизма "Варианты отчетов".
//
// Параметры:
//  Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки
//  ОписаниеОтчета - СтрокаДереваЗначений - Передается "как есть" из см. ВариантыОтчетов.ОписаниеОтчета.
//  КлючВарианта   - Строка - имя варианта отчета.
//
Процедура ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, КлючВарианта) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, КлючВарианта);
	
	ОписаниеВарианта.Включен = Ложь;
	
КонецПроцедуры

// Устанавливает важность для указанного варианта отчета в указанной подсистеме
//
// Параметры:
//  ОписаниеВарианта - СтрокаДереваЗначений - Передается "как есть" из ВариантыОтчетов.ОписаниеОтчета().
//  Важность - Строка -
//               	|- ""        - Вывод отчета в своей группе обычным шрифтом.
//               	|- "Важный"  - Вывод отчета в своей группе жирным шрифтом.
//               	|- "СмТакже" - Вывод отчета в группе "См также".
//  Подсистема - ОбъектМетаданных - если подсистема не указана, то для всех подсистем варианта.
//
Процедура УстановитьВажностьВариантаОтчета(ОписаниеВарианта, Важность, Подсистема = Неопределено) Экспорт
	
	Если ВажностьУказанаВерно(Важность) Тогда
		Размещение = ОписаниеВарианта.Размещение.Получить(Подсистема);
		
		Если Не Размещение = Неопределено Тогда
			ОписаниеВарианта.Размещение.Вставить(Подсистема, Важность);
		Иначе
			Для Каждого Размещение Из ОписаниеВарианта.Размещение Цикл 
				ОписаниеВарианта.Размещение.Вставить(Размещение.Ключ, Важность);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет строку на содержание параметров важности
//
// Параметры:
//  Важность - Строка - возможные варианты: "", "Важный", "СмТакже"
//
// Возвращаемое значение: 
//  Булево   - Истина, если переданная строка равна одному из значений:
//               	|- ""        - Вывод отчета в своей группе обычным шрифтом.
//               	|- "Важный"  - Вывод отчета в своей группе жирным шрифтом.
//               	|- "СмТакже" - Вывод отчета в группе "См также".
//             Ложь, в ином случае.
//
Функция ВажностьУказанаВерно(Важность)
	
	Возврат ПустаяСтрока(Важность) Или Важность = "Важный" Или Важность = "СмТакже";
	
КонецФункции

// Добавляет вариант отчета в таблицу переименования
//
// Параметры:
//  Изменения - см. ВариантыОтчетовПереопределяемый.ЗарегистрироватьИзмененияКлючейВариантовОтчетов
//  ИмяОтчета - Строка - Имя отчета владельца варианта отчета
//  СтароеИмяВарианта - Строка - Имя вариант отчета до переименования
//  АктуальноеИмяВарианта - Строка - Новое имя варианта отчета
//
Процедура ДобавитьИзменениеКлючей(Изменения, ИмяОтчета, СтароеИмяВарианта, АктуальноеИмяВарианта) Экспорт
	
	Изменение = Изменения.Добавить();
	
	Изменение.Отчет 				= Метаданные.Отчеты[ИмяОтчета];
	Изменение.СтароеИмяВарианта 	= СтароеИмяВарианта;
	Изменение.АктуальноеИмяВарианта = АктуальноеИмяВарианта;
	
КонецПроцедуры

// Добавляет или удаляет подсистему из размещений варианта отчета.
//
// Параметры:
//	Размещение - Соответствие из КлючИЗначение - настройки размещения варианта отчета в разделах (подсистемах), где:
//             * Ключ - ОбъектМетаданных - подсистема, в которой размещается отчет или вариант отчета.
//             * Значение - Строка - настройки размещения в подсистеме (группе) - "", "Важный", "СмТакже".
//	Действие - Строка - "Удалить" или "Вставить"
//	ИмяПодсистемы - Строка - имя подсистемы
//		подчиненные подсистемы разделяются ".",	служебные слова "Подсистема" или "Подсистемы" указывать не нужно.
//
Процедура ИзменитьРазмещениеВариантаОтчета(Размещение, Действие, ИмяПодсистемы) Экспорт
	
	Подсистема = ОбщегоНазначенияУТ.ПодсистемаПоИмени(ИмяПодсистемы);
	Если Подсистема = Неопределено Тогда
		Возврат; // нет такой подсистемы в метаданных
	КонецЕсли;
	
	Если Действие = "Удалить" Тогда
		Размещение.Удалить(Подсистема);
	ИначеЕсли Действие = "Вставить" Тогда
		Размещение.Вставить(Подсистема);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыПодменюОтчеты

#Область ВзаимодействияПоКонтакту

// Добавляет команду отчета в список команд.
// 
// Параметры:
// Параметры:
//  КомандыОтчетов - ТаблицаЗначений - таблица команд для вывода в подменю, где:
//   * Идентификатор - Строка   - идентификатор команды.
//   * Представление - Строка   - представление команды в форме.
//   * Важность      - Строка   - суффикс группы в подменю, в которой следует вывести эту команду.
//                                Допустимо использовать: "Важное", "Обычное" и "СмТакже".
//   * Порядок       - Число    - порядок размещения команды в группе. Используется для настройки под конкретное
//                                рабочее место.
//   * Картинка      - Картинка - картинка команды.
//   * СочетаниеКлавиш - СочетаниеКлавиш - сочетание клавиш для быстрого вызова команды.
//   * ТипПараметра - ОписаниеТипов - типы объектов, для которых предназначена эта команда.
//   * ВидимостьВФормах    - Строка - имена форм через запятую, в которых должна отображаться команда.
//                                    Используется когда состав команд отличается для различных форм.
//   * ФункциональныеОпции - Строка - имена функциональных опций через запятую, определяющих видимость команды.
//   * УсловияВидимости    - Массив - определяет видимость команды в зависимости от контекста.
//                                    Для регистрации условий следует использовать процедуру
//                                    ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды().
//                                    Условия объединяются по "И".
//   * ИзменяетВыбранныеОбъекты - Булево - определяет доступность команды в ситуации,
//                                         когда у пользователя нет прав на изменение объекта.
//                                         Если Истина, то в описанной выше ситуации кнопка будет недоступна.
//                                         Необязательный. Значение по умолчанию: Ложь.
//   * МножественныйВыбор - Булево
//                        - Неопределено - если Истина, то команда поддерживает множественный выбор.
//                                         В этом случае в параметре выполнения будет передан список ссылок.
//                                         Необязательный. Значение по умолчанию: Истина.
//   * РежимЗаписи - Строка - действия, связанные с записью объекта, которые выполняются перед обработчиком команды, где:
//                 "НеЗаписывать" - объект не записывается, а в параметрах обработчика вместо ссылок передается
//                                  вся форма. В этом режиме рекомендуется работать напрямую с формой,
//                                  которая передается в структуре 2 параметра обработчика команды.
//                 "ЗаписыватьТолькоНовые" - записывать новые объекты.
//                 "Записывать"            - записывать новые и модифицированные объекты.
//                 "Проводить"             - проводить документы.
//                 Перед записью и проведением у пользователя запрашивается подтверждение.
//                 Необязательный. Значение по умолчанию: "Записывать".
//   * ТребуетсяРаботаСФайлами - Булево - если Истина, то в веб-клиенте предлагается
//                                        установить расширение для работы с 1С:Предприятием.
//                                        Необязательный. Значение по умолчанию: Ложь.
//   * Менеджер - Строка - полное имя объекта метаданных, отвечающего за выполнение команды.
//                         Например, "Отчет._ДемоКнигаПокупок".
//   * ИмяФормы - Строка - имя формы, которую требуется открыть или получить для выполнения команды.
//                         Если Обработчик не указан, то у формы вызывается метод "Открыть".
//   * КлючВарианта - Строка - имя варианта отчета, открываемого при выполнении команды.
//   * ИмяПараметраФормы - Строка - имя параметра формы, в который следует передать ссылку или массив ссылок.
//   * ПараметрыФормы - Неопределено
//                    - Структура - параметры формы, указанной в ИмяФормы.
//   * Обработчик - Строка - описание процедуры, обрабатывающей основное действие команды.
//                  Формат "<ИмяОбщегоМодуля>.<ИмяПроцедуры>" используется когда процедура размещена в общем модуле.
//                  Формат "<ИмяПроцедуры>" используется в следующих случаях:
//                  1) если ИмяФормы заполнено то в модуле указанной формы ожидается клиентская процедура,
//                  2) если ИмяФормы не заполнено то в модуле менеджера этого объекта ожидается серверная процедура.
//   * ДополнительныеПараметры - Структура - параметры обработчика, указанного в Обработчик.
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - 
Функция ДобавитьКомандуВзаимодействияПоКонтакту(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.Взаимодействия) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		КомандаОтчет.Обработчик                  = "МенюОтчетыУТКлиент.ВзаимодействияПоКонтакту";
		КомандаОтчет.Менеджер                    = Метаданные.ЖурналыДокументов.Взаимодействия.Формы.ФормаСпискаПараметрическая.ПолноеИмя();
		КомандаОтчет.Представление               = НСтр("ru = 'Взаимодействия';
														|en = 'Interactions'");
		КомандаОтчет.МножественныйВыбор          = Ложь;
		КомандаОтчет.Важность                    = "СмТакже";
		КомандаОтчет.ФункциональныеОпции         = "ИспользоватьПочтовыйКлиент";
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область СегментыПартнера

// Добавляет команду отчета в список команд.
// 
// Параметры:
// Параметры:
//  КомандыОтчетов - ТаблицаЗначений - таблица команд для вывода в подменю, где:
//   * Идентификатор - Строка   - идентификатор команды.
//   * Представление - Строка   - представление команды в форме.
//   * Важность      - Строка   - суффикс группы в подменю, в которой следует вывести эту команду.
//                                Допустимо использовать: "Важное", "Обычное" и "СмТакже".
//   * Порядок       - Число    - порядок размещения команды в группе. Используется для настройки под конкретное
//                                рабочее место.
//   * Картинка      - Картинка - картинка команды.
//   * СочетаниеКлавиш - СочетаниеКлавиш - сочетание клавиш для быстрого вызова команды.
//   * ТипПараметра - ОписаниеТипов - типы объектов, для которых предназначена эта команда.
//   * ВидимостьВФормах    - Строка - имена форм через запятую, в которых должна отображаться команда.
//                                    Используется когда состав команд отличается для различных форм.
//   * ФункциональныеОпции - Строка - имена функциональных опций через запятую, определяющих видимость команды.
//   * УсловияВидимости    - Массив - определяет видимость команды в зависимости от контекста.
//                                    Для регистрации условий следует использовать процедуру
//                                    ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды().
//                                    Условия объединяются по "И".
//   * ИзменяетВыбранныеОбъекты - Булево - определяет доступность команды в ситуации,
//                                         когда у пользователя нет прав на изменение объекта.
//                                         Если Истина, то в описанной выше ситуации кнопка будет недоступна.
//                                         Необязательный. Значение по умолчанию: Ложь.
//   * МножественныйВыбор - Булево
//                        - Неопределено - если Истина, то команда поддерживает множественный выбор.
//                                         В этом случае в параметре выполнения будет передан список ссылок.
//                                         Необязательный. Значение по умолчанию: Истина.
//   * РежимЗаписи - Строка - действия, связанные с записью объекта, которые выполняются перед обработчиком команды, где:
//                 "НеЗаписывать" - объект не записывается, а в параметрах обработчика вместо ссылок передается
//                                  вся форма. В этом режиме рекомендуется работать напрямую с формой,
//                                  которая передается в структуре 2 параметра обработчика команды.
//                 "ЗаписыватьТолькоНовые" - записывать новые объекты.
//                 "Записывать"            - записывать новые и модифицированные объекты.
//                 "Проводить"             - проводить документы.
//                 Перед записью и проведением у пользователя запрашивается подтверждение.
//                 Необязательный. Значение по умолчанию: "Записывать".
//   * ТребуетсяРаботаСФайлами - Булево - если Истина, то в веб-клиенте предлагается
//                                        установить расширение для работы с 1С:Предприятием.
//                                        Необязательный. Значение по умолчанию: Ложь.
//   * Менеджер - Строка - полное имя объекта метаданных, отвечающего за выполнение команды.
//                         Например, "Отчет._ДемоКнигаПокупок".
//   * ИмяФормы - Строка - имя формы, которую требуется открыть или получить для выполнения команды.
//                         Если Обработчик не указан, то у формы вызывается метод "Открыть".
//   * КлючВарианта - Строка - имя варианта отчета, открываемого при выполнении команды.
//   * ИмяПараметраФормы - Строка - имя параметра формы, в который следует передать ссылку или массив ссылок.
//   * ПараметрыФормы - Неопределено
//                    - Структура - параметры формы, указанной в ИмяФормы.
//   * Обработчик - Строка - описание процедуры, обрабатывающей основное действие команды.
//                  Формат "<ИмяОбщегоМодуля>.<ИмяПроцедуры>" используется когда процедура размещена в общем модуле.
//                  Формат "<ИмяПроцедуры>" используется в следующих случаях:
//                  1) если ИмяФормы заполнено то в модуле указанной формы ожидается клиентская процедура,
//                  2) если ИмяФормы не заполнено то в модуле менеджера этого объекта ожидается серверная процедура.
//   * ДополнительныеПараметры - Структура - параметры обработчика, указанного в Обработчик.
//
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений -
Функция ДобавитьКомандуСегментыПартнера(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ПартнерыСегмента) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		КомандаОтчет.Обработчик                  = "МенюОтчетыУТКлиент.СегментыПартнера";
		КомандаОтчет.Менеджер                    = Метаданные.РегистрыСведений.ПартнерыСегмента.Формы.СегментыПартнераПараметрическая.ПолноеИмя();
		КомандаОтчет.Представление               = НСтр("ru = 'Сегменты';
														|en = 'Segments'");
		КомандаОтчет.МножественныйВыбор          = Ложь;
		КомандаОтчет.Важность                    = "СмТакже";
		КомандаОтчет.ФункциональныеОпции         = "ИспользоватьСегментыПартнеров";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#КонецОбласти
