#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи в регистр заданий.
//
// Параметры:
//  ОбъектРасчета	 - СправочникОбъект.ОбъектыРасчетов  - справочник, для которого необходимо добавить задание.
//  ПолныйРасчет	 - Булево							 - признак, необходимо рассчитать нормативную длительность этапов производства.
//  Автозапуск		 - Булево							 - автоматический запуск.
//
Процедура ДобавитьЗадание(ОбъектРасчета, ПолныйРасчет = Ложь, Автозапуск = Истина) Экспорт
	
	Задание = Новый Структура;
	Задание.Вставить("ОбъектРасчета", ОбъектРасчета);
	Задание.Вставить("ПолныйРасчет",  ПолныйРасчет);
	
	ТаблицаЗаданий = ОтложенныеЗадания.ДобавитьЗаданияВОчередь("ЗаданияКРасчетуДлительностиПроизводства", Задание);
	
	Если Автозапуск Тогда
		
		ОтложенныеЗадания.Запустить(ТаблицаЗаданий);
		
	КонецЕсли;
	
КонецПроцедуры

// Запускает планирование производства
//
// Параметры:
//  Отбор - Неопределено, см. ОтложенныеЗадания.ИдентификаторыЗаписей.Отбор
//
Процедура ЗапуститьЗадание(Отбор = Неопределено) Экспорт
	
	Очередь = "ЗаданияКРасчетуДлительностиПроизводства";
	
	Если ЗначениеЗаполнено(Отбор) Тогда
		
		ТаблицаЗаданий = ОтложенныеЗадания.ИнициализироватьТаблицуЗаданий();
		
		СтрокаТаблицы = ТаблицаЗаданий.Добавить();
		СтрокаТаблицы.Очередь               = Очередь;
		СтрокаТаблицы.ИдентификаторыЗаписей = ОтложенныеЗадания.ИдентификаторыЗаписей(Очередь, Отбор);
		
		ОтложенныеЗадания.Запустить(ТаблицаЗаданий);
		
	Иначе
		
		ОтложенныеЗадания.Запустить(Очередь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли