///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет объекты конфигурации, в формах списках которых размещены команды учета оригиналов первичных документов,
//
// Параметры:
//  СписокОбъектов - Массив из Строка - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ПриОпределенииОбъектовСКомандамиУчетаОригиналов(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовЗакупки.Форма.СписокДокументов");
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовПродажи.Форма.СписокДокументов");
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовАвансовыеОтчеты.Форма.СписокДокументов");
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументов");
	СписокОбъектов.Добавить("Справочник.ДоговорыКонтрагентов.Форма.ФормаСпискаПродажи");
    СписокОбъектов.Добавить("Справочник.ДоговорыКонтрагентов.Форма.ФормаСпискаЗакупки");
    
	//++ Локализация
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовНДС.Форма.СписокДокументов");
	//-- Локализация
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовИнтеркампани.Форма.ФормаСписка");
	//++ НЕ УТ
	
	//++ Устарело_Переработка24
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовПереработки.Форма.СписокДокументов");
	//-- Устарело_Переработка24
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовПередачиВПереработку2_5.Форма.СписокДокументов");
	//-- НЕ УТ

	//++ НЕ УТКА
	СписокОбъектов.Добавить("Обработка.ЖурналДокументовПриемаВПереработку2_5.Форма.СписокДокументов");
	//-- НЕ УТКА
	СписокОбъектов.Добавить("Обработка.ЖурналУчетаОригиналовПервичныхДокументов.Форма.СписокДокументов");

КонецПроцедуры

// Определяет объекты конфигурации, для которых отслеживание состояний будет в разрезе сотрудников.
//
// Параметры:
//  СписокОбъектов - Соответствие из КлючИЗначение:
//          * Ключ - ОбъектМетаданных.
//          * Значение - Строка - наименование табличной части, в которой хранятся сотрудники.
//
Процедура ПриОпределенииМногосотрудниковыхДокументов(СписокОбъектов) Экспорт
	
	

КонецПроцедуры

// Заполняет таблицу значений учета оригиналов
// Если тело процедуры оставить пустым - состояния будут отслеживаться по всем печатным формам подключенных объектов.
// Если в таблицу значений добавить объекты, подключенные к подсистеме учета оригиналов, и их печатные формы,
// то состояния будут отслеживаться только по ним.
//  
// Параметры:
//   ТаблицаУчетаОригиналов - ТаблицаЗначений - коллекция объектов и макетов по которым требуется вести учет оригиналов:
//              * ОбъектМетаданных - ОбъектМетаданных.
//              * Идентификатор - Строка - идентификатор макета.
//
// Пример:
//	 НоваяСтрока = ТаблицаУчетаОригиналов.Добавить();
//	 НоваяСтрока.ОбъектМетаданных = Метаданные.Документы.РеализацияТоваров;
//	 НоваяСтрока.Идентификатор = "РасходнаяНакладная";
//
Процедура ЗаполнитьТаблицуУчетаОригиналов(ТаблицаУчетаОригиналов) Экспорт	
	
	

КонецПроцедуры

#КонецОбласти
