#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи в регистр заданий.
//
// Параметры:
//  ОбъектРасчета - ДокументСсылка.ЗаказНаПроизводство2_2 - документ, для которого необходимо добавить задание.
//  Автозапуск    - Булево - автоматический запуск расчет фоновым заданием.
//
Процедура ДобавитьЗадание(ОбъектРасчета, Автозапуск = Истина) Экспорт
	
	Задание = Новый Структура;
	Задание.Вставить("ОбъектРасчета", ОбъектРасчета);
	
	ТаблицаЗаданий = ОтложенныеЗадания.ДобавитьЗаданияВОчередь(
										"ЗаданияКРасчетуНормативногоГрафикаПроизводства",
										Задание);
	
	Если Автозапуск Тогда
		
		ОтложенныеЗадания.Запустить(ТаблицаЗаданий);
		
	КонецЕсли;
	
КонецПроцедуры

// Запускает в фоновом режиме планирование производства
// Параметры:
//  ОбъектРасчета - ДокументСсылка.ЗаказНаПроизводство2_2 - документ, для которого необходимо запустить задание.
//
Процедура ЗапуститьЗадание(ОбъектРасчета = Неопределено) Экспорт
	
	Очередь = "ЗаданияКРасчетуНормативногоГрафикаПроизводства";
	
	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		
		Отбор = Новый Структура("ОбъектРасчета", ОбъектРасчета);
		
		ТаблицаЗаданий = ОтложенныеЗадания.ИнициализироватьТаблицуЗаданий();
		
		СтрокаТаблицы = ТаблицаЗаданий.Добавить();
		СтрокаТаблицы.Очередь               = Очередь;
		СтрокаТаблицы.ИдентификаторыЗаписей = ОтложенныеЗадания.ИдентификаторыЗаписей(Очередь, Отбор);
		
		ОтложенныеЗадания.Запустить(ТаблицаЗаданий);
		
	Иначе
		
		ОтложенныеЗадания.Запустить(Очередь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
