
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаказа.ИнициализироватьНастройкиРасчетаСтруктурыЗаказа();
	
	СтруктураЗаказаСлужебный.УстановитьИспользованиеРеглЗаданияРасчетСтруктурыЗаказа();
	
	СтруктураЗаказаСлужебный.УстановитьИспользованиеРеглЗаданияСверткаСторноЗаписейВГрафикеПроизводства();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
