#Область СлужебныйПрограммныйИнтерфейс

// Дополняет соответствие объектов финансового учета и источников их данных - имен балансовых регистров накопления.
// Параметры:
//  ИсточникиДанныхОбъектовУчета - см. Перечисления.ОбъектыФинансовогоУчета.ИсточникиДанныхОбъектовФинансовогоУчета
//
Процедура ДополнитьИсточникиДанныхОбъектовФинансовогоУчета(ИсточникиДанныхОбъектовУчета) Экспорт
	
	//++ Локализация
	
	ОбъектыФинансовогоУчета = Перечисления.ОбъектыФинансовогоУчета;
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	
	ИсточникиДанныхОбъектовУчета.Вставить(ОбъектыФинансовогоУчета.ДенежныеДокументы, РегистрыНакопленияМетаданные.ДенежныеДокументы.Имя);
	ИсточникиДанныхОбъектовУчета.Вставить(ОбъектыФинансовогоУчета.РезервыПоВознаграждениям, РегистрыНакопленияМетаданные.ДвиженияПоПрочимАктивамПассивам.Имя);
	ИсточникиДанныхОбъектовУчета.Вставить(ОбъектыФинансовогоУчета.РезервыПоСтраховымВзносам, РегистрыНакопленияМетаданные.ДвиженияПоПрочимАктивамПассивам.Имя);
	
	//-- Локализация
	
КонецПроцедуры

// Добавляет записи в таблицу описания объектов финансового учета.
// 
// Параметры:
// 	ОбъектыФинансовогоУчета - см.Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектовФинансовогоУчета
// 	НастройкиПроводок - см. Справочники.НастройкиФормированияПроводокМеждународногоУчета.НастройкиФормированияПроводок
// 
Процедура ДополнитьОписаниеОбъектовФинансовогоУчета(ОбъектыФинансовогоУчета, НастройкиПроводок) Экспорт
	
	//++ Локализация
	
	СтрокаДенежныеДокументы = ОбъектыФинансовогоУчета.Добавить();
	СтрокаДенежныеДокументы.ОбъектУчета = Перечисления.ОбъектыФинансовогоУчета.ДенежныеДокументы;
	СтрокаДенежныеДокументы.ФункциональныеОпции = Метаданные.ФункциональныеОпции.ИспользоватьРеглУчет.Имя;
	
	СтрокаРезервыПоВознаграждениям = ОбъектыФинансовогоУчета.Добавить();
	СтрокаРезервыПоВознаграждениям.ОбъектУчета = Перечисления.ОбъектыФинансовогоУчета.РезервыПоВознаграждениям;
	ФункциональныеОпции = Новый Массив();
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРезервыПоОплатеТруда.Имя);
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРасчетРезервовОтпусков.Имя);
	СтрокаРезервыПоВознаграждениям.ФункциональныеОпции = ФункциональныеОпции;
	СтрокаРезервыПоВознаграждениям.ПутьКДаннымОбъектНастройки = "Аналитика";
	ОтборДанных = Новый Соответствие();
	ОтборДанных.Вставить("Статья", ПланыВидовХарактеристик.СтатьиАктивовПассивов.РезервыПоВознаграждениям);
	СтрокаРезервыПоВознаграждениям.ОтборДанных = ОтборДанных;
	
	СтрокаРезервыПоСтраховымВзносам = ОбъектыФинансовогоУчета.Добавить();
	СтрокаРезервыПоСтраховымВзносам.ОбъектУчета = Перечисления.ОбъектыФинансовогоУчета.РезервыПоСтраховымВзносам;
	ФункциональныеОпции = Новый Массив();
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРезервыПоОплатеТруда.Имя);
	ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРасчетРезервовОтпусков.Имя);
	СтрокаРезервыПоСтраховымВзносам.ФункциональныеОпции = ФункциональныеОпции;
	СтрокаРезервыПоСтраховымВзносам.ПутьКДаннымОбъектНастройки = "Аналитика";
	ОтборДанных = Новый Соответствие();
	ОтборДанных.Вставить("Статья", ПланыВидовХарактеристик.СтатьиАктивовПассивов.РезервыПоСтраховымВзносам);
	СтрокаРезервыПоСтраховымВзносам.ОтборДанных = ОтборДанных;
	
	//-- Локализация
	
КонецПроцедуры

// Добавляет элементы в соответствие расширенного описания объектов финансового учета.
// 
// Параметры:
//  ОписаниеОбъектовУчетаДляНастройкиФорм - Соответствие Из КлючИЗначение - данные расширенного описания объектов финансового учета:
//  	* Ключ - ПеречислениеСсылка.ОбъектыФинансовогоУчета - объект финансового учета
//  	* Значение - см. Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм
//  ГруппыОбъектовУчета - см. Перечисления.ОбъектыФинансовогоУчета.ГруппыОбъектовУчета
//  НастройкиПроводок - см. Справочники.НастройкиФормированияПроводокМеждународногоУчета.НастройкиФормированияПроводок
//
Процедура ДополнитьРасширенноеОписаниеОбъектовУчетаДляНастройки(
	ОписаниеОбъектовУчетаДляНастройкиФорм, ГруппыОбъектовУчета, НастройкиПроводок) Экспорт
	
	//++ Локализация
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.ДережныеСредства;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'В денежных документах';
												|en = 'In financial documents'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета денежных документов';
																|en = 'Ledger accounts of financial documents'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Неопределено;
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыФинансовогоУчета.ДенежныеДокументы, ОписаниеОбъектаУчета);
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.РезервыПоОплатеТруда;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'Резервы по вознаграждениям';
												|en = 'Remuneration provisions'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета оценочных обязательств по вознаграждениям';
																|en = 'GL accounts of provisions for remunerations'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Новый ОписаниеТипов("СправочникСсылка.Резервы");
	ОписаниеОбъектаУчета.ОтборОбъектовНастройки = Новый Структура(
		Метаданные.Справочники.Резервы.Реквизиты.ТипРезерва.Имя,
		Перечисления.ТипыРезервовПредстоящихРасходов.ОплатаТруда);
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыФинансовогоУчета.РезервыПоВознаграждениям, ОписаниеОбъектаУчета);
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыФинансовогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.РезервыПоОплатеТруда;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'Резервы по страховым взносам';
												|en = 'Insurance contribution provisions'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета оценочных обязательств по страховым взносам';
																|en = 'GL accounts of provisions for insurance contributions'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Новый ОписаниеТипов("СправочникСсылка.Резервы");
	ОписаниеОбъектаУчета.ОтборОбъектовНастройки = Новый Структура(
		Метаданные.Справочники.Резервы.Реквизиты.ТипРезерва.Имя,
		Перечисления.ТипыРезервовПредстоящихРасходов.ОплатаТруда);
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыФинансовогоУчета.РезервыПоСтраховымВзносам, ОписаниеОбъектаУчета);
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти