
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Таблица полей файла.
// 
// Параметры:
//  СтруктураПолейФайла - Структура
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица полей файла:
// * ИмяПоля - Строка
// * Значение - Строка
Функция ТаблицаПолейФайла(СтруктураПолейФайла) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяПоля",  Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
	
	Если СтруктураПолейФайла <> Неопределено Тогда
		Для каждого КлючИЗначение Из СтруктураПолейФайла Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ИмяПоля = КлючИЗначение.Ключ;
			НоваяСтрока.Значение = КлючИЗначение.Значение;
		КонецЦикла;
		Результат.Сортировать("ИмяПоля");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
