#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ НЕ УТ
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.Подразделение) Тогда
			ИсторияРегистрацийВНалоговомОргане = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
			ИсторияРегистрацийВНалоговомОргане.Отбор.СтруктурнаяЕдиница.Установить(Запись.Организация);
			ИсторияРегистрацийВНалоговомОргане.Отбор.Период.Установить(Запись.Период);
			
			НоваяЗаписьИсторииРегистраций = ИсторияРегистрацийВНалоговомОргане.Добавить();
			НоваяЗаписьИсторииРегистраций.СтруктурнаяЕдиница = Запись.Организация;
			НоваяЗаписьИсторииРегистраций.Период = Запись.Период;
			НоваяЗаписьИсторииРегистраций.РегистрацияВНалоговомОргане = Запись.РегистрацияВНалоговомОргане;
			ИсторияРегистрацийВНалоговомОргане.Записать();
		КонецЕсли;
		
		ПодчиненныеСтруктурныеЕдиницы = Справочники.ПодразделенияОрганизаций.ПодчиненныеСтруктурныеЕдиницы(Запись.Организация);
		РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.ОбновитьПодчиненныеСтруктурныеЕдиницы(ПодчиненныеСтруктурныеЕдиницы);
		
	КонецЦикла;
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
